Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h


#ifndef	_HTC_H_
#warning dsPIC30F6010A specific header file included directly. Use #include <htc.h> instead.
#endif

 /* header file for the MICROCHIP PIC microcontroller
    dsPIC30F6010A
 */

#ifndef __dsPIC30F6010A_H
#define __dsPIC30F6010A_H

#include <dspic30f6010a_cfgs.h>


//
// Special Function Register Definitions
//

// Register: WREG0
static volatile unsigned int            WREG0               @ 0x000;

// Register: WREG1
static volatile unsigned int            WREG1               @ 0x002;

// Register: WREG2
static volatile unsigned int            WREG2               @ 0x004;

// Register: WREG3
static volatile unsigned int            WREG3               @ 0x006;

// Register: WREG4
static volatile unsigned int            WREG4               @ 0x008;

// Register: WREG5
static volatile unsigned int            WREG5               @ 0x00A;

// Register: WREG6
static volatile unsigned int            WREG6               @ 0x00C;

// Register: WREG7
static volatile unsigned int            WREG7               @ 0x00E;

// Register: WREG8
static volatile unsigned int            WREG8               @ 0x010;

// Register: WREG9
static volatile unsigned int            WREG9               @ 0x012;

// Register: WREG10
static volatile unsigned int            WREG10              @ 0x014;

// Register: WREG11
static volatile unsigned int            WREG11              @ 0x016;

// Register: WREG12
static volatile unsigned int            WREG12              @ 0x018;

// Register: WREG13
static volatile unsigned int            WREG13              @ 0x01A;

// Register: WREG14
static volatile unsigned int            WREG14              @ 0x01C;

// Register: WREG15
static volatile unsigned int            WREG15              @ 0x01E;

// Register: SPLIM
static volatile unsigned int            SPLIM               @ 0x020;

// Register: ACCAL
static volatile unsigned int            ACCAL               @ 0x022;

// Register: ACCAH
static volatile unsigned int            ACCAH               @ 0x024;

// Register: ACCAU
static volatile unsigned int            ACCAU               @ 0x026;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned SIGNEXT             : 8;
        volatile unsigned ACCAU               : 8;
    };
} ACCAUbits @ 0x026;

// Register: ACCBL
static volatile unsigned int            ACCBL               @ 0x028;

// Register: ACCBH
static volatile unsigned int            ACCBH               @ 0x02A;

// Register: ACCBU
static volatile unsigned int            ACCBU               @ 0x02C;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned SIGNEXT             : 8;
        volatile unsigned ACCBU               : 8;
    };
} ACCBUbits @ 0x02C;

// Register: PCL
static volatile unsigned int            PCL                 @ 0x02E;

// Register: PCH
static volatile unsigned int            PCH                 @ 0x030;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 9;
        volatile unsigned PCH                 : 7;
    };
} PCHbits @ 0x030;

// Register: TBLPAG
static volatile unsigned int            TBLPAG              @ 0x032;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 8;
        volatile unsigned TBLPAG              : 8;
    };
} TBLPAGbits @ 0x032;

// Register: PSVPAG
static volatile unsigned int            PSVPAG              @ 0x034;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 8;
        volatile unsigned PSVPAG              : 8;
    };
} PSVPAGbits @ 0x034;

// Register: RCOUNT
static volatile unsigned int            RCOUNT              @ 0x036;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 2;
        volatile unsigned RCOUNT              : 14;
    };
} RCOUNTbits @ 0x036;

// Register: DCOUNT
static volatile unsigned int            DCOUNT              @ 0x038;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 2;
        volatile unsigned DCOUNT              : 14;
    };
} DCOUNTbits @ 0x038;

// Register: DOSTARTL
static volatile unsigned int            DOSTARTL            @ 0x03A;

// Register: DOSTARTH
static volatile unsigned int            DOSTARTH            @ 0x03C;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 9;
        volatile unsigned DOSTARTH            : 7;
    };
} DOSTARTHbits @ 0x03C;

// Register: DOENDL
static volatile unsigned int            DOENDL              @ 0x03E;

// Register: DOENDH
static volatile unsigned int            DOENDH              @ 0x040;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 9;
        volatile unsigned DOENDH              : 7;
    };
} DOENDHbits @ 0x040;

// Register: SR
static volatile unsigned int            SR                  @ 0x042;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned OA                  : 1;
        volatile unsigned OB                  : 1;
        volatile unsigned SA                  : 1;
        volatile unsigned SB                  : 1;
        volatile unsigned OAB                 : 1;
        volatile unsigned SAB                 : 1;
        volatile unsigned DA                  : 1;
        volatile unsigned DC                  : 1;
        volatile unsigned IPL                 : 3;
        volatile unsigned RA                  : 1;
        volatile unsigned N                   : 1;
        volatile unsigned OV                  : 1;
        volatile unsigned Z                   : 1;
        volatile unsigned C                   : 1;
    };
    struct {
        volatile unsigned                     : 8;
        volatile unsigned IPL2                : 1;
        volatile unsigned IPL1                : 1;
        volatile unsigned IPL0                : 1;
        volatile unsigned                     : 5;
    };
} SRbits @ 0x042;
// bit variable definitions
static volatile bit C                    @ ((unsigned)&SR)*8+0;
static volatile bit Z                    @ ((unsigned)&SR)*8+1;
static volatile bit OV                   @ ((unsigned)&SR)*8+2;
static volatile bit N                    @ ((unsigned)&SR)*8+3;
static volatile bit RA                   @ ((unsigned)&SR)*8+4;
static volatile bit DC                   @ ((unsigned)&SR)*8+8;
static volatile bit DA                   @ ((unsigned)&SR)*8+9;
static volatile bit SAB                  @ ((unsigned)&SR)*8+10;
static volatile bit OAB                  @ ((unsigned)&SR)*8+11;
static volatile bit SB                   @ ((unsigned)&SR)*8+12;
static volatile bit SA                   @ ((unsigned)&SR)*8+13;
static volatile bit OB                   @ ((unsigned)&SR)*8+14;
static volatile bit OA                   @ ((unsigned)&SR)*8+15;
static volatile bit IPL0                 @ ((unsigned)&SR)*8+5;
static volatile bit IPL1                 @ ((unsigned)&SR)*8+6;
static volatile bit IPL2                 @ ((unsigned)&SR)*8+7;

// Register: CORCON
static volatile unsigned int            CORCON              @ 0x044;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 3;
        volatile unsigned US                  : 1;
        volatile unsigned EDT                 : 1;
        volatile unsigned DL                  : 3;
        volatile unsigned SATA                : 1;
        volatile unsigned SATB                : 1;
        volatile unsigned SATDW               : 1;
        volatile unsigned ACCSAT              : 1;
        volatile unsigned IPL3                : 1;
        volatile unsigned PSV                 : 1;
        volatile unsigned RND                 : 1;
        volatile unsigned IF                  : 1;
    };
    struct {
        volatile unsigned                     : 5;
        volatile unsigned DL2                 : 1;
        volatile unsigned DL1                 : 1;
        volatile unsigned DL0                 : 1;
        volatile unsigned                     : 8;
    };
} CORCONbits @ 0x044;
// bit variable definitions
static volatile bit IF                   @ ((unsigned)&CORCON)*8+0;
static volatile bit RND                  @ ((unsigned)&CORCON)*8+1;
static volatile bit PSV                  @ ((unsigned)&CORCON)*8+2;
static volatile bit IPL3                 @ ((unsigned)&CORCON)*8+3;
static volatile bit ACCSAT               @ ((unsigned)&CORCON)*8+4;
static volatile bit SATDW                @ ((unsigned)&CORCON)*8+5;
static volatile bit SATB                 @ ((unsigned)&CORCON)*8+6;
static volatile bit SATA                 @ ((unsigned)&CORCON)*8+7;
static volatile bit EDT                  @ ((unsigned)&CORCON)*8+11;
static volatile bit US                   @ ((unsigned)&CORCON)*8+12;
static volatile bit DL0                  @ ((unsigned)&CORCON)*8+8;
static volatile bit DL1                  @ ((unsigned)&CORCON)*8+9;
static volatile bit DL2                  @ ((unsigned)&CORCON)*8+10;

