Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: MODCON
static volatile unsigned int            MODCON              @ 0x046;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned XMODEN              : 1;
        volatile unsigned YMODEN              : 1;
        volatile unsigned                     : 2;
        volatile unsigned BWM                 : 4;
        volatile unsigned YWM                 : 4;
        volatile unsigned XWM                 : 4;
    };
    struct {
        volatile unsigned                     : 4;
        volatile unsigned BWM3                : 1;
        volatile unsigned BWM2                : 1;
        volatile unsigned BWM1                : 1;
        volatile unsigned BWM0                : 1;
        volatile unsigned YWM3                : 1;
        volatile unsigned YWM2                : 1;
        volatile unsigned YWM1                : 1;
        volatile unsigned YWM0                : 1;
        volatile unsigned XWM3                : 1;
        volatile unsigned XWM2                : 1;
        volatile unsigned XWM1                : 1;
        volatile unsigned XWM0                : 1;
    };
} MODCONbits @ 0x046;
// bit variable definitions
static volatile bit YMODEN               @ ((unsigned)&MODCON)*8+14;
static volatile bit XMODEN               @ ((unsigned)&MODCON)*8+15;
static volatile bit XWM0                 @ ((unsigned)&MODCON)*8+0;
static volatile bit XWM1                 @ ((unsigned)&MODCON)*8+1;
static volatile bit XWM2                 @ ((unsigned)&MODCON)*8+2;
static volatile bit XWM3                 @ ((unsigned)&MODCON)*8+3;
static volatile bit YWM0                 @ ((unsigned)&MODCON)*8+4;
static volatile bit YWM1                 @ ((unsigned)&MODCON)*8+5;
static volatile bit YWM2                 @ ((unsigned)&MODCON)*8+6;
static volatile bit YWM3                 @ ((unsigned)&MODCON)*8+7;
static volatile bit BWM0                 @ ((unsigned)&MODCON)*8+8;
static volatile bit BWM1                 @ ((unsigned)&MODCON)*8+9;
static volatile bit BWM2                 @ ((unsigned)&MODCON)*8+10;
static volatile bit BWM3                 @ ((unsigned)&MODCON)*8+11;

// Register: XMODSRT
static volatile unsigned int            XMODSRT             @ 0x048;

// Register: XMODEND
static volatile unsigned int            XMODEND             @ 0x04A;

// Register: YMODSRT
static volatile unsigned int            YMODSRT             @ 0x04C;

// Register: YMODEND
static volatile unsigned int            YMODEND             @ 0x04E;

// Register: XBREV
static volatile unsigned int            XBREV               @ 0x050;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned BREN                : 1;
        volatile unsigned XB                  : 15;
    };
    struct {
        volatile unsigned                     : 1;
        volatile unsigned XB14                : 1;
        volatile unsigned XB13                : 1;
        volatile unsigned XB12                : 1;
        volatile unsigned XB11                : 1;
        volatile unsigned XB10                : 1;
        volatile unsigned XB9                 : 1;
        volatile unsigned XB8                 : 1;
        volatile unsigned XB7                 : 1;
        volatile unsigned XB6                 : 1;
        volatile unsigned XB5                 : 1;
        volatile unsigned XB4                 : 1;
        volatile unsigned XB3                 : 1;
        volatile unsigned XB2                 : 1;
        volatile unsigned XB1                 : 1;
        volatile unsigned XB0                 : 1;
    };
} XBREVbits @ 0x050;
// bit variable definitions
static volatile bit BREN                 @ ((unsigned)&XBREV)*8+15;
static volatile bit XB0                  @ ((unsigned)&XBREV)*8+0;
static volatile bit XB1                  @ ((unsigned)&XBREV)*8+1;
static volatile bit XB2                  @ ((unsigned)&XBREV)*8+2;
static volatile bit XB3                  @ ((unsigned)&XBREV)*8+3;
static volatile bit XB4                  @ ((unsigned)&XBREV)*8+4;
static volatile bit XB5                  @ ((unsigned)&XBREV)*8+5;
static volatile bit XB6                  @ ((unsigned)&XBREV)*8+6;
static volatile bit XB7                  @ ((unsigned)&XBREV)*8+7;
static volatile bit XB8                  @ ((unsigned)&XBREV)*8+8;
static volatile bit XB9                  @ ((unsigned)&XBREV)*8+9;
static volatile bit XB10                 @ ((unsigned)&XBREV)*8+10;
static volatile bit XB11                 @ ((unsigned)&XBREV)*8+11;
static volatile bit XB12                 @ ((unsigned)&XBREV)*8+12;
static volatile bit XB13                 @ ((unsigned)&XBREV)*8+13;
static volatile bit XB14                 @ ((unsigned)&XBREV)*8+14;

// Register: DISICNT
static volatile unsigned int            DISICNT             @ 0x052;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 2;
        volatile unsigned DISICNT             : 14;
    };
} DISICNTbits @ 0x052;

// Register: INTCON1
static volatile unsigned int            INTCON1             @ 0x080;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned NSTDIS              : 1;
        volatile unsigned                     : 4;
        volatile unsigned OVATE               : 1;
        volatile unsigned OVBTE               : 1;
        volatile unsigned COVTE               : 1;
        volatile unsigned                     : 3;
        volatile unsigned MATHERR             : 1;
        volatile unsigned ADDRERR             : 1;
        volatile unsigned STKERR              : 1;
        volatile unsigned OSCFAIL             : 1;
        volatile unsigned                     : 1;
    };
} INTCON1bits @ 0x080;
// bit variable definitions
static volatile bit OSCFAIL              @ ((unsigned)&INTCON1)*8+1;
static volatile bit STKERR               @ ((unsigned)&INTCON1)*8+2;
static volatile bit ADDRERR              @ ((unsigned)&INTCON1)*8+3;
static volatile bit MATHERR              @ ((unsigned)&INTCON1)*8+4;
static volatile bit COVTE                @ ((unsigned)&INTCON1)*8+8;
static volatile bit OVBTE                @ ((unsigned)&INTCON1)*8+9;
static volatile bit OVATE                @ ((unsigned)&INTCON1)*8+10;
static volatile bit NSTDIS               @ ((unsigned)&INTCON1)*8+15;

// Register: INTCON2
static volatile unsigned int            INTCON2             @ 0x082;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned ALTIVT              : 1;
        volatile unsigned DISI                : 1;
        volatile unsigned                     : 9;
        volatile unsigned INT4EP              : 1;
        volatile unsigned INT3EP              : 1;
        volatile unsigned INT2EP              : 1;
        volatile unsigned INT1EP              : 1;
        volatile unsigned INT0EP              : 1;
    };
} INTCON2bits @ 0x082;
// bit variable definitions
static volatile bit INT0EP               @ ((unsigned)&INTCON2)*8+0;
static volatile bit INT1EP               @ ((unsigned)&INTCON2)*8+1;
static volatile bit INT2EP               @ ((unsigned)&INTCON2)*8+2;
static volatile bit INT3EP               @ ((unsigned)&INTCON2)*8+3;
static volatile bit INT4EP               @ ((unsigned)&INTCON2)*8+4;
static volatile bit DISI                 @ ((unsigned)&INTCON2)*8+14;
static volatile bit ALTIVT               @ ((unsigned)&INTCON2)*8+15;

// Register: IFS0
static volatile unsigned int            IFS0                @ 0x084;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned CNIF                : 1;
        volatile unsigned MI2CIF              : 1;
        volatile unsigned SI2CIF              : 1;
        volatile unsigned NVMIF               : 1;
        volatile unsigned ADIF                : 1;
        volatile unsigned U1TXIF              : 1;
        volatile unsigned U1RXIF              : 1;
        volatile unsigned SPI1IF              : 1;
        volatile unsigned T3IF                : 1;
        volatile unsigned T2IF                : 1;
        volatile unsigned OC2IF               : 1;
        volatile unsigned IC2IF               : 1;
        volatile unsigned T1IF                : 1;
        volatile unsigned OC1IF               : 1;
        volatile unsigned IC1IF               : 1;
        volatile unsigned INT0IF              : 1;
    };
} IFS0bits @ 0x084;
// bit variable definitions
static volatile bit INT0IF               @ ((unsigned)&IFS0)*8+0;
static volatile bit IC1IF                @ ((unsigned)&IFS0)*8+1;
static volatile bit OC1IF                @ ((unsigned)&IFS0)*8+2;
static volatile bit T1IF                 @ ((unsigned)&IFS0)*8+3;
static volatile bit IC2IF                @ ((unsigned)&IFS0)*8+4;
static volatile bit OC2IF                @ ((unsigned)&IFS0)*8+5;
static volatile bit T2IF                 @ ((unsigned)&IFS0)*8+6;
static volatile bit T3IF                 @ ((unsigned)&IFS0)*8+7;
static volatile bit SPI1IF               @ ((unsigned)&IFS0)*8+8;
static volatile bit U1RXIF               @ ((unsigned)&IFS0)*8+9;
static volatile bit U1TXIF               @ ((unsigned)&IFS0)*8+10;
static volatile bit ADIF                 @ ((unsigned)&IFS0)*8+11;
static volatile bit NVMIF                @ ((unsigned)&IFS0)*8+12;
static volatile bit SI2CIF               @ ((unsigned)&IFS0)*8+13;
static volatile bit MI2CIF               @ ((unsigned)&IFS0)*8+14;
static volatile bit CNIF                 @ ((unsigned)&IFS0)*8+15;

