Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: IFS1
static volatile unsigned int            IFS1                @ 0x086;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned IC6IF               : 1;
        volatile unsigned IC5IF               : 1;
        volatile unsigned IC4IF               : 1;
        volatile unsigned IC3IF               : 1;
        volatile unsigned C1IF                : 1;
        volatile unsigned SPI2IF              : 1;
        volatile unsigned U2TXIF              : 1;
        volatile unsigned U2RXIF              : 1;
        volatile unsigned INT2IF              : 1;
        volatile unsigned T5IF                : 1;
        volatile unsigned T4IF                : 1;
        volatile unsigned OC4IF               : 1;
        volatile unsigned OC3IF               : 1;
        volatile unsigned IC8IF               : 1;
        volatile unsigned IC7IF               : 1;
        volatile unsigned INT1IF              : 1;
    };
} IFS1bits @ 0x086;
// bit variable definitions
static volatile bit INT1IF               @ ((unsigned)&IFS1)*8+0;
static volatile bit IC7IF                @ ((unsigned)&IFS1)*8+1;
static volatile bit IC8IF                @ ((unsigned)&IFS1)*8+2;
static volatile bit OC3IF                @ ((unsigned)&IFS1)*8+3;
static volatile bit OC4IF                @ ((unsigned)&IFS1)*8+4;
static volatile bit T4IF                 @ ((unsigned)&IFS1)*8+5;
static volatile bit T5IF                 @ ((unsigned)&IFS1)*8+6;
static volatile bit INT2IF               @ ((unsigned)&IFS1)*8+7;
static volatile bit U2RXIF               @ ((unsigned)&IFS1)*8+8;
static volatile bit U2TXIF               @ ((unsigned)&IFS1)*8+9;
static volatile bit SPI2IF               @ ((unsigned)&IFS1)*8+10;
static volatile bit C1IF                 @ ((unsigned)&IFS1)*8+11;
static volatile bit IC3IF                @ ((unsigned)&IFS1)*8+12;
static volatile bit IC4IF                @ ((unsigned)&IFS1)*8+13;
static volatile bit IC5IF                @ ((unsigned)&IFS1)*8+14;
static volatile bit IC6IF                @ ((unsigned)&IFS1)*8+15;

// Register: IFS2
static volatile unsigned int            IFS2                @ 0x088;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 3;
        volatile unsigned FLTBIF              : 1;
        volatile unsigned FLTAIF              : 1;
        volatile unsigned                     : 2;
        volatile unsigned QEIIF               : 1;
        volatile unsigned PWMIF               : 1;
        volatile unsigned C2IF                : 1;
        volatile unsigned INT4IF              : 1;
        volatile unsigned INT3IF              : 1;
        volatile unsigned OC8IF               : 1;
        volatile unsigned OC7IF               : 1;
        volatile unsigned OC6IF               : 1;
        volatile unsigned OC5IF               : 1;
    };
} IFS2bits @ 0x088;
// bit variable definitions
static volatile bit OC5IF                @ ((unsigned)&IFS2)*8+0;
static volatile bit OC6IF                @ ((unsigned)&IFS2)*8+1;
static volatile bit OC7IF                @ ((unsigned)&IFS2)*8+2;
static volatile bit OC8IF                @ ((unsigned)&IFS2)*8+3;
static volatile bit INT3IF               @ ((unsigned)&IFS2)*8+4;
static volatile bit INT4IF               @ ((unsigned)&IFS2)*8+5;
static volatile bit C2IF                 @ ((unsigned)&IFS2)*8+6;
static volatile bit PWMIF                @ ((unsigned)&IFS2)*8+7;
static volatile bit QEIIF                @ ((unsigned)&IFS2)*8+8;
static volatile bit FLTAIF               @ ((unsigned)&IFS2)*8+11;
static volatile bit FLTBIF               @ ((unsigned)&IFS2)*8+12;

// Register: IEC0
static volatile unsigned int            IEC0                @ 0x08C;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned CNIE                : 1;
        volatile unsigned MI2CIE              : 1;
        volatile unsigned SI2CIE              : 1;
        volatile unsigned NVMIE               : 1;
        volatile unsigned ADIE                : 1;
        volatile unsigned U1TXIE              : 1;
        volatile unsigned U1RXIE              : 1;
        volatile unsigned SPI1IE              : 1;
        volatile unsigned T3IE                : 1;
        volatile unsigned T2IE                : 1;
        volatile unsigned OC2IE               : 1;
        volatile unsigned IC2IE               : 1;
        volatile unsigned T1IE                : 1;
        volatile unsigned OC1IE               : 1;
        volatile unsigned IC1IE               : 1;
        volatile unsigned INT0IE              : 1;
    };
} IEC0bits @ 0x08C;
// bit variable definitions
static volatile bit INT0IE               @ ((unsigned)&IEC0)*8+0;
static volatile bit IC1IE                @ ((unsigned)&IEC0)*8+1;
static volatile bit OC1IE                @ ((unsigned)&IEC0)*8+2;
static volatile bit T1IE                 @ ((unsigned)&IEC0)*8+3;
static volatile bit IC2IE                @ ((unsigned)&IEC0)*8+4;
static volatile bit OC2IE                @ ((unsigned)&IEC0)*8+5;
static volatile bit T2IE                 @ ((unsigned)&IEC0)*8+6;
static volatile bit T3IE                 @ ((unsigned)&IEC0)*8+7;
static volatile bit SPI1IE               @ ((unsigned)&IEC0)*8+8;
static volatile bit U1RXIE               @ ((unsigned)&IEC0)*8+9;
static volatile bit U1TXIE               @ ((unsigned)&IEC0)*8+10;
static volatile bit ADIE                 @ ((unsigned)&IEC0)*8+11;
static volatile bit NVMIE                @ ((unsigned)&IEC0)*8+12;
static volatile bit SI2CIE               @ ((unsigned)&IEC0)*8+13;
static volatile bit MI2CIE               @ ((unsigned)&IEC0)*8+14;
static volatile bit CNIE                 @ ((unsigned)&IEC0)*8+15;

// Register: IEC1
static volatile unsigned int            IEC1                @ 0x08E;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned IC6IE               : 1;
        volatile unsigned IC5IE               : 1;
        volatile unsigned IC4IE               : 1;
        volatile unsigned IC3IE               : 1;
        volatile unsigned C1IE                : 1;
        volatile unsigned SPI2IE              : 1;
        volatile unsigned U2TXIE              : 1;
        volatile unsigned U2RXIE              : 1;
        volatile unsigned INT2IE              : 1;
        volatile unsigned T5IE                : 1;
        volatile unsigned T4IE                : 1;
        volatile unsigned OC4IE               : 1;
        volatile unsigned OC3IE               : 1;
        volatile unsigned IC8IE               : 1;
        volatile unsigned IC7IE               : 1;
        volatile unsigned INT1IE              : 1;
    };
} IEC1bits @ 0x08E;
// bit variable definitions
static volatile bit INT1IE               @ ((unsigned)&IEC1)*8+0;
static volatile bit IC7IE                @ ((unsigned)&IEC1)*8+1;
static volatile bit IC8IE                @ ((unsigned)&IEC1)*8+2;
static volatile bit OC3IE                @ ((unsigned)&IEC1)*8+3;
static volatile bit OC4IE                @ ((unsigned)&IEC1)*8+4;
static volatile bit T4IE                 @ ((unsigned)&IEC1)*8+5;
static volatile bit T5IE                 @ ((unsigned)&IEC1)*8+6;
static volatile bit INT2IE               @ ((unsigned)&IEC1)*8+7;
static volatile bit U2RXIE               @ ((unsigned)&IEC1)*8+8;
static volatile bit U2TXIE               @ ((unsigned)&IEC1)*8+9;
static volatile bit SPI2IE               @ ((unsigned)&IEC1)*8+10;
static volatile bit C1IE                 @ ((unsigned)&IEC1)*8+11;
static volatile bit IC3IE                @ ((unsigned)&IEC1)*8+12;
static volatile bit IC4IE                @ ((unsigned)&IEC1)*8+13;
static volatile bit IC5IE                @ ((unsigned)&IEC1)*8+14;
static volatile bit IC6IE                @ ((unsigned)&IEC1)*8+15;

// Register: IEC2
static volatile unsigned int            IEC2                @ 0x090;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 3;
        volatile unsigned FLTBIE              : 1;
        volatile unsigned FLTAIE              : 1;
        volatile unsigned                     : 2;
        volatile unsigned QEIIE               : 1;
        volatile unsigned PWMIE               : 1;
        volatile unsigned C2IE                : 1;
        volatile unsigned INT4IE              : 1;
        volatile unsigned INT3IE              : 1;
        volatile unsigned OC8IE               : 1;
        volatile unsigned OC7IE               : 1;
        volatile unsigned OC6IE               : 1;
        volatile unsigned OC5IE               : 1;
    };
} IEC2bits @ 0x090;
// bit variable definitions
static volatile bit OC5IE                @ ((unsigned)&IEC2)*8+0;
static volatile bit OC6IE                @ ((unsigned)&IEC2)*8+1;
static volatile bit OC7IE                @ ((unsigned)&IEC2)*8+2;
static volatile bit OC8IE                @ ((unsigned)&IEC2)*8+3;
static volatile bit INT3IE               @ ((unsigned)&IEC2)*8+4;
static volatile bit INT4IE               @ ((unsigned)&IEC2)*8+5;
static volatile bit C2IE                 @ ((unsigned)&IEC2)*8+6;
static volatile bit PWMIE                @ ((unsigned)&IEC2)*8+7;
static volatile bit QEIIE                @ ((unsigned)&IEC2)*8+8;
static volatile bit FLTAIE               @ ((unsigned)&IEC2)*8+11;
static volatile bit FLTBIE               @ ((unsigned)&IEC2)*8+12;

// Register: IPC0
static volatile unsigned int            IPC0                @ 0x094;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 1;
        volatile unsigned T1IP                : 3;
        volatile unsigned                     : 1;
        volatile unsigned OC1IP               : 3;
        volatile unsigned                     : 1;
        volatile unsigned IC1IP               : 3;
        volatile unsigned                     : 1;
        volatile unsigned INT0IP              : 3;
    };
    struct {
        volatile unsigned                     : 1;
        volatile unsigned T1IP2               : 1;
        volatile unsigned T1IP1               : 1;
        volatile unsigned T1IP0               : 1;
        volatile unsigned                     : 1;
        volatile unsigned OC1IP2              : 1;
        volatile unsigned OC1IP1              : 1;
        volatile unsigned OC1IP0              : 1;
        volatile unsigned                     : 1;
        volatile unsigned IC1IP2              : 1;
        volatile unsigned IC1IP1              : 1;
        volatile unsigned IC1IP0              : 1;
        volatile unsigned                     : 1;
        volatile unsigned INT0IP2             : 1;
        volatile unsigned INT0IP1             : 1;
        volatile unsigned INT0IP0             : 1;
    };
} IPC0bits @ 0x094;
// bit variable definitions
static volatile bit INT0IP0              @ ((unsigned)&IPC0)*8+0;
static volatile bit INT0IP1              @ ((unsigned)&IPC0)*8+1;
static volatile bit INT0IP2              @ ((unsigned)&IPC0)*8+2;
static volatile bit IC1IP0               @ ((unsigned)&IPC0)*8+4;
static volatile bit IC1IP1               @ ((unsigned)&IPC0)*8+5;
static volatile bit IC1IP2               @ ((unsigned)&IPC0)*8+6;
static volatile bit OC1IP0               @ ((unsigned)&IPC0)*8+8;
static volatile bit OC1IP1               @ ((unsigned)&IPC0)*8+9;
static volatile bit OC1IP2               @ ((unsigned)&IPC0)*8+10;
static volatile bit T1IP0                @ ((unsigned)&IPC0)*8+12;
static volatile bit T1IP1                @ ((unsigned)&IPC0)*8+13;
static volatile bit T1IP2                @ ((unsigned)&IPC0)*8+14;

// Register: IPC1
static volatile unsigned int            IPC1                @ 0x096;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 1;
        volatile unsigned T3IP                : 3;
        volatile unsigned                     : 1;
        volatile unsigned T2IP                : 3;
        volatile unsigned                     : 1;
        volatile unsigned OC2IP               : 3;
        volatile unsigned                     : 1;
        volatile unsigned IC2IP               : 3;
    };
    struct {
        volatile unsigned                     : 1;
        volatile unsigned T3IP2               : 1;
        volatile unsigned T3IP1               : 1;
        volatile unsigned T3IP0               : 1;
        volatile unsigned                     : 1;
        volatile unsigned T2IP2               : 1;
        volatile unsigned T2IP1               : 1;
        volatile unsigned T2IP0               : 1;
        volatile unsigned                     : 1;
        volatile unsigned OC2IP2              : 1;
        volatile unsigned OC2IP1              : 1;
        volatile unsigned OC2IP0              : 1;
        volatile unsigned                     : 1;
        volatile unsigned IC2IP2              : 1;
        volatile unsigned IC2IP1              : 1;
        volatile unsigned IC2IP0              : 1;
    };
} IPC1bits @ 0x096;
// bit variable definitions
static volatile bit IC2IP0               @ ((unsigned)&IPC1)*8+0;
static volatile bit IC2IP1               @ ((unsigned)&IPC1)*8+1;
static volatile bit IC2IP2               @ ((unsigned)&IPC1)*8+2;
static volatile bit OC2IP0               @ ((unsigned)&IPC1)*8+4;
static volatile bit OC2IP1               @ ((unsigned)&IPC1)*8+5;
static volatile bit OC2IP2               @ ((unsigned)&IPC1)*8+6;
static volatile bit T2IP0                @ ((unsigned)&IPC1)*8+8;
static volatile bit T2IP1                @ ((unsigned)&IPC1)*8+9;
static volatile bit T2IP2                @ ((unsigned)&IPC1)*8+10;
static volatile bit T3IP0                @ ((unsigned)&IPC1)*8+12;
static volatile bit T3IP1                @ ((unsigned)&IPC1)*8+13;
static volatile bit T3IP2                @ ((unsigned)&IPC1)*8+14;

// Register: IPC2
static volatile unsigned int            IPC2                @ 0x098;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 1;
        volatile unsigned ADIP                : 3;
        volatile unsigned                     : 1;
        volatile unsigned U1TXIP              : 3;
        volatile unsigned                     : 1;
        volatile unsigned U1RXIP              : 3;
        volatile unsigned                     : 1;
        volatile unsigned SPI1IP              : 3;
    };
    struct {
        volatile unsigned                     : 1;
        volatile unsigned ADIP2               : 1;
        volatile unsigned ADIP1               : 1;
        volatile unsigned ADIP0               : 1;
        volatile unsigned                     : 1;
        volatile unsigned U1TXIP2             : 1;
        volatile unsigned U1TXIP1             : 1;
        volatile unsigned U1TXIP0             : 1;
        volatile unsigned                     : 1;
        volatile unsigned U1RXIP2             : 1;
        volatile unsigned U1RXIP1             : 1;
        volatile unsigned U1RXIP0             : 1;
        volatile unsigned                     : 1;
        volatile unsigned SPI1IP2             : 1;
        volatile unsigned SPI1IP1             : 1;
        volatile unsigned SPI1IP0             : 1;
    };
} IPC2bits @ 0x098;
// bit variable definitions
static volatile bit SPI1IP0              @ ((unsigned)&IPC2)*8+0;
static volatile bit SPI1IP1              @ ((unsigned)&IPC2)*8+1;
static volatile bit SPI1IP2              @ ((unsigned)&IPC2)*8+2;
static volatile bit U1RXIP0              @ ((unsigned)&IPC2)*8+4;
static volatile bit U1RXIP1              @ ((unsigned)&IPC2)*8+5;
static volatile bit U1RXIP2              @ ((unsigned)&IPC2)*8+6;
static volatile bit U1TXIP0              @ ((unsigned)&IPC2)*8+8;
static volatile bit U1TXIP1              @ ((unsigned)&IPC2)*8+9;
static volatile bit U1TXIP2              @ ((unsigned)&IPC2)*8+10;
static volatile bit ADIP0                @ ((unsigned)&IPC2)*8+12;
static volatile bit ADIP1                @ ((unsigned)&IPC2)*8+13;
static volatile bit ADIP2                @ ((unsigned)&IPC2)*8+14;

// Register: IPC3
static volatile unsigned int            IPC3                @ 0x09A;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 1;
        volatile unsigned CNIP                : 3;
        volatile unsigned                     : 1;
        volatile unsigned MI2CIP              : 3;
        volatile unsigned                     : 1;
        volatile unsigned SI2CIP              : 3;
        volatile unsigned                     : 1;
        volatile unsigned NVMIP               : 3;
    };
    struct {
        volatile unsigned                     : 1;
        volatile unsigned CNIP2               : 1;
        volatile unsigned CNIP1               : 1;
        volatile unsigned CNIP0               : 1;
        volatile unsigned                     : 1;
        volatile unsigned MI2CIP2             : 1;
        volatile unsigned MI2CIP1             : 1;
        volatile unsigned MI2CIP0             : 1;
        volatile unsigned                     : 1;
        volatile unsigned SI2CIP2             : 1;
        volatile unsigned SI2CIP1             : 1;
        volatile unsigned SI2CIP0             : 1;
        volatile unsigned                     : 1;
        volatile unsigned NVMIP2              : 1;
        volatile unsigned NVMIP1              : 1;
        volatile unsigned NVMIP0              : 1;
    };
} IPC3bits @ 0x09A;
// bit variable definitions
static volatile bit NVMIP0               @ ((unsigned)&IPC3)*8+0;
static volatile bit NVMIP1               @ ((unsigned)&IPC3)*8+1;
static volatile bit NVMIP2               @ ((unsigned)&IPC3)*8+2;
static volatile bit SI2CIP0              @ ((unsigned)&IPC3)*8+4;
static volatile bit SI2CIP1              @ ((unsigned)&IPC3)*8+5;
static volatile bit SI2CIP2              @ ((unsigned)&IPC3)*8+6;
static volatile bit MI2CIP0              @ ((unsigned)&IPC3)*8+8;
static volatile bit MI2CIP1              @ ((unsigned)&IPC3)*8+9;
static volatile bit MI2CIP2              @ ((unsigned)&IPC3)*8+10;
static volatile bit CNIP0                @ ((unsigned)&IPC3)*8+12;
static volatile bit CNIP1                @ ((unsigned)&IPC3)*8+13;
static volatile bit CNIP2                @ ((unsigned)&IPC3)*8+14;

