Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: IPC4
static volatile unsigned int            IPC4                @ 0x09C;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 1;
        volatile unsigned OC3IP               : 3;
        volatile unsigned                     : 1;
        volatile unsigned IC8IP               : 3;
        volatile unsigned                     : 1;
        volatile unsigned IC7IP               : 3;
        volatile unsigned                     : 1;
        volatile unsigned INT1IP              : 3;
    };
    struct {
        volatile unsigned                     : 1;
        volatile unsigned OC3IP2              : 1;
        volatile unsigned OC3IP1              : 1;
        volatile unsigned OC3IP0              : 1;
        volatile unsigned                     : 1;
        volatile unsigned IC8IP2              : 1;
        volatile unsigned IC8IP1              : 1;
        volatile unsigned IC8IP0              : 1;
        volatile unsigned                     : 1;
        volatile unsigned IC7IP2              : 1;
        volatile unsigned IC7IP1              : 1;
        volatile unsigned IC7IP0              : 1;
        volatile unsigned                     : 1;
        volatile unsigned INT1IP2             : 1;
        volatile unsigned INT1IP1             : 1;
        volatile unsigned INT1IP0             : 1;
    };
} IPC4bits @ 0x09C;
// bit variable definitions
static volatile bit INT1IP0              @ ((unsigned)&IPC4)*8+0;
static volatile bit INT1IP1              @ ((unsigned)&IPC4)*8+1;
static volatile bit INT1IP2              @ ((unsigned)&IPC4)*8+2;
static volatile bit IC7IP0               @ ((unsigned)&IPC4)*8+4;
static volatile bit IC7IP1               @ ((unsigned)&IPC4)*8+5;
static volatile bit IC7IP2               @ ((unsigned)&IPC4)*8+6;
static volatile bit IC8IP0               @ ((unsigned)&IPC4)*8+8;
static volatile bit IC8IP1               @ ((unsigned)&IPC4)*8+9;
static volatile bit IC8IP2               @ ((unsigned)&IPC4)*8+10;
static volatile bit OC3IP0               @ ((unsigned)&IPC4)*8+12;
static volatile bit OC3IP1               @ ((unsigned)&IPC4)*8+13;
static volatile bit OC3IP2               @ ((unsigned)&IPC4)*8+14;

// Register: IPC5
static volatile unsigned int            IPC5                @ 0x09E;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 1;
        volatile unsigned INT2IP              : 3;
        volatile unsigned                     : 1;
        volatile unsigned T5IP                : 3;
        volatile unsigned                     : 1;
        volatile unsigned T4IP                : 3;
        volatile unsigned                     : 1;
        volatile unsigned OC4IP               : 3;
    };
    struct {
        volatile unsigned                     : 1;
        volatile unsigned INT2IP2             : 1;
        volatile unsigned INT2IP1             : 1;
        volatile unsigned INT2IP0             : 1;
        volatile unsigned                     : 1;
        volatile unsigned T5IP2               : 1;
        volatile unsigned T5IP1               : 1;
        volatile unsigned T5IP0               : 1;
        volatile unsigned                     : 1;
        volatile unsigned T4IP2               : 1;
        volatile unsigned T4IP1               : 1;
        volatile unsigned T4IP0               : 1;
        volatile unsigned                     : 1;
        volatile unsigned OC4IP2              : 1;
        volatile unsigned OC4IP1              : 1;
        volatile unsigned OC4IP0              : 1;
    };
} IPC5bits @ 0x09E;
// bit variable definitions
static volatile bit OC4IP0               @ ((unsigned)&IPC5)*8+0;
static volatile bit OC4IP1               @ ((unsigned)&IPC5)*8+1;
static volatile bit OC4IP2               @ ((unsigned)&IPC5)*8+2;
static volatile bit T4IP0                @ ((unsigned)&IPC5)*8+4;
static volatile bit T4IP1                @ ((unsigned)&IPC5)*8+5;
static volatile bit T4IP2                @ ((unsigned)&IPC5)*8+6;
static volatile bit T5IP0                @ ((unsigned)&IPC5)*8+8;
static volatile bit T5IP1                @ ((unsigned)&IPC5)*8+9;
static volatile bit T5IP2                @ ((unsigned)&IPC5)*8+10;
static volatile bit INT2IP0              @ ((unsigned)&IPC5)*8+12;
static volatile bit INT2IP1              @ ((unsigned)&IPC5)*8+13;
static volatile bit INT2IP2              @ ((unsigned)&IPC5)*8+14;

// Register: IPC6
static volatile unsigned int            IPC6                @ 0x0A0;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 1;
        volatile unsigned C1IP                : 3;
        volatile unsigned                     : 1;
        volatile unsigned SPI2IP              : 3;
        volatile unsigned                     : 1;
        volatile unsigned U2TXIP              : 3;
        volatile unsigned                     : 1;
        volatile unsigned U2RXIP              : 3;
    };
    struct {
        volatile unsigned                     : 1;
        volatile unsigned C1IP2               : 1;
        volatile unsigned C1IP1               : 1;
        volatile unsigned C1IP0               : 1;
        volatile unsigned                     : 1;
        volatile unsigned SPI2IP2             : 1;
        volatile unsigned SPI2IP1             : 1;
        volatile unsigned SPI2IP0             : 1;
        volatile unsigned                     : 1;
        volatile unsigned U2TXIP2             : 1;
        volatile unsigned U2TXIP1             : 1;
        volatile unsigned U2TXIP0             : 1;
        volatile unsigned                     : 1;
        volatile unsigned U2RXIP2             : 1;
        volatile unsigned U2RXIP1             : 1;
        volatile unsigned U2RXIP0             : 1;
    };
} IPC6bits @ 0x0A0;
// bit variable definitions
static volatile bit U2RXIP0              @ ((unsigned)&IPC6)*8+0;
static volatile bit U2RXIP1              @ ((unsigned)&IPC6)*8+1;
static volatile bit U2RXIP2              @ ((unsigned)&IPC6)*8+2;
static volatile bit U2TXIP0              @ ((unsigned)&IPC6)*8+4;
static volatile bit U2TXIP1              @ ((unsigned)&IPC6)*8+5;
static volatile bit U2TXIP2              @ ((unsigned)&IPC6)*8+6;
static volatile bit SPI2IP0              @ ((unsigned)&IPC6)*8+8;
static volatile bit SPI2IP1              @ ((unsigned)&IPC6)*8+9;
static volatile bit SPI2IP2              @ ((unsigned)&IPC6)*8+10;
static volatile bit C1IP0                @ ((unsigned)&IPC6)*8+12;
static volatile bit C1IP1                @ ((unsigned)&IPC6)*8+13;
static volatile bit C1IP2                @ ((unsigned)&IPC6)*8+14;

// Register: IPC7
static volatile unsigned int            IPC7                @ 0x0A2;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 1;
        volatile unsigned IC6IP               : 3;
        volatile unsigned                     : 1;
        volatile unsigned IC5IP               : 3;
        volatile unsigned                     : 1;
        volatile unsigned IC4IP               : 3;
        volatile unsigned                     : 1;
        volatile unsigned IC3IP               : 3;
    };
    struct {
        volatile unsigned                     : 1;
        volatile unsigned IC6IP2              : 1;
        volatile unsigned IC6IP1              : 1;
        volatile unsigned IC6IP0              : 1;
        volatile unsigned                     : 1;
        volatile unsigned IC5IP2              : 1;
        volatile unsigned IC5IP1              : 1;
        volatile unsigned IC5IP0              : 1;
        volatile unsigned                     : 1;
        volatile unsigned IC4IP2              : 1;
        volatile unsigned IC4IP1              : 1;
        volatile unsigned IC4IP0              : 1;
        volatile unsigned                     : 1;
        volatile unsigned IC3IP2              : 1;
        volatile unsigned IC3IP1              : 1;
        volatile unsigned IC3IP0              : 1;
    };
} IPC7bits @ 0x0A2;
// bit variable definitions
static volatile bit IC3IP0               @ ((unsigned)&IPC7)*8+0;
static volatile bit IC3IP1               @ ((unsigned)&IPC7)*8+1;
static volatile bit IC3IP2               @ ((unsigned)&IPC7)*8+2;
static volatile bit IC4IP0               @ ((unsigned)&IPC7)*8+4;
static volatile bit IC4IP1               @ ((unsigned)&IPC7)*8+5;
static volatile bit IC4IP2               @ ((unsigned)&IPC7)*8+6;
static volatile bit IC5IP0               @ ((unsigned)&IPC7)*8+8;
static volatile bit IC5IP1               @ ((unsigned)&IPC7)*8+9;
static volatile bit IC5IP2               @ ((unsigned)&IPC7)*8+10;
static volatile bit IC6IP0               @ ((unsigned)&IPC7)*8+12;
static volatile bit IC6IP1               @ ((unsigned)&IPC7)*8+13;
static volatile bit IC6IP2               @ ((unsigned)&IPC7)*8+14;

// Register: IPC8
static volatile unsigned int            IPC8                @ 0x0A4;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 1;
        volatile unsigned OC8IP               : 3;
        volatile unsigned                     : 1;
        volatile unsigned OC7IP               : 3;
        volatile unsigned                     : 1;
        volatile unsigned OC6IP               : 3;
        volatile unsigned                     : 1;
        volatile unsigned OC5IP               : 3;
    };
    struct {
        volatile unsigned                     : 1;
        volatile unsigned OC8IP2              : 1;
        volatile unsigned OC8IP1              : 1;
        volatile unsigned OC8IP0              : 1;
        volatile unsigned                     : 1;
        volatile unsigned OC7IP2              : 1;
        volatile unsigned OC7IP1              : 1;
        volatile unsigned OC7IP0              : 1;
        volatile unsigned                     : 1;
        volatile unsigned OC6IP2              : 1;
        volatile unsigned OC6IP1              : 1;
        volatile unsigned OC6IP0              : 1;
        volatile unsigned                     : 1;
        volatile unsigned OC5IP2              : 1;
        volatile unsigned OC5IP1              : 1;
        volatile unsigned OC5IP0              : 1;
    };
} IPC8bits @ 0x0A4;
// bit variable definitions
static volatile bit OC5IP0               @ ((unsigned)&IPC8)*8+0;
static volatile bit OC5IP1               @ ((unsigned)&IPC8)*8+1;
static volatile bit OC5IP2               @ ((unsigned)&IPC8)*8+2;
static volatile bit OC6IP0               @ ((unsigned)&IPC8)*8+4;
static volatile bit OC6IP1               @ ((unsigned)&IPC8)*8+5;
static volatile bit OC6IP2               @ ((unsigned)&IPC8)*8+6;
static volatile bit OC7IP0               @ ((unsigned)&IPC8)*8+8;
static volatile bit OC7IP1               @ ((unsigned)&IPC8)*8+9;
static volatile bit OC7IP2               @ ((unsigned)&IPC8)*8+10;
static volatile bit OC8IP0               @ ((unsigned)&IPC8)*8+12;
static volatile bit OC8IP1               @ ((unsigned)&IPC8)*8+13;
static volatile bit OC8IP2               @ ((unsigned)&IPC8)*8+14;

// Register: IPC9
static volatile unsigned int            IPC9                @ 0x0A6;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 1;
        volatile unsigned PWMIP               : 3;
        volatile unsigned                     : 1;
        volatile unsigned C2IP                : 3;
        volatile unsigned                     : 1;
        volatile unsigned INT4IP              : 3;
        volatile unsigned                     : 1;
        volatile unsigned INT3IP              : 3;
    };
    struct {
        volatile unsigned                     : 1;
        volatile unsigned PWMIP2              : 1;
        volatile unsigned PWMIP1              : 1;
        volatile unsigned PWMIP0              : 1;
        volatile unsigned                     : 1;
        volatile unsigned C2IP2               : 1;
        volatile unsigned C2IP1               : 1;
        volatile unsigned C2IP0               : 1;
        volatile unsigned                     : 1;
        volatile unsigned INT4IP2             : 1;
        volatile unsigned INT4IP1             : 1;
        volatile unsigned INT4IP0             : 1;
        volatile unsigned                     : 1;
        volatile unsigned INT3IP2             : 1;
        volatile unsigned INT3IP1             : 1;
        volatile unsigned INT3IP0             : 1;
    };
} IPC9bits @ 0x0A6;
// bit variable definitions
static volatile bit INT3IP0              @ ((unsigned)&IPC9)*8+0;
static volatile bit INT3IP1              @ ((unsigned)&IPC9)*8+1;
static volatile bit INT3IP2              @ ((unsigned)&IPC9)*8+2;
static volatile bit INT4IP0              @ ((unsigned)&IPC9)*8+4;
static volatile bit INT4IP1              @ ((unsigned)&IPC9)*8+5;
static volatile bit INT4IP2              @ ((unsigned)&IPC9)*8+6;
static volatile bit C2IP0                @ ((unsigned)&IPC9)*8+8;
static volatile bit C2IP1                @ ((unsigned)&IPC9)*8+9;
static volatile bit C2IP2                @ ((unsigned)&IPC9)*8+10;
static volatile bit PWMIP0               @ ((unsigned)&IPC9)*8+12;
static volatile bit PWMIP1               @ ((unsigned)&IPC9)*8+13;
static volatile bit PWMIP2               @ ((unsigned)&IPC9)*8+14;

// Register: IPC10
static volatile unsigned int            IPC10               @ 0x0A8;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 1;
        volatile unsigned FLTAIP              : 3;
        volatile unsigned                     : 9;
        volatile unsigned QEIIP               : 3;
    };
    struct {
        volatile unsigned                     : 1;
        volatile unsigned FLTAIP2             : 1;
        volatile unsigned FLTAIP1             : 1;
        volatile unsigned FLTAIP0             : 1;
        volatile unsigned                     : 9;
        volatile unsigned QEIIP2              : 1;
        volatile unsigned QEIIP1              : 1;
        volatile unsigned QEIIP0              : 1;
    };
} IPC10bits @ 0x0A8;
// bit variable definitions
static volatile bit QEIIP0               @ ((unsigned)&IPC10)*8+0;
static volatile bit QEIIP1               @ ((unsigned)&IPC10)*8+1;
static volatile bit QEIIP2               @ ((unsigned)&IPC10)*8+2;
static volatile bit FLTAIP0              @ ((unsigned)&IPC10)*8+12;
static volatile bit FLTAIP1              @ ((unsigned)&IPC10)*8+13;
static volatile bit FLTAIP2              @ ((unsigned)&IPC10)*8+14;

