Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: IPC11
static volatile unsigned int            IPC11               @ 0x0AA;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 13;
        volatile unsigned FLTBIP              : 3;
    };
    struct {
        volatile unsigned                     : 13;
        volatile unsigned FLTBIP2             : 1;
        volatile unsigned FLTBIP1             : 1;
        volatile unsigned FLTBIP0             : 1;
    };
} IPC11bits @ 0x0AA;
// bit variable definitions
static volatile bit FLTBIP0              @ ((unsigned)&IPC11)*8+0;
static volatile bit FLTBIP1              @ ((unsigned)&IPC11)*8+1;
static volatile bit FLTBIP2              @ ((unsigned)&IPC11)*8+2;

// Register: INTTREG
static volatile unsigned int            INTTREG             @ 0x0B0;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned IRQtoCPU            : 1;
        volatile unsigned TMODE               : 1;
        volatile unsigned VHOLD               : 1;
        volatile unsigned                     : 1;
        volatile unsigned ILR                 : 4;
        volatile unsigned                     : 2;
        volatile unsigned VECNUM              : 6;
    };
    struct {
        volatile unsigned                     : 4;
        volatile unsigned ILR3                : 1;
        volatile unsigned ILR2                : 1;
        volatile unsigned ILR1                : 1;
        volatile unsigned ILR0                : 1;
        volatile unsigned                     : 2;
        volatile unsigned VECNUM5             : 1;
        volatile unsigned VECNUM4             : 1;
        volatile unsigned VECNUM3             : 1;
        volatile unsigned VECNUM2             : 1;
        volatile unsigned VECNUM1             : 1;
        volatile unsigned VECNUM0             : 1;
    };
} INTTREGbits @ 0x0B0;
// bit variable definitions
static volatile bit VHOLD                @ ((unsigned)&INTTREG)*8+13;
static volatile bit TMODE                @ ((unsigned)&INTTREG)*8+14;
static volatile bit IRQtoCPU             @ ((unsigned)&INTTREG)*8+15;
static volatile bit VECNUM0              @ ((unsigned)&INTTREG)*8+0;
static volatile bit VECNUM1              @ ((unsigned)&INTTREG)*8+1;
static volatile bit VECNUM2              @ ((unsigned)&INTTREG)*8+2;
static volatile bit VECNUM3              @ ((unsigned)&INTTREG)*8+3;
static volatile bit VECNUM4              @ ((unsigned)&INTTREG)*8+4;
static volatile bit VECNUM5              @ ((unsigned)&INTTREG)*8+5;
static volatile bit ILR0                 @ ((unsigned)&INTTREG)*8+8;
static volatile bit ILR1                 @ ((unsigned)&INTTREG)*8+9;
static volatile bit ILR2                 @ ((unsigned)&INTTREG)*8+10;
static volatile bit ILR3                 @ ((unsigned)&INTTREG)*8+11;

// Register: CNEN1
static volatile unsigned int            CNEN1               @ 0x0C0;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned CN15IE              : 1;
        volatile unsigned CN14IE              : 1;
        volatile unsigned CN13IE              : 1;
        volatile unsigned CN12IE              : 1;
        volatile unsigned CN11IE              : 1;
        volatile unsigned CN10IE              : 1;
        volatile unsigned CN9IE               : 1;
        volatile unsigned CN8IE               : 1;
        volatile unsigned CN7IE               : 1;
        volatile unsigned CN6IE               : 1;
        volatile unsigned CN5IE               : 1;
        volatile unsigned CN4IE               : 1;
        volatile unsigned CN3IE               : 1;
        volatile unsigned CN2IE               : 1;
        volatile unsigned CN1IE               : 1;
        volatile unsigned CN0IE               : 1;
    };
} CNEN1bits @ 0x0C0;
// bit variable definitions
static volatile bit CN0IE                @ ((unsigned)&CNEN1)*8+0;
static volatile bit CN1IE                @ ((unsigned)&CNEN1)*8+1;
static volatile bit CN2IE                @ ((unsigned)&CNEN1)*8+2;
static volatile bit CN3IE                @ ((unsigned)&CNEN1)*8+3;
static volatile bit CN4IE                @ ((unsigned)&CNEN1)*8+4;
static volatile bit CN5IE                @ ((unsigned)&CNEN1)*8+5;
static volatile bit CN6IE                @ ((unsigned)&CNEN1)*8+6;
static volatile bit CN7IE                @ ((unsigned)&CNEN1)*8+7;
static volatile bit CN8IE                @ ((unsigned)&CNEN1)*8+8;
static volatile bit CN9IE                @ ((unsigned)&CNEN1)*8+9;
static volatile bit CN10IE               @ ((unsigned)&CNEN1)*8+10;
static volatile bit CN11IE               @ ((unsigned)&CNEN1)*8+11;
static volatile bit CN12IE               @ ((unsigned)&CNEN1)*8+12;
static volatile bit CN13IE               @ ((unsigned)&CNEN1)*8+13;
static volatile bit CN14IE               @ ((unsigned)&CNEN1)*8+14;
static volatile bit CN15IE               @ ((unsigned)&CNEN1)*8+15;

// Register: CNEN2
static volatile unsigned int            CNEN2               @ 0x0C2;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 10;
        volatile unsigned CN21IE              : 1;
        volatile unsigned CN20IE              : 1;
        volatile unsigned CN19IE              : 1;
        volatile unsigned CN18IE              : 1;
        volatile unsigned CN17IE              : 1;
        volatile unsigned CN16IE              : 1;
    };
} CNEN2bits @ 0x0C2;
// bit variable definitions
static volatile bit CN16IE               @ ((unsigned)&CNEN2)*8+0;
static volatile bit CN17IE               @ ((unsigned)&CNEN2)*8+1;
static volatile bit CN18IE               @ ((unsigned)&CNEN2)*8+2;
static volatile bit CN19IE               @ ((unsigned)&CNEN2)*8+3;
static volatile bit CN20IE               @ ((unsigned)&CNEN2)*8+4;
static volatile bit CN21IE               @ ((unsigned)&CNEN2)*8+5;

// Register: CNPU1
static volatile unsigned int            CNPU1               @ 0x0C4;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned CN15PUE             : 1;
        volatile unsigned CN14PUE             : 1;
        volatile unsigned CN13PUE             : 1;
        volatile unsigned CN12PUE             : 1;
        volatile unsigned CN11PUE             : 1;
        volatile unsigned CN10PUE             : 1;
        volatile unsigned CN9PUE              : 1;
        volatile unsigned CN8PUE              : 1;
        volatile unsigned CN7PUE              : 1;
        volatile unsigned CN6PUE              : 1;
        volatile unsigned CN5PUE              : 1;
        volatile unsigned CN4PUE              : 1;
        volatile unsigned CN3PUE              : 1;
        volatile unsigned CN2PUE              : 1;
        volatile unsigned CN1PUE              : 1;
        volatile unsigned CN0PUE              : 1;
    };
} CNPU1bits @ 0x0C4;
// bit variable definitions
static volatile bit CN0PUE               @ ((unsigned)&CNPU1)*8+0;
static volatile bit CN1PUE               @ ((unsigned)&CNPU1)*8+1;
static volatile bit CN2PUE               @ ((unsigned)&CNPU1)*8+2;
static volatile bit CN3PUE               @ ((unsigned)&CNPU1)*8+3;
static volatile bit CN4PUE               @ ((unsigned)&CNPU1)*8+4;
static volatile bit CN5PUE               @ ((unsigned)&CNPU1)*8+5;
static volatile bit CN6PUE               @ ((unsigned)&CNPU1)*8+6;
static volatile bit CN7PUE               @ ((unsigned)&CNPU1)*8+7;
static volatile bit CN8PUE               @ ((unsigned)&CNPU1)*8+8;
static volatile bit CN9PUE               @ ((unsigned)&CNPU1)*8+9;
static volatile bit CN10PUE              @ ((unsigned)&CNPU1)*8+10;
static volatile bit CN11PUE              @ ((unsigned)&CNPU1)*8+11;
static volatile bit CN12PUE              @ ((unsigned)&CNPU1)*8+12;
static volatile bit CN13PUE              @ ((unsigned)&CNPU1)*8+13;
static volatile bit CN14PUE              @ ((unsigned)&CNPU1)*8+14;
static volatile bit CN15PUE              @ ((unsigned)&CNPU1)*8+15;

// Register: CNPU2
static volatile unsigned int            CNPU2               @ 0x0C6;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 10;
        volatile unsigned CN21PUE             : 1;
        volatile unsigned CN20PUE             : 1;
        volatile unsigned CN19PUE             : 1;
        volatile unsigned CN18PUE             : 1;
        volatile unsigned CN17PUE             : 1;
        volatile unsigned CN16PUE             : 1;
    };
} CNPU2bits @ 0x0C6;
// bit variable definitions
static volatile bit CN16PUE              @ ((unsigned)&CNPU2)*8+0;
static volatile bit CN17PUE              @ ((unsigned)&CNPU2)*8+1;
static volatile bit CN18PUE              @ ((unsigned)&CNPU2)*8+2;
static volatile bit CN19PUE              @ ((unsigned)&CNPU2)*8+3;
static volatile bit CN20PUE              @ ((unsigned)&CNPU2)*8+4;
static volatile bit CN21PUE              @ ((unsigned)&CNPU2)*8+5;

// Register: TMR1
static volatile unsigned int            TMR1                @ 0x100;

// Register: PR1
static volatile unsigned int            PR1                 @ 0x102;

