Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: T1CON
static volatile unsigned int            T1CON               @ 0x104;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TON                 : 1;
        volatile unsigned                     : 1;
        volatile unsigned TSIDL               : 1;
        volatile unsigned                     : 6;
        volatile unsigned TGATE               : 1;
        volatile unsigned TCKPS               : 2;
        volatile unsigned                     : 1;
        volatile unsigned TSYNC               : 1;
        volatile unsigned TCS                 : 1;
        volatile unsigned                     : 1;
    };
    struct {
        volatile unsigned                     : 10;
        volatile unsigned TCKPS1              : 1;
        volatile unsigned TCKPS0              : 1;
        volatile unsigned                     : 4;
    };
} T1CONbits @ 0x104;
// bit variable definitions
static volatile bit TCS                  @ ((unsigned)&T1CON)*8+1;
static volatile bit TSYNC                @ ((unsigned)&T1CON)*8+2;
static volatile bit TGATE                @ ((unsigned)&T1CON)*8+6;
static volatile bit TSIDL                @ ((unsigned)&T1CON)*8+13;
static volatile bit TON                  @ ((unsigned)&T1CON)*8+15;
static volatile bit TCKPS0               @ ((unsigned)&T1CON)*8+4;
static volatile bit TCKPS1               @ ((unsigned)&T1CON)*8+5;

// Register: TMR2
static volatile unsigned int            TMR2                @ 0x106;

// Register: TMR3HLD
static volatile unsigned int            TMR3HLD             @ 0x108;

// Register: TMR3
static volatile unsigned int            TMR3                @ 0x10A;

// Register: PR2
static volatile unsigned int            PR2                 @ 0x10C;

// Register: PR3
static volatile unsigned int            PR3                 @ 0x10E;

// Register: T2CON
static volatile unsigned int            T2CON               @ 0x110;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TON                 : 1;
        volatile unsigned                     : 1;
        volatile unsigned TSIDL               : 1;
        volatile unsigned                     : 6;
        volatile unsigned TGATE               : 1;
        volatile unsigned TCKPS               : 2;
        volatile unsigned T32                 : 1;
        volatile unsigned                     : 1;
        volatile unsigned TCS                 : 1;
        volatile unsigned                     : 1;
    };
    struct {
        volatile unsigned                     : 10;
        volatile unsigned TCKPS1              : 1;
        volatile unsigned TCKPS0              : 1;
        volatile unsigned                     : 4;
    };
} T2CONbits @ 0x110;
// bit variable definitions
// duplicate bit in register T1CON, definition disabled
// static volatile bit TCS                  @ ((unsigned)&T2CON)*8+1;
static volatile bit T32                  @ ((unsigned)&T2CON)*8+3;
// duplicate bit in register T1CON, definition disabled
// static volatile bit TGATE                @ ((unsigned)&T2CON)*8+6;
// duplicate bit in register T1CON, definition disabled
// static volatile bit TSIDL                @ ((unsigned)&T2CON)*8+13;
// duplicate bit in register T1CON, definition disabled
// static volatile bit TON                  @ ((unsigned)&T2CON)*8+15;
// duplicate bit in register T1CON, definition disabled
// static volatile bit TCKPS0               @ ((unsigned)&T2CON)*8+4;
// duplicate bit in register T1CON, definition disabled
// static volatile bit TCKPS1               @ ((unsigned)&T2CON)*8+5;

// Register: T3CON
static volatile unsigned int            T3CON               @ 0x112;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TON                 : 1;
        volatile unsigned                     : 1;
        volatile unsigned TSIDL               : 1;
        volatile unsigned                     : 6;
        volatile unsigned TGATE               : 1;
        volatile unsigned TCKPS               : 2;
        volatile unsigned                     : 2;
        volatile unsigned TCS                 : 1;
        volatile unsigned                     : 1;
    };
    struct {
        volatile unsigned                     : 10;
        volatile unsigned TCKPS1              : 1;
        volatile unsigned TCKPS0              : 1;
        volatile unsigned                     : 4;
    };
} T3CONbits @ 0x112;
// bit variable definitions
// duplicate bit in register T1CON, definition disabled
// static volatile bit TCS                  @ ((unsigned)&T3CON)*8+1;
// duplicate bit in register T1CON, definition disabled
// static volatile bit TGATE                @ ((unsigned)&T3CON)*8+6;
// duplicate bit in register T1CON, definition disabled
// static volatile bit TSIDL                @ ((unsigned)&T3CON)*8+13;
// duplicate bit in register T1CON, definition disabled
// static volatile bit TON                  @ ((unsigned)&T3CON)*8+15;
// duplicate bit in register T1CON, definition disabled
// static volatile bit TCKPS0               @ ((unsigned)&T3CON)*8+4;
// duplicate bit in register T1CON, definition disabled
// static volatile bit TCKPS1               @ ((unsigned)&T3CON)*8+5;

// Register: TMR4
static volatile unsigned int            TMR4                @ 0x114;

// Register: TMR5HLD
static volatile unsigned int            TMR5HLD             @ 0x116;

// Register: TMR5
static volatile unsigned int            TMR5                @ 0x118;

// Register: PR4
static volatile unsigned int            PR4                 @ 0x11A;

// Register: PR5
static volatile unsigned int            PR5                 @ 0x11C;

// Register: T4CON
static volatile unsigned int            T4CON               @ 0x11E;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TON                 : 1;
        volatile unsigned                     : 1;
        volatile unsigned TSIDL               : 1;
        volatile unsigned                     : 6;
        volatile unsigned TGATE               : 1;
        volatile unsigned TCKPS               : 2;
        volatile unsigned T32                 : 1;
        volatile unsigned                     : 1;
        volatile unsigned TCS                 : 1;
        volatile unsigned                     : 1;
    };
    struct {
        volatile unsigned                     : 10;
        volatile unsigned TCKPS1              : 1;
        volatile unsigned TCKPS0              : 1;
        volatile unsigned                     : 4;
    };
} T4CONbits @ 0x11E;
// bit variable definitions
// duplicate bit in register T1CON, definition disabled
// static volatile bit TCS                  @ ((unsigned)&T4CON)*8+1;
// duplicate bit in register T2CON, definition disabled
// static volatile bit T32                  @ ((unsigned)&T4CON)*8+3;
// duplicate bit in register T1CON, definition disabled
// static volatile bit TGATE                @ ((unsigned)&T4CON)*8+6;
// duplicate bit in register T1CON, definition disabled
// static volatile bit TSIDL                @ ((unsigned)&T4CON)*8+13;
// duplicate bit in register T1CON, definition disabled
// static volatile bit TON                  @ ((unsigned)&T4CON)*8+15;
// duplicate bit in register T1CON, definition disabled
// static volatile bit TCKPS0               @ ((unsigned)&T4CON)*8+4;
// duplicate bit in register T1CON, definition disabled
// static volatile bit TCKPS1               @ ((unsigned)&T4CON)*8+5;

// Register: T5CON
static volatile unsigned int            T5CON               @ 0x120;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TON                 : 1;
        volatile unsigned                     : 1;
        volatile unsigned TSIDL               : 1;
        volatile unsigned                     : 6;
        volatile unsigned TGATE               : 1;
        volatile unsigned TCKPS               : 2;
        volatile unsigned                     : 2;
        volatile unsigned TCS                 : 1;
        volatile unsigned                     : 1;
    };
    struct {
        volatile unsigned                     : 10;
        volatile unsigned TCKPS1              : 1;
        volatile unsigned TCKPS0              : 1;
        volatile unsigned                     : 4;
    };
} T5CONbits @ 0x120;
// bit variable definitions
// duplicate bit in register T1CON, definition disabled
// static volatile bit TCS                  @ ((unsigned)&T5CON)*8+1;
// duplicate bit in register T1CON, definition disabled
// static volatile bit TGATE                @ ((unsigned)&T5CON)*8+6;
// duplicate bit in register T1CON, definition disabled
// static volatile bit TSIDL                @ ((unsigned)&T5CON)*8+13;
// duplicate bit in register T1CON, definition disabled
// static volatile bit TON                  @ ((unsigned)&T5CON)*8+15;
// duplicate bit in register T1CON, definition disabled
// static volatile bit TCKPS0               @ ((unsigned)&T5CON)*8+4;
// duplicate bit in register T1CON, definition disabled
// static volatile bit TCKPS1               @ ((unsigned)&T5CON)*8+5;

