Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: QEICON
static volatile unsigned int            QEICON              @ 0x122;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned CNTERR              : 1;
        volatile unsigned                     : 1;
        volatile unsigned QEISIDL             : 1;
        volatile unsigned INDX                : 1;
        volatile unsigned UPDN                : 1;
        volatile unsigned QEIM2               : 1;
        volatile unsigned QEIM1               : 1;
        volatile unsigned QEIM0               : 1;
        volatile unsigned SWPAB               : 1;
        volatile unsigned PCDOUT              : 1;
        volatile unsigned TQGATE              : 1;
        volatile unsigned TQCKPS1             : 1;
        volatile unsigned TQCKPS0             : 1;
        volatile unsigned POSRES              : 1;
        volatile unsigned TQCS                : 1;
        volatile unsigned UPDN_SRC            : 1;
    };
} QEICONbits @ 0x122;
// bit variable definitions
static volatile bit UPDN_SRC             @ ((unsigned)&QEICON)*8+0;
static volatile bit TQCS                 @ ((unsigned)&QEICON)*8+1;
static volatile bit POSRES               @ ((unsigned)&QEICON)*8+2;
static volatile bit TQCKPS0              @ ((unsigned)&QEICON)*8+3;
static volatile bit TQCKPS1              @ ((unsigned)&QEICON)*8+4;
static volatile bit TQGATE               @ ((unsigned)&QEICON)*8+5;
static volatile bit PCDOUT               @ ((unsigned)&QEICON)*8+6;
static volatile bit SWPAB                @ ((unsigned)&QEICON)*8+7;
static volatile bit QEIM0                @ ((unsigned)&QEICON)*8+8;
static volatile bit QEIM1                @ ((unsigned)&QEICON)*8+9;
static volatile bit QEIM2                @ ((unsigned)&QEICON)*8+10;
static volatile bit UPDN                 @ ((unsigned)&QEICON)*8+11;
static volatile bit INDX                 @ ((unsigned)&QEICON)*8+12;
static volatile bit QEISIDL              @ ((unsigned)&QEICON)*8+13;
static volatile bit CNTERR               @ ((unsigned)&QEICON)*8+15;

// Register: DFLTCON
static volatile unsigned int            DFLTCON             @ 0x124;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 5;
        volatile unsigned IMV1                : 1;
        volatile unsigned IMV0                : 1;
        volatile unsigned CEID                : 1;
        volatile unsigned QEOUT               : 1;
        volatile unsigned QECK2               : 1;
        volatile unsigned QECK1               : 1;
        volatile unsigned QECK0               : 1;
        volatile unsigned INDOUT              : 1;
        volatile unsigned INDCK2              : 1;
        volatile unsigned INDCK1              : 1;
        volatile unsigned INDCK0              : 1;
    };
} DFLTCONbits @ 0x124;
// bit variable definitions
static volatile bit INDCK0               @ ((unsigned)&DFLTCON)*8+0;
static volatile bit INDCK1               @ ((unsigned)&DFLTCON)*8+1;
static volatile bit INDCK2               @ ((unsigned)&DFLTCON)*8+2;
static volatile bit INDOUT               @ ((unsigned)&DFLTCON)*8+3;
static volatile bit QECK0                @ ((unsigned)&DFLTCON)*8+4;
static volatile bit QECK1                @ ((unsigned)&DFLTCON)*8+5;
static volatile bit QECK2                @ ((unsigned)&DFLTCON)*8+6;
static volatile bit QEOUT                @ ((unsigned)&DFLTCON)*8+7;
static volatile bit CEID                 @ ((unsigned)&DFLTCON)*8+8;
static volatile bit IMV0                 @ ((unsigned)&DFLTCON)*8+9;
static volatile bit IMV1                 @ ((unsigned)&DFLTCON)*8+10;

// Register: POSCNT
static volatile unsigned int            POSCNT              @ 0x126;

// Register: MAXCNT
static volatile unsigned int            MAXCNT              @ 0x128;

// Register: IC1BUF
static volatile unsigned int            IC1BUF              @ 0x140;

// Register: IC1CON
static volatile unsigned int            IC1CON              @ 0x142;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 2;
        volatile unsigned ICSIDL              : 1;
        volatile unsigned                     : 5;
        volatile unsigned ICTMR               : 1;
        volatile unsigned ICI                 : 2;
        volatile unsigned ICOV                : 1;
        volatile unsigned ICBNE               : 1;
        volatile unsigned ICM                 : 3;
    };
    struct {
        volatile unsigned                     : 9;
        volatile unsigned ICI1                : 1;
        volatile unsigned ICI0                : 1;
        volatile unsigned                     : 2;
        volatile unsigned ICM2                : 1;
        volatile unsigned ICM1                : 1;
        volatile unsigned ICM0                : 1;
    };
} IC1CONbits @ 0x142;
// bit variable definitions
static volatile bit ICBNE                @ ((unsigned)&IC1CON)*8+3;
static volatile bit ICOV                 @ ((unsigned)&IC1CON)*8+4;
static volatile bit ICTMR                @ ((unsigned)&IC1CON)*8+7;
static volatile bit ICSIDL               @ ((unsigned)&IC1CON)*8+13;
static volatile bit ICM0                 @ ((unsigned)&IC1CON)*8+0;
static volatile bit ICM1                 @ ((unsigned)&IC1CON)*8+1;
static volatile bit ICM2                 @ ((unsigned)&IC1CON)*8+2;
static volatile bit ICI0                 @ ((unsigned)&IC1CON)*8+5;
static volatile bit ICI1                 @ ((unsigned)&IC1CON)*8+6;

// Register: IC2BUF
static volatile unsigned int            IC2BUF              @ 0x144;

// Register: IC2CON
static volatile unsigned int            IC2CON              @ 0x146;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 2;
        volatile unsigned ICSIDL              : 1;
        volatile unsigned                     : 5;
        volatile unsigned ICTMR               : 1;
        volatile unsigned ICI                 : 2;
        volatile unsigned ICOV                : 1;
        volatile unsigned ICBNE               : 1;
        volatile unsigned ICM                 : 3;
    };
    struct {
        volatile unsigned                     : 9;
        volatile unsigned ICI1                : 1;
        volatile unsigned ICI0                : 1;
        volatile unsigned                     : 2;
        volatile unsigned ICM2                : 1;
        volatile unsigned ICM1                : 1;
        volatile unsigned ICM0                : 1;
    };
} IC2CONbits @ 0x146;
// bit variable definitions
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICBNE                @ ((unsigned)&IC2CON)*8+3;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICOV                 @ ((unsigned)&IC2CON)*8+4;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICTMR                @ ((unsigned)&IC2CON)*8+7;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICSIDL               @ ((unsigned)&IC2CON)*8+13;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICM0                 @ ((unsigned)&IC2CON)*8+0;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICM1                 @ ((unsigned)&IC2CON)*8+1;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICM2                 @ ((unsigned)&IC2CON)*8+2;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICI0                 @ ((unsigned)&IC2CON)*8+5;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICI1                 @ ((unsigned)&IC2CON)*8+6;

