Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: IC3BUF
static volatile unsigned int            IC3BUF              @ 0x148;

// Register: IC3CON
static volatile unsigned int            IC3CON              @ 0x14A;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 2;
        volatile unsigned ICSIDL              : 1;
        volatile unsigned                     : 5;
        volatile unsigned ICTMR               : 1;
        volatile unsigned ICI                 : 2;
        volatile unsigned ICOV                : 1;
        volatile unsigned ICBNE               : 1;
        volatile unsigned ICM                 : 3;
    };
    struct {
        volatile unsigned                     : 9;
        volatile unsigned ICI1                : 1;
        volatile unsigned ICI0                : 1;
        volatile unsigned                     : 2;
        volatile unsigned ICM2                : 1;
        volatile unsigned ICM1                : 1;
        volatile unsigned ICM0                : 1;
    };
} IC3CONbits @ 0x14A;
// bit variable definitions
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICBNE                @ ((unsigned)&IC3CON)*8+3;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICOV                 @ ((unsigned)&IC3CON)*8+4;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICTMR                @ ((unsigned)&IC3CON)*8+7;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICSIDL               @ ((unsigned)&IC3CON)*8+13;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICM0                 @ ((unsigned)&IC3CON)*8+0;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICM1                 @ ((unsigned)&IC3CON)*8+1;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICM2                 @ ((unsigned)&IC3CON)*8+2;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICI0                 @ ((unsigned)&IC3CON)*8+5;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICI1                 @ ((unsigned)&IC3CON)*8+6;

// Register: IC4BUF
static volatile unsigned int            IC4BUF              @ 0x14C;

// Register: IC4CON
static volatile unsigned int            IC4CON              @ 0x14E;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 2;
        volatile unsigned ICSIDL              : 1;
        volatile unsigned                     : 5;
        volatile unsigned ICTMR               : 1;
        volatile unsigned ICI                 : 2;
        volatile unsigned ICOV                : 1;
        volatile unsigned ICBNE               : 1;
        volatile unsigned ICM                 : 3;
    };
    struct {
        volatile unsigned                     : 9;
        volatile unsigned ICI1                : 1;
        volatile unsigned ICI0                : 1;
        volatile unsigned                     : 2;
        volatile unsigned ICM2                : 1;
        volatile unsigned ICM1                : 1;
        volatile unsigned ICM0                : 1;
    };
} IC4CONbits @ 0x14E;
// bit variable definitions
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICBNE                @ ((unsigned)&IC4CON)*8+3;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICOV                 @ ((unsigned)&IC4CON)*8+4;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICTMR                @ ((unsigned)&IC4CON)*8+7;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICSIDL               @ ((unsigned)&IC4CON)*8+13;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICM0                 @ ((unsigned)&IC4CON)*8+0;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICM1                 @ ((unsigned)&IC4CON)*8+1;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICM2                 @ ((unsigned)&IC4CON)*8+2;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICI0                 @ ((unsigned)&IC4CON)*8+5;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICI1                 @ ((unsigned)&IC4CON)*8+6;

// Register: IC5BUF
static volatile unsigned int            IC5BUF              @ 0x150;

// Register: IC5CON
static volatile unsigned int            IC5CON              @ 0x152;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 2;
        volatile unsigned ICSIDL              : 1;
        volatile unsigned                     : 5;
        volatile unsigned ICTMR               : 1;
        volatile unsigned ICI                 : 2;
        volatile unsigned ICOV                : 1;
        volatile unsigned ICBNE               : 1;
        volatile unsigned ICM                 : 3;
    };
    struct {
        volatile unsigned                     : 9;
        volatile unsigned ICI1                : 1;
        volatile unsigned ICI0                : 1;
        volatile unsigned                     : 2;
        volatile unsigned ICM2                : 1;
        volatile unsigned ICM1                : 1;
        volatile unsigned ICM0                : 1;
    };
} IC5CONbits @ 0x152;
// bit variable definitions
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICBNE                @ ((unsigned)&IC5CON)*8+3;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICOV                 @ ((unsigned)&IC5CON)*8+4;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICTMR                @ ((unsigned)&IC5CON)*8+7;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICSIDL               @ ((unsigned)&IC5CON)*8+13;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICM0                 @ ((unsigned)&IC5CON)*8+0;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICM1                 @ ((unsigned)&IC5CON)*8+1;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICM2                 @ ((unsigned)&IC5CON)*8+2;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICI0                 @ ((unsigned)&IC5CON)*8+5;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICI1                 @ ((unsigned)&IC5CON)*8+6;

// Register: IC6BUF
static volatile unsigned int            IC6BUF              @ 0x154;

