Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: IC6CON
static volatile unsigned int            IC6CON              @ 0x156;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 2;
        volatile unsigned ICSIDL              : 1;
        volatile unsigned                     : 5;
        volatile unsigned ICTMR               : 1;
        volatile unsigned ICI                 : 2;
        volatile unsigned ICOV                : 1;
        volatile unsigned ICBNE               : 1;
        volatile unsigned ICM                 : 3;
    };
    struct {
        volatile unsigned                     : 9;
        volatile unsigned ICI1                : 1;
        volatile unsigned ICI0                : 1;
        volatile unsigned                     : 2;
        volatile unsigned ICM2                : 1;
        volatile unsigned ICM1                : 1;
        volatile unsigned ICM0                : 1;
    };
} IC6CONbits @ 0x156;
// bit variable definitions
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICBNE                @ ((unsigned)&IC6CON)*8+3;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICOV                 @ ((unsigned)&IC6CON)*8+4;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICTMR                @ ((unsigned)&IC6CON)*8+7;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICSIDL               @ ((unsigned)&IC6CON)*8+13;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICM0                 @ ((unsigned)&IC6CON)*8+0;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICM1                 @ ((unsigned)&IC6CON)*8+1;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICM2                 @ ((unsigned)&IC6CON)*8+2;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICI0                 @ ((unsigned)&IC6CON)*8+5;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICI1                 @ ((unsigned)&IC6CON)*8+6;

// Register: IC7BUF
static volatile unsigned int            IC7BUF              @ 0x158;

// Register: IC7CON
static volatile unsigned int            IC7CON              @ 0x15A;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 2;
        volatile unsigned ICSIDL              : 1;
        volatile unsigned                     : 5;
        volatile unsigned ICTMR               : 1;
        volatile unsigned ICI                 : 2;
        volatile unsigned ICOV                : 1;
        volatile unsigned ICBNE               : 1;
        volatile unsigned ICM                 : 3;
    };
    struct {
        volatile unsigned                     : 9;
        volatile unsigned ICI1                : 1;
        volatile unsigned ICI0                : 1;
        volatile unsigned                     : 2;
        volatile unsigned ICM2                : 1;
        volatile unsigned ICM1                : 1;
        volatile unsigned ICM0                : 1;
    };
} IC7CONbits @ 0x15A;
// bit variable definitions
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICBNE                @ ((unsigned)&IC7CON)*8+3;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICOV                 @ ((unsigned)&IC7CON)*8+4;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICTMR                @ ((unsigned)&IC7CON)*8+7;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICSIDL               @ ((unsigned)&IC7CON)*8+13;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICM0                 @ ((unsigned)&IC7CON)*8+0;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICM1                 @ ((unsigned)&IC7CON)*8+1;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICM2                 @ ((unsigned)&IC7CON)*8+2;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICI0                 @ ((unsigned)&IC7CON)*8+5;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICI1                 @ ((unsigned)&IC7CON)*8+6;

// Register: IC8BUF
static volatile unsigned int            IC8BUF              @ 0x15C;

// Register: IC8CON
static volatile unsigned int            IC8CON              @ 0x15E;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 2;
        volatile unsigned ICSIDL              : 1;
        volatile unsigned                     : 5;
        volatile unsigned ICTMR               : 1;
        volatile unsigned ICI                 : 2;
        volatile unsigned ICOV                : 1;
        volatile unsigned ICBNE               : 1;
        volatile unsigned ICM                 : 3;
    };
    struct {
        volatile unsigned                     : 9;
        volatile unsigned ICI1                : 1;
        volatile unsigned ICI0                : 1;
        volatile unsigned                     : 2;
        volatile unsigned ICM2                : 1;
        volatile unsigned ICM1                : 1;
        volatile unsigned ICM0                : 1;
    };
} IC8CONbits @ 0x15E;
// bit variable definitions
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICBNE                @ ((unsigned)&IC8CON)*8+3;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICOV                 @ ((unsigned)&IC8CON)*8+4;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICTMR                @ ((unsigned)&IC8CON)*8+7;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICSIDL               @ ((unsigned)&IC8CON)*8+13;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICM0                 @ ((unsigned)&IC8CON)*8+0;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICM1                 @ ((unsigned)&IC8CON)*8+1;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICM2                 @ ((unsigned)&IC8CON)*8+2;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICI0                 @ ((unsigned)&IC8CON)*8+5;
// duplicate bit in register IC1CON, definition disabled
// static volatile bit ICI1                 @ ((unsigned)&IC8CON)*8+6;

// Register: OC1RS
static volatile unsigned int            OC1RS               @ 0x180;

