Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: OC1R
static volatile unsigned int            OC1R                @ 0x182;

// Register: OC1CON
static volatile unsigned int            OC1CON              @ 0x184;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 2;
        volatile unsigned OCSIDL              : 1;
        volatile unsigned                     : 8;
        volatile unsigned OCFLT               : 1;
        volatile unsigned OCTSEL              : 1;
        volatile unsigned OCM                 : 3;
    };
    struct {
        volatile unsigned                     : 13;
        volatile unsigned OCM2                : 1;
        volatile unsigned OCM1                : 1;
        volatile unsigned OCM0                : 1;
    };
} OC1CONbits @ 0x184;
// bit variable definitions
static volatile bit OCTSEL               @ ((unsigned)&OC1CON)*8+3;
static volatile bit OCFLT                @ ((unsigned)&OC1CON)*8+4;
static volatile bit OCSIDL               @ ((unsigned)&OC1CON)*8+13;
static volatile bit OCM0                 @ ((unsigned)&OC1CON)*8+0;
static volatile bit OCM1                 @ ((unsigned)&OC1CON)*8+1;
static volatile bit OCM2                 @ ((unsigned)&OC1CON)*8+2;

// Register: OC2RS
static volatile unsigned int            OC2RS               @ 0x186;

// Register: OC2R
static volatile unsigned int            OC2R                @ 0x188;

// Register: OC2CON
static volatile unsigned int            OC2CON              @ 0x18A;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 2;
        volatile unsigned OCSIDL              : 1;
        volatile unsigned                     : 8;
        volatile unsigned OCFLT               : 1;
        volatile unsigned OCTSEL              : 1;
        volatile unsigned OCM                 : 3;
    };
    struct {
        volatile unsigned                     : 13;
        volatile unsigned OCM2                : 1;
        volatile unsigned OCM1                : 1;
        volatile unsigned OCM0                : 1;
    };
} OC2CONbits @ 0x18A;
// bit variable definitions
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCTSEL               @ ((unsigned)&OC2CON)*8+3;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCFLT                @ ((unsigned)&OC2CON)*8+4;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCSIDL               @ ((unsigned)&OC2CON)*8+13;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCM0                 @ ((unsigned)&OC2CON)*8+0;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCM1                 @ ((unsigned)&OC2CON)*8+1;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCM2                 @ ((unsigned)&OC2CON)*8+2;

// Register: OC3RS
static volatile unsigned int            OC3RS               @ 0x18C;

// Register: OC3R
static volatile unsigned int            OC3R                @ 0x18E;

// Register: OC3CON
static volatile unsigned int            OC3CON              @ 0x190;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 2;
        volatile unsigned OCSIDL              : 1;
        volatile unsigned                     : 8;
        volatile unsigned OCFLT               : 1;
        volatile unsigned OCTSEL              : 1;
        volatile unsigned OCM                 : 3;
    };
    struct {
        volatile unsigned                     : 13;
        volatile unsigned OCM2                : 1;
        volatile unsigned OCM1                : 1;
        volatile unsigned OCM0                : 1;
    };
} OC3CONbits @ 0x190;
// bit variable definitions
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCTSEL               @ ((unsigned)&OC3CON)*8+3;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCFLT                @ ((unsigned)&OC3CON)*8+4;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCSIDL               @ ((unsigned)&OC3CON)*8+13;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCM0                 @ ((unsigned)&OC3CON)*8+0;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCM1                 @ ((unsigned)&OC3CON)*8+1;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCM2                 @ ((unsigned)&OC3CON)*8+2;

// Register: OC4RS
static volatile unsigned int            OC4RS               @ 0x192;

// Register: OC4R
static volatile unsigned int            OC4R                @ 0x194;

// Register: OC4CON
static volatile unsigned int            OC4CON              @ 0x196;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 2;
        volatile unsigned OCSIDL              : 1;
        volatile unsigned                     : 8;
        volatile unsigned OCFLT               : 1;
        volatile unsigned OCTSEL              : 1;
        volatile unsigned OCM                 : 3;
    };
    struct {
        volatile unsigned                     : 13;
        volatile unsigned OCM2                : 1;
        volatile unsigned OCM1                : 1;
        volatile unsigned OCM0                : 1;
    };
} OC4CONbits @ 0x196;
// bit variable definitions
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCTSEL               @ ((unsigned)&OC4CON)*8+3;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCFLT                @ ((unsigned)&OC4CON)*8+4;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCSIDL               @ ((unsigned)&OC4CON)*8+13;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCM0                 @ ((unsigned)&OC4CON)*8+0;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCM1                 @ ((unsigned)&OC4CON)*8+1;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCM2                 @ ((unsigned)&OC4CON)*8+2;

// Register: OC5RS
static volatile unsigned int            OC5RS               @ 0x198;

