Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: OC5R
static volatile unsigned int            OC5R                @ 0x19A;

// Register: OC5CON
static volatile unsigned int            OC5CON              @ 0x19C;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 2;
        volatile unsigned OCSIDL              : 1;
        volatile unsigned                     : 8;
        volatile unsigned OCFLT               : 1;
        volatile unsigned OCTSEL              : 1;
        volatile unsigned OCM                 : 3;
    };
    struct {
        volatile unsigned                     : 13;
        volatile unsigned OCM2                : 1;
        volatile unsigned OCM1                : 1;
        volatile unsigned OCM0                : 1;
    };
} OC5CONbits @ 0x19C;
// bit variable definitions
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCTSEL               @ ((unsigned)&OC5CON)*8+3;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCFLT                @ ((unsigned)&OC5CON)*8+4;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCSIDL               @ ((unsigned)&OC5CON)*8+13;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCM0                 @ ((unsigned)&OC5CON)*8+0;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCM1                 @ ((unsigned)&OC5CON)*8+1;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCM2                 @ ((unsigned)&OC5CON)*8+2;

// Register: OC6RS
static volatile unsigned int            OC6RS               @ 0x19E;

// Register: OC6R
static volatile unsigned int            OC6R                @ 0x1A0;

// Register: OC6CON
static volatile unsigned int            OC6CON              @ 0x1A2;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 2;
        volatile unsigned OCSIDL              : 1;
        volatile unsigned                     : 8;
        volatile unsigned OCFLT               : 1;
        volatile unsigned OCTSEL              : 1;
        volatile unsigned OCM                 : 3;
    };
    struct {
        volatile unsigned                     : 13;
        volatile unsigned OCM2                : 1;
        volatile unsigned OCM1                : 1;
        volatile unsigned OCM0                : 1;
    };
} OC6CONbits @ 0x1A2;
// bit variable definitions
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCTSEL               @ ((unsigned)&OC6CON)*8+3;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCFLT                @ ((unsigned)&OC6CON)*8+4;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCSIDL               @ ((unsigned)&OC6CON)*8+13;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCM0                 @ ((unsigned)&OC6CON)*8+0;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCM1                 @ ((unsigned)&OC6CON)*8+1;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCM2                 @ ((unsigned)&OC6CON)*8+2;

// Register: OC7RS
static volatile unsigned int            OC7RS               @ 0x1A4;

// Register: OC7R
static volatile unsigned int            OC7R                @ 0x1A6;

// Register: OC7CON
static volatile unsigned int            OC7CON              @ 0x1A8;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 2;
        volatile unsigned OCSIDL              : 1;
        volatile unsigned                     : 8;
        volatile unsigned OCFLT               : 1;
        volatile unsigned OCTSEL              : 1;
        volatile unsigned OCM                 : 3;
    };
    struct {
        volatile unsigned                     : 13;
        volatile unsigned OCM2                : 1;
        volatile unsigned OCM1                : 1;
        volatile unsigned OCM0                : 1;
    };
} OC7CONbits @ 0x1A8;
// bit variable definitions
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCTSEL               @ ((unsigned)&OC7CON)*8+3;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCFLT                @ ((unsigned)&OC7CON)*8+4;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCSIDL               @ ((unsigned)&OC7CON)*8+13;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCM0                 @ ((unsigned)&OC7CON)*8+0;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCM1                 @ ((unsigned)&OC7CON)*8+1;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCM2                 @ ((unsigned)&OC7CON)*8+2;

// Register: OC8RS
static volatile unsigned int            OC8RS               @ 0x1AA;

// Register: OC8R
static volatile unsigned int            OC8R                @ 0x1AC;

// Register: OC8CON
static volatile unsigned int            OC8CON              @ 0x1AE;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 2;
        volatile unsigned OCSIDL              : 1;
        volatile unsigned                     : 8;
        volatile unsigned OCFLT               : 1;
        volatile unsigned OCTSEL              : 1;
        volatile unsigned OCM                 : 3;
    };
    struct {
        volatile unsigned                     : 13;
        volatile unsigned OCM2                : 1;
        volatile unsigned OCM1                : 1;
        volatile unsigned OCM0                : 1;
    };
} OC8CONbits @ 0x1AE;
// bit variable definitions
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCTSEL               @ ((unsigned)&OC8CON)*8+3;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCFLT                @ ((unsigned)&OC8CON)*8+4;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCSIDL               @ ((unsigned)&OC8CON)*8+13;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCM0                 @ ((unsigned)&OC8CON)*8+0;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCM1                 @ ((unsigned)&OC8CON)*8+1;
// duplicate bit in register OC1CON, definition disabled
// static volatile bit OCM2                 @ ((unsigned)&OC8CON)*8+2;

// Register: PTCON
static volatile unsigned int            PTCON               @ 0x1C0;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned PTEN                : 1;
        volatile unsigned                     : 1;
        volatile unsigned PTSIDL              : 1;
        volatile unsigned                     : 5;
        volatile unsigned PTOPS               : 4;
        volatile unsigned PTCKPS              : 2;
        volatile unsigned PTMOD               : 2;
    };
    struct {
        volatile unsigned                     : 8;
        volatile unsigned PTOPS3              : 1;
        volatile unsigned PTOPS2              : 1;
        volatile unsigned PTOPS1              : 1;
        volatile unsigned PTOPS0              : 1;
        volatile unsigned PTCKPS1             : 1;
        volatile unsigned PTCKPS0             : 1;
        volatile unsigned PTMOD1              : 1;
        volatile unsigned PTMOD0              : 1;
    };
} PTCONbits @ 0x1C0;
// bit variable definitions
static volatile bit PTSIDL               @ ((unsigned)&PTCON)*8+13;
static volatile bit PTEN                 @ ((unsigned)&PTCON)*8+15;
static volatile bit PTMOD0               @ ((unsigned)&PTCON)*8+0;
static volatile bit PTMOD1               @ ((unsigned)&PTCON)*8+1;
static volatile bit PTCKPS0              @ ((unsigned)&PTCON)*8+2;
static volatile bit PTCKPS1              @ ((unsigned)&PTCON)*8+3;
static volatile bit PTOPS0               @ ((unsigned)&PTCON)*8+4;
static volatile bit PTOPS1               @ ((unsigned)&PTCON)*8+5;
static volatile bit PTOPS2               @ ((unsigned)&PTCON)*8+6;
static volatile bit PTOPS3               @ ((unsigned)&PTCON)*8+7;

// Register: PTMR
static volatile unsigned int            PTMR                @ 0x1C2;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned PTDIR               : 1;
        volatile unsigned PTMR                : 15;
    };
    struct {
        volatile unsigned                     : 1;
        volatile unsigned PTMR14              : 1;
        volatile unsigned PTMR13              : 1;
        volatile unsigned PTMR12              : 1;
        volatile unsigned PTMR11              : 1;
        volatile unsigned PTMR10              : 1;
        volatile unsigned PTMR9               : 1;
        volatile unsigned PTMR8               : 1;
        volatile unsigned PTMR7               : 1;
        volatile unsigned PTMR6               : 1;
        volatile unsigned PTMR5               : 1;
        volatile unsigned PTMR4               : 1;
        volatile unsigned PTMR3               : 1;
        volatile unsigned PTMR2               : 1;
        volatile unsigned PTMR1               : 1;
        volatile unsigned PTMR0               : 1;
    };
} PTMRbits @ 0x1C2;
// bit variable definitions
static volatile bit PTDIR                @ ((unsigned)&PTMR)*8+15;
static volatile bit PTMR0                @ ((unsigned)&PTMR)*8+0;
static volatile bit PTMR1                @ ((unsigned)&PTMR)*8+1;
static volatile bit PTMR2                @ ((unsigned)&PTMR)*8+2;
static volatile bit PTMR3                @ ((unsigned)&PTMR)*8+3;
static volatile bit PTMR4                @ ((unsigned)&PTMR)*8+4;
static volatile bit PTMR5                @ ((unsigned)&PTMR)*8+5;
static volatile bit PTMR6                @ ((unsigned)&PTMR)*8+6;
static volatile bit PTMR7                @ ((unsigned)&PTMR)*8+7;
static volatile bit PTMR8                @ ((unsigned)&PTMR)*8+8;
static volatile bit PTMR9                @ ((unsigned)&PTMR)*8+9;
static volatile bit PTMR10               @ ((unsigned)&PTMR)*8+10;
static volatile bit PTMR11               @ ((unsigned)&PTMR)*8+11;
static volatile bit PTMR12               @ ((unsigned)&PTMR)*8+12;
static volatile bit PTMR13               @ ((unsigned)&PTMR)*8+13;
static volatile bit PTMR14               @ ((unsigned)&PTMR)*8+14;

// Register: PTPER
static volatile unsigned int            PTPER               @ 0x1C4;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 1;
        volatile unsigned PTPER               : 15;
    };
} PTPERbits @ 0x1C4;

