Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: SEVTCMP
static volatile unsigned int            SEVTCMP             @ 0x1C6;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned SEVTDIR             : 1;
        volatile unsigned SEVTCMP             : 15;
    };
    struct {
        volatile unsigned                     : 1;
        volatile unsigned SEVTCMP14           : 1;
        volatile unsigned SEVTCMP13           : 1;
        volatile unsigned SEVTCMP12           : 1;
        volatile unsigned SEVTCMP11           : 1;
        volatile unsigned SEVTCMP10           : 1;
        volatile unsigned SEVTCMP9            : 1;
        volatile unsigned SEVTCMP8            : 1;
        volatile unsigned SEVTCMP7            : 1;
        volatile unsigned SEVTCMP6            : 1;
        volatile unsigned SEVTCMP5            : 1;
        volatile unsigned SEVTCMP4            : 1;
        volatile unsigned SEVTCMP3            : 1;
        volatile unsigned SEVTCMP2            : 1;
        volatile unsigned SEVTCMP1            : 1;
        volatile unsigned SEVTCMP0            : 1;
    };
} SEVTCMPbits @ 0x1C6;
// bit variable definitions
static volatile bit SEVTDIR              @ ((unsigned)&SEVTCMP)*8+15;
static volatile bit SEVTCMP0             @ ((unsigned)&SEVTCMP)*8+0;
static volatile bit SEVTCMP1             @ ((unsigned)&SEVTCMP)*8+1;
static volatile bit SEVTCMP2             @ ((unsigned)&SEVTCMP)*8+2;
static volatile bit SEVTCMP3             @ ((unsigned)&SEVTCMP)*8+3;
static volatile bit SEVTCMP4             @ ((unsigned)&SEVTCMP)*8+4;
static volatile bit SEVTCMP5             @ ((unsigned)&SEVTCMP)*8+5;
static volatile bit SEVTCMP6             @ ((unsigned)&SEVTCMP)*8+6;
static volatile bit SEVTCMP7             @ ((unsigned)&SEVTCMP)*8+7;
static volatile bit SEVTCMP8             @ ((unsigned)&SEVTCMP)*8+8;
static volatile bit SEVTCMP9             @ ((unsigned)&SEVTCMP)*8+9;
static volatile bit SEVTCMP10            @ ((unsigned)&SEVTCMP)*8+10;
static volatile bit SEVTCMP11            @ ((unsigned)&SEVTCMP)*8+11;
static volatile bit SEVTCMP12            @ ((unsigned)&SEVTCMP)*8+12;
static volatile bit SEVTCMP13            @ ((unsigned)&SEVTCMP)*8+13;
static volatile bit SEVTCMP14            @ ((unsigned)&SEVTCMP)*8+14;

// Register: PWMCON1
static volatile unsigned int            PWMCON1             @ 0x1C8;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 4;
        volatile unsigned PTMOD4              : 1;
        volatile unsigned PTMOD3              : 1;
        volatile unsigned PTMOD2              : 1;
        volatile unsigned PTMOD1              : 1;
        volatile unsigned PEN4H               : 1;
        volatile unsigned PEN3H               : 1;
        volatile unsigned PEN2H               : 1;
        volatile unsigned PEN1H               : 1;
        volatile unsigned PEN4L               : 1;
        volatile unsigned PEN3L               : 1;
        volatile unsigned PEN2L               : 1;
        volatile unsigned PEN1L               : 1;
    };
} PWMCON1bits @ 0x1C8;
// bit variable definitions
static volatile bit PEN1L                @ ((unsigned)&PWMCON1)*8+0;
static volatile bit PEN2L                @ ((unsigned)&PWMCON1)*8+1;
static volatile bit PEN3L                @ ((unsigned)&PWMCON1)*8+2;
static volatile bit PEN4L                @ ((unsigned)&PWMCON1)*8+3;
static volatile bit PEN1H                @ ((unsigned)&PWMCON1)*8+4;
static volatile bit PEN2H                @ ((unsigned)&PWMCON1)*8+5;
static volatile bit PEN3H                @ ((unsigned)&PWMCON1)*8+6;
static volatile bit PEN4H                @ ((unsigned)&PWMCON1)*8+7;
// duplicate bit in register PTCON, definition disabled
// static volatile bit PTMOD1               @ ((unsigned)&PWMCON1)*8+8;
static volatile bit PTMOD2               @ ((unsigned)&PWMCON1)*8+9;
static volatile bit PTMOD3               @ ((unsigned)&PWMCON1)*8+10;
static volatile bit PTMOD4               @ ((unsigned)&PWMCON1)*8+11;

// Register: PWMCON2
static volatile unsigned int            PWMCON2             @ 0x1CA;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 4;
        volatile unsigned SEVOPS              : 4;
        volatile unsigned                     : 5;
        volatile unsigned IUE                 : 1;
        volatile unsigned OSYNC               : 1;
        volatile unsigned UDIS                : 1;
    };
    struct {
        volatile unsigned                     : 4;
        volatile unsigned SEVOPS3             : 1;
        volatile unsigned SEVOPS2             : 1;
        volatile unsigned SEVOPS1             : 1;
        volatile unsigned SEVOPS0             : 1;
        volatile unsigned                     : 8;
    };
} PWMCON2bits @ 0x1CA;
// bit variable definitions
static volatile bit UDIS                 @ ((unsigned)&PWMCON2)*8+0;
static volatile bit OSYNC                @ ((unsigned)&PWMCON2)*8+1;
static volatile bit IUE                  @ ((unsigned)&PWMCON2)*8+2;
static volatile bit SEVOPS0              @ ((unsigned)&PWMCON2)*8+8;
static volatile bit SEVOPS1              @ ((unsigned)&PWMCON2)*8+9;
static volatile bit SEVOPS2              @ ((unsigned)&PWMCON2)*8+10;
static volatile bit SEVOPS3              @ ((unsigned)&PWMCON2)*8+11;

// Register: DTCON1
static volatile unsigned int            DTCON1              @ 0x1CC;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned DTBPS               : 2;
        volatile unsigned DTB                 : 6;
        volatile unsigned DTAPS               : 2;
        volatile unsigned DTA                 : 6;
    };
    struct {
        volatile unsigned DTBPS1              : 1;
        volatile unsigned DTBPS0              : 1;
        volatile unsigned DTB5                : 1;
        volatile unsigned DTB4                : 1;
        volatile unsigned DTB3                : 1;
        volatile unsigned DTB2                : 1;
        volatile unsigned DTB1                : 1;
        volatile unsigned DTB0                : 1;
        volatile unsigned DTAPS1              : 1;
        volatile unsigned DTAPS0              : 1;
        volatile unsigned DTA5                : 1;
        volatile unsigned DTA4                : 1;
        volatile unsigned DTA3                : 1;
        volatile unsigned DTA2                : 1;
        volatile unsigned DTA1                : 1;
        volatile unsigned DTA0                : 1;
    };
} DTCON1bits @ 0x1CC;
// bit variable definitions
static volatile bit DTA0                 @ ((unsigned)&DTCON1)*8+0;
static volatile bit DTA1                 @ ((unsigned)&DTCON1)*8+1;
static volatile bit DTA2                 @ ((unsigned)&DTCON1)*8+2;
static volatile bit DTA3                 @ ((unsigned)&DTCON1)*8+3;
static volatile bit DTA4                 @ ((unsigned)&DTCON1)*8+4;
static volatile bit DTA5                 @ ((unsigned)&DTCON1)*8+5;
static volatile bit DTAPS0               @ ((unsigned)&DTCON1)*8+6;
static volatile bit DTAPS1               @ ((unsigned)&DTCON1)*8+7;
static volatile bit DTB0                 @ ((unsigned)&DTCON1)*8+8;
static volatile bit DTB1                 @ ((unsigned)&DTCON1)*8+9;
static volatile bit DTB2                 @ ((unsigned)&DTCON1)*8+10;
static volatile bit DTB3                 @ ((unsigned)&DTCON1)*8+11;
static volatile bit DTB4                 @ ((unsigned)&DTCON1)*8+12;
static volatile bit DTB5                 @ ((unsigned)&DTCON1)*8+13;
static volatile bit DTBPS0               @ ((unsigned)&DTCON1)*8+14;
static volatile bit DTBPS1               @ ((unsigned)&DTCON1)*8+15;

