Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: DTCON2
static volatile unsigned int            DTCON2              @ 0x1CE;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 8;
        volatile unsigned DTS4A               : 1;
        volatile unsigned DTS4I               : 1;
        volatile unsigned DTS3A               : 1;
        volatile unsigned DTS3I               : 1;
        volatile unsigned DTS2A               : 1;
        volatile unsigned DTS2I               : 1;
        volatile unsigned DTS1A               : 1;
        volatile unsigned DTS1I               : 1;
    };
} DTCON2bits @ 0x1CE;
// bit variable definitions
static volatile bit DTS1I                @ ((unsigned)&DTCON2)*8+0;
static volatile bit DTS1A                @ ((unsigned)&DTCON2)*8+1;
static volatile bit DTS2I                @ ((unsigned)&DTCON2)*8+2;
static volatile bit DTS2A                @ ((unsigned)&DTCON2)*8+3;
static volatile bit DTS3I                @ ((unsigned)&DTCON2)*8+4;
static volatile bit DTS3A                @ ((unsigned)&DTCON2)*8+5;
static volatile bit DTS4I                @ ((unsigned)&DTCON2)*8+6;
static volatile bit DTS4A                @ ((unsigned)&DTCON2)*8+7;

// Register: FLTACON
static volatile unsigned int            FLTACON             @ 0x1D0;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned FAOV4H              : 1;
        volatile unsigned FAOV4L              : 1;
        volatile unsigned FAOV3H              : 1;
        volatile unsigned FAOV3L              : 1;
        volatile unsigned FAOV2H              : 1;
        volatile unsigned FAOV2L              : 1;
        volatile unsigned FAOV1H              : 1;
        volatile unsigned FAOV1L              : 1;
        volatile unsigned FLTAM               : 1;
        volatile unsigned                     : 3;
        volatile unsigned FAEN4               : 1;
        volatile unsigned FAEN3               : 1;
        volatile unsigned FAEN2               : 1;
        volatile unsigned FAEN1               : 1;
    };
} FLTACONbits @ 0x1D0;
// bit variable definitions
static volatile bit FAEN1                @ ((unsigned)&FLTACON)*8+0;
static volatile bit FAEN2                @ ((unsigned)&FLTACON)*8+1;
static volatile bit FAEN3                @ ((unsigned)&FLTACON)*8+2;
static volatile bit FAEN4                @ ((unsigned)&FLTACON)*8+3;
static volatile bit FLTAM                @ ((unsigned)&FLTACON)*8+7;
static volatile bit FAOV1L               @ ((unsigned)&FLTACON)*8+8;
static volatile bit FAOV1H               @ ((unsigned)&FLTACON)*8+9;
static volatile bit FAOV2L               @ ((unsigned)&FLTACON)*8+10;
static volatile bit FAOV2H               @ ((unsigned)&FLTACON)*8+11;
static volatile bit FAOV3L               @ ((unsigned)&FLTACON)*8+12;
static volatile bit FAOV3H               @ ((unsigned)&FLTACON)*8+13;
static volatile bit FAOV4L               @ ((unsigned)&FLTACON)*8+14;
static volatile bit FAOV4H               @ ((unsigned)&FLTACON)*8+15;

// Register: FLTBCON
static volatile unsigned int            FLTBCON             @ 0x1D2;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned FBOV4H              : 1;
        volatile unsigned FBOV4L              : 1;
        volatile unsigned FBOV3H              : 1;
        volatile unsigned FBOV3L              : 1;
        volatile unsigned FBOV2H              : 1;
        volatile unsigned FBOV2L              : 1;
        volatile unsigned FBOV1H              : 1;
        volatile unsigned FBOV1L              : 1;
        volatile unsigned FLTBM               : 1;
        volatile unsigned                     : 3;
        volatile unsigned FBEN4               : 1;
        volatile unsigned FBEN3               : 1;
        volatile unsigned FBEN2               : 1;
        volatile unsigned FBEN1               : 1;
    };
} FLTBCONbits @ 0x1D2;
// bit variable definitions
static volatile bit FBEN1                @ ((unsigned)&FLTBCON)*8+0;
static volatile bit FBEN2                @ ((unsigned)&FLTBCON)*8+1;
static volatile bit FBEN3                @ ((unsigned)&FLTBCON)*8+2;
static volatile bit FBEN4                @ ((unsigned)&FLTBCON)*8+3;
static volatile bit FLTBM                @ ((unsigned)&FLTBCON)*8+7;
static volatile bit FBOV1L               @ ((unsigned)&FLTBCON)*8+8;
static volatile bit FBOV1H               @ ((unsigned)&FLTBCON)*8+9;
static volatile bit FBOV2L               @ ((unsigned)&FLTBCON)*8+10;
static volatile bit FBOV2H               @ ((unsigned)&FLTBCON)*8+11;
static volatile bit FBOV3L               @ ((unsigned)&FLTBCON)*8+12;
static volatile bit FBOV3H               @ ((unsigned)&FLTBCON)*8+13;
static volatile bit FBOV4L               @ ((unsigned)&FLTBCON)*8+14;
static volatile bit FBOV4H               @ ((unsigned)&FLTBCON)*8+15;

// Register: OVDCON
static volatile unsigned int            OVDCON              @ 0x1D4;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned POVD4H              : 1;
        volatile unsigned POVD4L              : 1;
        volatile unsigned POVD3H              : 1;
        volatile unsigned POVD3L              : 1;
        volatile unsigned POVD2H              : 1;
        volatile unsigned POVD2L              : 1;
        volatile unsigned POVD1H              : 1;
        volatile unsigned POVD1L              : 1;
        volatile unsigned POUT4H              : 1;
        volatile unsigned POUT4L              : 1;
        volatile unsigned POUT3H              : 1;
        volatile unsigned POUT3L              : 1;
        volatile unsigned POUT2H              : 1;
        volatile unsigned POUT2L              : 1;
        volatile unsigned POUT1H              : 1;
        volatile unsigned POUT1L              : 1;
    };
} OVDCONbits @ 0x1D4;
// bit variable definitions
static volatile bit POUT1L               @ ((unsigned)&OVDCON)*8+0;
static volatile bit POUT1H               @ ((unsigned)&OVDCON)*8+1;
static volatile bit POUT2L               @ ((unsigned)&OVDCON)*8+2;
static volatile bit POUT2H               @ ((unsigned)&OVDCON)*8+3;
static volatile bit POUT3L               @ ((unsigned)&OVDCON)*8+4;
static volatile bit POUT3H               @ ((unsigned)&OVDCON)*8+5;
static volatile bit POUT4L               @ ((unsigned)&OVDCON)*8+6;
static volatile bit POUT4H               @ ((unsigned)&OVDCON)*8+7;
static volatile bit POVD1L               @ ((unsigned)&OVDCON)*8+8;
static volatile bit POVD1H               @ ((unsigned)&OVDCON)*8+9;
static volatile bit POVD2L               @ ((unsigned)&OVDCON)*8+10;
static volatile bit POVD2H               @ ((unsigned)&OVDCON)*8+11;
static volatile bit POVD3L               @ ((unsigned)&OVDCON)*8+12;
static volatile bit POVD3H               @ ((unsigned)&OVDCON)*8+13;
static volatile bit POVD4L               @ ((unsigned)&OVDCON)*8+14;
static volatile bit POVD4H               @ ((unsigned)&OVDCON)*8+15;

// Register: PDC1
static volatile unsigned int            PDC1                @ 0x1D6;

