Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: PDC2
static volatile unsigned int            PDC2                @ 0x1D8;

// Register: PDC3
static volatile unsigned int            PDC3                @ 0x1DA;

// Register: PDC4
static volatile unsigned int            PDC4                @ 0x1DC;

// Register: I2CRCV
static volatile unsigned int            I2CRCV              @ 0x200;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 8;
        volatile unsigned I2CRCV              : 8;
    };
} I2CRCVbits @ 0x200;

// Register: I2CTRN
static volatile unsigned int            I2CTRN              @ 0x202;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 8;
        volatile unsigned I2CTRN              : 8;
    };
} I2CTRNbits @ 0x202;

// Register: I2CBRG
static volatile unsigned int            I2CBRG              @ 0x204;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 7;
        volatile unsigned I2CBRG              : 9;
    };
} I2CBRGbits @ 0x204;

// Register: I2CCON
static volatile unsigned int            I2CCON              @ 0x206;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned I2CEN               : 1;
        volatile unsigned                     : 1;
        volatile unsigned I2CSIDL             : 1;
        volatile unsigned SCLREL              : 1;
        volatile unsigned IPMIEN              : 1;
        volatile unsigned A10M                : 1;
        volatile unsigned DISSLW              : 1;
        volatile unsigned SMEN                : 1;
        volatile unsigned GCEN                : 1;
        volatile unsigned STREN               : 1;
        volatile unsigned ACKDT               : 1;
        volatile unsigned ACKEN               : 1;
        volatile unsigned RCEN                : 1;
        volatile unsigned PEN                 : 1;
        volatile unsigned RSEN                : 1;
        volatile unsigned SEN                 : 1;
    };
} I2CCONbits @ 0x206;
// bit variable definitions
static volatile bit SEN                  @ ((unsigned)&I2CCON)*8+0;
static volatile bit RSEN                 @ ((unsigned)&I2CCON)*8+1;
static volatile bit PEN                  @ ((unsigned)&I2CCON)*8+2;
static volatile bit RCEN                 @ ((unsigned)&I2CCON)*8+3;
static volatile bit ACKEN                @ ((unsigned)&I2CCON)*8+4;
static volatile bit ACKDT                @ ((unsigned)&I2CCON)*8+5;
static volatile bit STREN                @ ((unsigned)&I2CCON)*8+6;
static volatile bit GCEN                 @ ((unsigned)&I2CCON)*8+7;
static volatile bit SMEN                 @ ((unsigned)&I2CCON)*8+8;
static volatile bit DISSLW               @ ((unsigned)&I2CCON)*8+9;
static volatile bit A10M                 @ ((unsigned)&I2CCON)*8+10;
static volatile bit IPMIEN               @ ((unsigned)&I2CCON)*8+11;
static volatile bit SCLREL               @ ((unsigned)&I2CCON)*8+12;
static volatile bit I2CSIDL              @ ((unsigned)&I2CCON)*8+13;
static volatile bit I2CEN                @ ((unsigned)&I2CCON)*8+15;

// Register: I2CSTAT
static volatile unsigned int            I2CSTAT             @ 0x208;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned ACKSTAT             : 1;
        volatile unsigned TRSTAT              : 1;
        volatile unsigned                     : 3;
        volatile unsigned BCL                 : 1;
        volatile unsigned GCSTAT              : 1;
        volatile unsigned ADD10               : 1;
        volatile unsigned IWCOL               : 1;
        volatile unsigned I2COV               : 1;
        volatile unsigned D_A                 : 1;
        volatile unsigned P                   : 1;
        volatile unsigned S                   : 1;
        volatile unsigned R_W                 : 1;
        volatile unsigned RBF                 : 1;
        volatile unsigned TBF                 : 1;
    };
    struct {
        volatile unsigned                     : 10;
        volatile unsigned D_nA                : 1;
        volatile unsigned                     : 2;
        volatile unsigned R_nW                : 1;
        volatile unsigned                     : 2;
    };
} I2CSTATbits @ 0x208;
// bit variable definitions
static volatile bit TBF                  @ ((unsigned)&I2CSTAT)*8+0;
static volatile bit RBF                  @ ((unsigned)&I2CSTAT)*8+1;
static volatile bit R_W                  @ ((unsigned)&I2CSTAT)*8+2;
static volatile bit S                    @ ((unsigned)&I2CSTAT)*8+3;
static volatile bit P                    @ ((unsigned)&I2CSTAT)*8+4;
static volatile bit D_A                  @ ((unsigned)&I2CSTAT)*8+5;
static volatile bit I2COV                @ ((unsigned)&I2CSTAT)*8+6;
static volatile bit IWCOL                @ ((unsigned)&I2CSTAT)*8+7;
static volatile bit ADD10                @ ((unsigned)&I2CSTAT)*8+8;
static volatile bit GCSTAT               @ ((unsigned)&I2CSTAT)*8+9;
static volatile bit BCL                  @ ((unsigned)&I2CSTAT)*8+10;
static volatile bit TRSTAT               @ ((unsigned)&I2CSTAT)*8+14;
static volatile bit ACKSTAT              @ ((unsigned)&I2CSTAT)*8+15;
static volatile bit R_nW                 @ ((unsigned)&I2CSTAT)*8+2;
static volatile bit D_nA                 @ ((unsigned)&I2CSTAT)*8+5;

// Register: I2CADD
static volatile unsigned int            I2CADD              @ 0x20A;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 6;
        volatile unsigned I2CADD              : 10;
    };
} I2CADDbits @ 0x20A;

// Register: U1MODE
static volatile unsigned int            U1MODE              @ 0x20C;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned UARTEN              : 1;
        volatile unsigned                     : 1;
        volatile unsigned USIDL               : 1;
        volatile unsigned                     : 2;
        volatile unsigned ALTIO               : 1;
        volatile unsigned                     : 2;
        volatile unsigned WAKE                : 1;
        volatile unsigned LPBACK              : 1;
        volatile unsigned ABAUD               : 1;
        volatile unsigned                     : 2;
        volatile unsigned PDSEL               : 2;
        volatile unsigned STSEL               : 1;
    };
    struct {
        volatile unsigned                     : 13;
        volatile unsigned PDSEL1              : 1;
        volatile unsigned PDSEL0              : 1;
        volatile unsigned                     : 1;
    };
} U1MODEbits @ 0x20C;
// bit variable definitions
static volatile bit STSEL                @ ((unsigned)&U1MODE)*8+0;
static volatile bit ABAUD                @ ((unsigned)&U1MODE)*8+5;
static volatile bit LPBACK               @ ((unsigned)&U1MODE)*8+6;
static volatile bit WAKE                 @ ((unsigned)&U1MODE)*8+7;
static volatile bit ALTIO                @ ((unsigned)&U1MODE)*8+10;
static volatile bit USIDL                @ ((unsigned)&U1MODE)*8+13;
static volatile bit UARTEN               @ ((unsigned)&U1MODE)*8+15;
static volatile bit PDSEL0               @ ((unsigned)&U1MODE)*8+1;
static volatile bit PDSEL1               @ ((unsigned)&U1MODE)*8+2;

// Register: U1STA
static volatile unsigned int            U1STA               @ 0x20E;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned UTXISEL             : 1;
        volatile unsigned                     : 3;
        volatile unsigned UTXBRK              : 1;
        volatile unsigned UTXEN               : 1;
        volatile unsigned UTXBF               : 1;
        volatile unsigned TRMT                : 1;
        volatile unsigned URXISEL             : 2;
        volatile unsigned ADDEN               : 1;
        volatile unsigned RIDLE               : 1;
        volatile unsigned PERR                : 1;
        volatile unsigned FERR                : 1;
        volatile unsigned OERR                : 1;
        volatile unsigned URXDA               : 1;
    };
    struct {
        volatile unsigned                     : 8;
        volatile unsigned URXISEL1            : 1;
        volatile unsigned URXISEL0            : 1;
        volatile unsigned                     : 6;
    };
} U1STAbits @ 0x20E;
// bit variable definitions
static volatile bit URXDA                @ ((unsigned)&U1STA)*8+0;
static volatile bit OERR                 @ ((unsigned)&U1STA)*8+1;
static volatile bit FERR                 @ ((unsigned)&U1STA)*8+2;
static volatile bit PERR                 @ ((unsigned)&U1STA)*8+3;
static volatile bit RIDLE                @ ((unsigned)&U1STA)*8+4;
static volatile bit ADDEN                @ ((unsigned)&U1STA)*8+5;
static volatile bit TRMT                 @ ((unsigned)&U1STA)*8+8;
static volatile bit UTXBF                @ ((unsigned)&U1STA)*8+9;
static volatile bit UTXEN                @ ((unsigned)&U1STA)*8+10;
static volatile bit UTXBRK               @ ((unsigned)&U1STA)*8+11;
static volatile bit UTXISEL              @ ((unsigned)&U1STA)*8+15;
static volatile bit URXISEL0             @ ((unsigned)&U1STA)*8+6;
static volatile bit URXISEL1             @ ((unsigned)&U1STA)*8+7;

// Register: U1TXREG
static volatile unsigned int            U1TXREG             @ 0x210;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 7;
        volatile unsigned U1TXREG             : 9;
    };
    struct {
        volatile unsigned                     : 7;
        volatile unsigned UTXREG8             : 1;
        volatile unsigned UTXREG7             : 1;
        volatile unsigned UTXREG6             : 1;
        volatile unsigned UTXREG5             : 1;
        volatile unsigned UTXREG4             : 1;
        volatile unsigned UTXREG3             : 1;
        volatile unsigned UTXREG2             : 1;
        volatile unsigned UTXREG1             : 1;
        volatile unsigned UTXREG0             : 1;
    };
} U1TXREGbits @ 0x210;
// bit variable definitions
static volatile bit UTXREG0              @ ((unsigned)&U1TXREG)*8+0;
static volatile bit UTXREG1              @ ((unsigned)&U1TXREG)*8+1;
static volatile bit UTXREG2              @ ((unsigned)&U1TXREG)*8+2;
static volatile bit UTXREG3              @ ((unsigned)&U1TXREG)*8+3;
static volatile bit UTXREG4              @ ((unsigned)&U1TXREG)*8+4;
static volatile bit UTXREG5              @ ((unsigned)&U1TXREG)*8+5;
static volatile bit UTXREG6              @ ((unsigned)&U1TXREG)*8+6;
static volatile bit UTXREG7              @ ((unsigned)&U1TXREG)*8+7;
static volatile bit UTXREG8              @ ((unsigned)&U1TXREG)*8+8;

// Register: U1RXREG
static volatile unsigned int            U1RXREG             @ 0x212;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 7;
        volatile unsigned U1RXREG             : 9;
    };
    struct {
        volatile unsigned                     : 7;
        volatile unsigned URXREG8             : 1;
        volatile unsigned URXREG7             : 1;
        volatile unsigned URXREG6             : 1;
        volatile unsigned URXREG5             : 1;
        volatile unsigned URXREG4             : 1;
        volatile unsigned URXREG3             : 1;
        volatile unsigned URXREG2             : 1;
        volatile unsigned URXREG1             : 1;
        volatile unsigned URXREG0             : 1;
    };
} U1RXREGbits @ 0x212;
// bit variable definitions
static volatile bit URXREG0              @ ((unsigned)&U1RXREG)*8+0;
static volatile bit URXREG1              @ ((unsigned)&U1RXREG)*8+1;
static volatile bit URXREG2              @ ((unsigned)&U1RXREG)*8+2;
static volatile bit URXREG3              @ ((unsigned)&U1RXREG)*8+3;
static volatile bit URXREG4              @ ((unsigned)&U1RXREG)*8+4;
static volatile bit URXREG5              @ ((unsigned)&U1RXREG)*8+5;
static volatile bit URXREG6              @ ((unsigned)&U1RXREG)*8+6;
static volatile bit URXREG7              @ ((unsigned)&U1RXREG)*8+7;
static volatile bit URXREG8              @ ((unsigned)&U1RXREG)*8+8;

// Register: U1BRG
static volatile unsigned int            U1BRG               @ 0x214;

// Register: U2MODE
static volatile unsigned int            U2MODE              @ 0x216;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned UARTEN              : 1;
        volatile unsigned                     : 1;
        volatile unsigned USIDL               : 1;
        volatile unsigned                     : 5;
        volatile unsigned WAKE                : 1;
        volatile unsigned LPBACK              : 1;
        volatile unsigned ABAUD               : 1;
        volatile unsigned                     : 2;
        volatile unsigned PDSEL               : 2;
        volatile unsigned STSEL               : 1;
    };
    struct {
        volatile unsigned                     : 13;
        volatile unsigned PDSEL1              : 1;
        volatile unsigned PDSEL0              : 1;
        volatile unsigned                     : 1;
    };
} U2MODEbits @ 0x216;
// bit variable definitions
// duplicate bit in register U1MODE, definition disabled
// static volatile bit STSEL                @ ((unsigned)&U2MODE)*8+0;
// duplicate bit in register U1MODE, definition disabled
// static volatile bit ABAUD                @ ((unsigned)&U2MODE)*8+5;
// duplicate bit in register U1MODE, definition disabled
// static volatile bit LPBACK               @ ((unsigned)&U2MODE)*8+6;
// duplicate bit in register U1MODE, definition disabled
// static volatile bit WAKE                 @ ((unsigned)&U2MODE)*8+7;
// duplicate bit in register U1MODE, definition disabled
// static volatile bit USIDL                @ ((unsigned)&U2MODE)*8+13;
// duplicate bit in register U1MODE, definition disabled
// static volatile bit UARTEN               @ ((unsigned)&U2MODE)*8+15;
// duplicate bit in register U1MODE, definition disabled
// static volatile bit PDSEL0               @ ((unsigned)&U2MODE)*8+1;
// duplicate bit in register U1MODE, definition disabled
// static volatile bit PDSEL1               @ ((unsigned)&U2MODE)*8+2;

// Register: U2STA
static volatile unsigned int            U2STA               @ 0x218;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned UTXISEL             : 1;
        volatile unsigned                     : 3;
        volatile unsigned UTXBRK              : 1;
        volatile unsigned UTXEN               : 1;
        volatile unsigned UTXBF               : 1;
        volatile unsigned TRMT                : 1;
        volatile unsigned URXISEL             : 2;
        volatile unsigned ADDEN               : 1;
        volatile unsigned RIDLE               : 1;
        volatile unsigned PERR                : 1;
        volatile unsigned FERR                : 1;
        volatile unsigned OERR                : 1;
        volatile unsigned URXDA               : 1;
    };
    struct {
        volatile unsigned                     : 8;
        volatile unsigned URXISEL1            : 1;
        volatile unsigned URXISEL0            : 1;
        volatile unsigned                     : 6;
    };
} U2STAbits @ 0x218;
// bit variable definitions
// duplicate bit in register U1STA, definition disabled
// static volatile bit URXDA                @ ((unsigned)&U2STA)*8+0;
// duplicate bit in register U1STA, definition disabled
// static volatile bit OERR                 @ ((unsigned)&U2STA)*8+1;
// duplicate bit in register U1STA, definition disabled
// static volatile bit FERR                 @ ((unsigned)&U2STA)*8+2;
// duplicate bit in register U1STA, definition disabled
// static volatile bit PERR                 @ ((unsigned)&U2STA)*8+3;
// duplicate bit in register U1STA, definition disabled
// static volatile bit RIDLE                @ ((unsigned)&U2STA)*8+4;
// duplicate bit in register U1STA, definition disabled
// static volatile bit ADDEN                @ ((unsigned)&U2STA)*8+5;
// duplicate bit in register U1STA, definition disabled
// static volatile bit TRMT                 @ ((unsigned)&U2STA)*8+8;
// duplicate bit in register U1STA, definition disabled
// static volatile bit UTXBF                @ ((unsigned)&U2STA)*8+9;
// duplicate bit in register U1STA, definition disabled
// static volatile bit UTXEN                @ ((unsigned)&U2STA)*8+10;
// duplicate bit in register U1STA, definition disabled
// static volatile bit UTXBRK               @ ((unsigned)&U2STA)*8+11;
// duplicate bit in register U1STA, definition disabled
// static volatile bit UTXISEL              @ ((unsigned)&U2STA)*8+15;
// duplicate bit in register U1STA, definition disabled
// static volatile bit URXISEL0             @ ((unsigned)&U2STA)*8+6;
// duplicate bit in register U1STA, definition disabled
// static volatile bit URXISEL1             @ ((unsigned)&U2STA)*8+7;

// Register: U2TXREG
static volatile unsigned int            U2TXREG             @ 0x21A;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 7;
        volatile unsigned U2TXREG             : 9;
    };
    struct {
        volatile unsigned                     : 7;
        volatile unsigned UTXREG8             : 1;
        volatile unsigned UTXREG7             : 1;
        volatile unsigned UTXREG6             : 1;
        volatile unsigned UTXREG5             : 1;
        volatile unsigned UTXREG4             : 1;
        volatile unsigned UTXREG3             : 1;
        volatile unsigned UTXREG2             : 1;
        volatile unsigned UTXREG1             : 1;
        volatile unsigned UTXREG0             : 1;
    };
} U2TXREGbits @ 0x21A;
// bit variable definitions
// duplicate bit in register U1TXREG, definition disabled
// static volatile bit UTXREG0              @ ((unsigned)&U2TXREG)*8+0;
// duplicate bit in register U1TXREG, definition disabled
// static volatile bit UTXREG1              @ ((unsigned)&U2TXREG)*8+1;
// duplicate bit in register U1TXREG, definition disabled
// static volatile bit UTXREG2              @ ((unsigned)&U2TXREG)*8+2;
// duplicate bit in register U1TXREG, definition disabled
// static volatile bit UTXREG3              @ ((unsigned)&U2TXREG)*8+3;
// duplicate bit in register U1TXREG, definition disabled
// static volatile bit UTXREG4              @ ((unsigned)&U2TXREG)*8+4;
// duplicate bit in register U1TXREG, definition disabled
// static volatile bit UTXREG5              @ ((unsigned)&U2TXREG)*8+5;
// duplicate bit in register U1TXREG, definition disabled
// static volatile bit UTXREG6              @ ((unsigned)&U2TXREG)*8+6;
// duplicate bit in register U1TXREG, definition disabled
// static volatile bit UTXREG7              @ ((unsigned)&U2TXREG)*8+7;
// duplicate bit in register U1TXREG, definition disabled
// static volatile bit UTXREG8              @ ((unsigned)&U2TXREG)*8+8;

// Register: U2RXREG
static volatile unsigned int            U2RXREG             @ 0x21C;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 7;
        volatile unsigned U2RXREG             : 9;
    };
    struct {
        volatile unsigned                     : 7;
        volatile unsigned URXREG8             : 1;
        volatile unsigned URXREG7             : 1;
        volatile unsigned URXREG6             : 1;
        volatile unsigned URXREG5             : 1;
        volatile unsigned URXREG4             : 1;
        volatile unsigned URXREG3             : 1;
        volatile unsigned URXREG2             : 1;
        volatile unsigned URXREG1             : 1;
        volatile unsigned URXREG0             : 1;
    };
} U2RXREGbits @ 0x21C;
// bit variable definitions
// duplicate bit in register U1RXREG, definition disabled
// static volatile bit URXREG0              @ ((unsigned)&U2RXREG)*8+0;
// duplicate bit in register U1RXREG, definition disabled
// static volatile bit URXREG1              @ ((unsigned)&U2RXREG)*8+1;
// duplicate bit in register U1RXREG, definition disabled
// static volatile bit URXREG2              @ ((unsigned)&U2RXREG)*8+2;
// duplicate bit in register U1RXREG, definition disabled
// static volatile bit URXREG3              @ ((unsigned)&U2RXREG)*8+3;
// duplicate bit in register U1RXREG, definition disabled
// static volatile bit URXREG4              @ ((unsigned)&U2RXREG)*8+4;
// duplicate bit in register U1RXREG, definition disabled
// static volatile bit URXREG5              @ ((unsigned)&U2RXREG)*8+5;
// duplicate bit in register U1RXREG, definition disabled
// static volatile bit URXREG6              @ ((unsigned)&U2RXREG)*8+6;
// duplicate bit in register U1RXREG, definition disabled
// static volatile bit URXREG7              @ ((unsigned)&U2RXREG)*8+7;
// duplicate bit in register U1RXREG, definition disabled
// static volatile bit URXREG8              @ ((unsigned)&U2RXREG)*8+8;

// Register: U2BRG
static volatile unsigned int            U2BRG               @ 0x21E;

// Register: SPI1STAT
static volatile unsigned int            SPI1STAT            @ 0x220;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned SPIEN               : 1;
        volatile unsigned                     : 1;
        volatile unsigned SPISIDL             : 1;
        volatile unsigned                     : 6;
        volatile unsigned SPIROV              : 1;
        volatile unsigned                     : 4;
        volatile unsigned SPITBF              : 1;
        volatile unsigned SPIRBF              : 1;
    };
} SPI1STATbits @ 0x220;
// bit variable definitions
static volatile bit SPIRBF               @ ((unsigned)&SPI1STAT)*8+0;
static volatile bit SPITBF               @ ((unsigned)&SPI1STAT)*8+1;
static volatile bit SPIROV               @ ((unsigned)&SPI1STAT)*8+6;
static volatile bit SPISIDL              @ ((unsigned)&SPI1STAT)*8+13;
static volatile bit SPIEN                @ ((unsigned)&SPI1STAT)*8+15;

// Register: SPI1CON
static volatile unsigned int            SPI1CON             @ 0x222;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 1;
        volatile unsigned FRMEN               : 1;
        volatile unsigned SPIFSD              : 1;
        volatile unsigned                     : 1;
        volatile unsigned DISSDO              : 1;
        volatile unsigned MODE16              : 1;
        volatile unsigned SMP                 : 1;
        volatile unsigned CKE                 : 1;
        volatile unsigned SSEN                : 1;
        volatile unsigned CKP                 : 1;
        volatile unsigned MSTEN               : 1;
        volatile unsigned SPRE2               : 1;
        volatile unsigned SPRE1               : 1;
        volatile unsigned SPRE0               : 1;
        volatile unsigned PPRE1               : 1;
        volatile unsigned PPRE0               : 1;
    };
} SPI1CONbits @ 0x222;
