Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// bit variable definitions
static volatile bit PPRE0                @ ((unsigned)&SPI1CON)*8+0;
static volatile bit PPRE1                @ ((unsigned)&SPI1CON)*8+1;
static volatile bit SPRE0                @ ((unsigned)&SPI1CON)*8+2;
static volatile bit SPRE1                @ ((unsigned)&SPI1CON)*8+3;
static volatile bit SPRE2                @ ((unsigned)&SPI1CON)*8+4;
static volatile bit MSTEN                @ ((unsigned)&SPI1CON)*8+5;
static volatile bit CKP                  @ ((unsigned)&SPI1CON)*8+6;
static volatile bit SSEN                 @ ((unsigned)&SPI1CON)*8+7;
static volatile bit CKE                  @ ((unsigned)&SPI1CON)*8+8;
static volatile bit SMP                  @ ((unsigned)&SPI1CON)*8+9;
static volatile bit MODE16               @ ((unsigned)&SPI1CON)*8+10;
static volatile bit DISSDO               @ ((unsigned)&SPI1CON)*8+11;
static volatile bit SPIFSD               @ ((unsigned)&SPI1CON)*8+13;
static volatile bit FRMEN                @ ((unsigned)&SPI1CON)*8+14;

// Register: SPI1BUF
static volatile unsigned int            SPI1BUF             @ 0x224;

// Register: SPI2STAT
static volatile unsigned int            SPI2STAT            @ 0x226;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned SPIEN               : 1;
        volatile unsigned                     : 1;
        volatile unsigned SPISIDL             : 1;
        volatile unsigned                     : 6;
        volatile unsigned SPIROV              : 1;
        volatile unsigned                     : 4;
        volatile unsigned SPITBF              : 1;
        volatile unsigned SPIRBF              : 1;
    };
} SPI2STATbits @ 0x226;
// bit variable definitions
// duplicate bit in register SPI1STAT, definition disabled
// static volatile bit SPIRBF               @ ((unsigned)&SPI2STAT)*8+0;
// duplicate bit in register SPI1STAT, definition disabled
// static volatile bit SPITBF               @ ((unsigned)&SPI2STAT)*8+1;
// duplicate bit in register SPI1STAT, definition disabled
// static volatile bit SPIROV               @ ((unsigned)&SPI2STAT)*8+6;
// duplicate bit in register SPI1STAT, definition disabled
// static volatile bit SPISIDL              @ ((unsigned)&SPI2STAT)*8+13;
// duplicate bit in register SPI1STAT, definition disabled
// static volatile bit SPIEN                @ ((unsigned)&SPI2STAT)*8+15;

// Register: SPI2CON
static volatile unsigned int            SPI2CON             @ 0x228;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 1;
        volatile unsigned FRMEN               : 1;
        volatile unsigned SPIFSD              : 1;
        volatile unsigned                     : 1;
        volatile unsigned DISSDO              : 1;
        volatile unsigned MODE16              : 1;
        volatile unsigned SMP                 : 1;
        volatile unsigned CKE                 : 1;
        volatile unsigned SSEN                : 1;
        volatile unsigned CKP                 : 1;
        volatile unsigned MSTEN               : 1;
        volatile unsigned SPRE2               : 1;
        volatile unsigned SPRE1               : 1;
        volatile unsigned SPRE0               : 1;
        volatile unsigned PPRE1               : 1;
        volatile unsigned PPRE0               : 1;
    };
} SPI2CONbits @ 0x228;
// bit variable definitions
// duplicate bit in register SPI1CON, definition disabled
// static volatile bit PPRE0                @ ((unsigned)&SPI2CON)*8+0;
// duplicate bit in register SPI1CON, definition disabled
// static volatile bit PPRE1                @ ((unsigned)&SPI2CON)*8+1;
// duplicate bit in register SPI1CON, definition disabled
// static volatile bit SPRE0                @ ((unsigned)&SPI2CON)*8+2;
// duplicate bit in register SPI1CON, definition disabled
// static volatile bit SPRE1                @ ((unsigned)&SPI2CON)*8+3;
// duplicate bit in register SPI1CON, definition disabled
// static volatile bit SPRE2                @ ((unsigned)&SPI2CON)*8+4;
// duplicate bit in register SPI1CON, definition disabled
// static volatile bit MSTEN                @ ((unsigned)&SPI2CON)*8+5;
// duplicate bit in register SPI1CON, definition disabled
// static volatile bit CKP                  @ ((unsigned)&SPI2CON)*8+6;
// duplicate bit in register SPI1CON, definition disabled
// static volatile bit SSEN                 @ ((unsigned)&SPI2CON)*8+7;
// duplicate bit in register SPI1CON, definition disabled
// static volatile bit CKE                  @ ((unsigned)&SPI2CON)*8+8;
// duplicate bit in register SPI1CON, definition disabled
// static volatile bit SMP                  @ ((unsigned)&SPI2CON)*8+9;
// duplicate bit in register SPI1CON, definition disabled
// static volatile bit MODE16               @ ((unsigned)&SPI2CON)*8+10;
// duplicate bit in register SPI1CON, definition disabled
// static volatile bit DISSDO               @ ((unsigned)&SPI2CON)*8+11;
// duplicate bit in register SPI1CON, definition disabled
// static volatile bit SPIFSD               @ ((unsigned)&SPI2CON)*8+13;
// duplicate bit in register SPI1CON, definition disabled
// static volatile bit FRMEN                @ ((unsigned)&SPI2CON)*8+14;

// Register: SPI2BUF
static volatile unsigned int            SPI2BUF             @ 0x22A;

// Register: ADCBUF0
static volatile unsigned int            ADCBUF0             @ 0x280;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 6;
        volatile unsigned ADCBUF0             : 10;
    };
} ADCBUF0bits @ 0x280;

// Register: ADCBUF1
static volatile unsigned int            ADCBUF1             @ 0x282;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 6;
        volatile unsigned ADCBUF1             : 10;
    };
} ADCBUF1bits @ 0x282;

// Register: ADCBUF2
static volatile unsigned int            ADCBUF2             @ 0x284;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 6;
        volatile unsigned ADCBUF2             : 10;
    };
} ADCBUF2bits @ 0x284;

