Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: ADCBUF3
static volatile unsigned int            ADCBUF3             @ 0x286;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 6;
        volatile unsigned ADCBUF3             : 10;
    };
} ADCBUF3bits @ 0x286;

// Register: ADCBUF4
static volatile unsigned int            ADCBUF4             @ 0x288;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 6;
        volatile unsigned ADCBUF4             : 10;
    };
} ADCBUF4bits @ 0x288;

// Register: ADCBUF5
static volatile unsigned int            ADCBUF5             @ 0x28A;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 6;
        volatile unsigned ADCBUF5             : 10;
    };
} ADCBUF5bits @ 0x28A;

// Register: ADCBUF6
static volatile unsigned int            ADCBUF6             @ 0x28C;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 6;
        volatile unsigned ADCBUF6             : 10;
    };
} ADCBUF6bits @ 0x28C;

// Register: ADCBUF7
static volatile unsigned int            ADCBUF7             @ 0x28E;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 6;
        volatile unsigned ADCBUF7             : 10;
    };
} ADCBUF7bits @ 0x28E;

// Register: ADCBUF8
static volatile unsigned int            ADCBUF8             @ 0x290;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 6;
        volatile unsigned ADCBUF8             : 10;
    };
} ADCBUF8bits @ 0x290;

// Register: ADCBUF9
static volatile unsigned int            ADCBUF9             @ 0x292;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 6;
        volatile unsigned ADCBUF9             : 10;
    };
} ADCBUF9bits @ 0x292;

// Register: ADCBUFA
static volatile unsigned int            ADCBUFA             @ 0x294;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 6;
        volatile unsigned ADCBUFA             : 10;
    };
} ADCBUFAbits @ 0x294;

// Register: ADCBUFB
static volatile unsigned int            ADCBUFB             @ 0x296;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 6;
        volatile unsigned ADCBUFB             : 10;
    };
} ADCBUFBbits @ 0x296;

// Register: ADCBUFC
static volatile unsigned int            ADCBUFC             @ 0x298;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 6;
        volatile unsigned ADCBUFC             : 10;
    };
} ADCBUFCbits @ 0x298;

// Register: ADCBUFD
static volatile unsigned int            ADCBUFD             @ 0x29A;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 6;
        volatile unsigned ADCBUFD             : 10;
    };
} ADCBUFDbits @ 0x29A;

// Register: ADCBUFE
static volatile unsigned int            ADCBUFE             @ 0x29C;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 6;
        volatile unsigned ADCBUFE             : 10;
    };
} ADCBUFEbits @ 0x29C;

// Register: ADCBUFF
static volatile unsigned int            ADCBUFF             @ 0x29E;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 6;
        volatile unsigned ADCBUFF             : 10;
    };
} ADCBUFFbits @ 0x29E;

// Register: ADCON1
static volatile unsigned int            ADCON1              @ 0x2A0;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned ADON                : 1;
        volatile unsigned                     : 1;
        volatile unsigned ADSIDL              : 1;
        volatile unsigned                     : 3;
        volatile unsigned FORM                : 2;
        volatile unsigned SSRC                : 3;
        volatile unsigned                     : 1;
        volatile unsigned SIMSAM              : 1;
        volatile unsigned ASAM                : 1;
        volatile unsigned SAMP                : 1;
        volatile unsigned DONE                : 1;
    };
    struct {
        volatile unsigned                     : 6;
        volatile unsigned FORM1               : 1;
        volatile unsigned FORM0               : 1;
        volatile unsigned SSRC2               : 1;
        volatile unsigned SSRC1               : 1;
        volatile unsigned SSRC0               : 1;
        volatile unsigned                     : 5;
    };
} ADCON1bits @ 0x2A0;
// bit variable definitions
static volatile bit DONE                 @ ((unsigned)&ADCON1)*8+0;
static volatile bit SAMP                 @ ((unsigned)&ADCON1)*8+1;
static volatile bit ASAM                 @ ((unsigned)&ADCON1)*8+2;
static volatile bit SIMSAM               @ ((unsigned)&ADCON1)*8+3;
static volatile bit ADSIDL               @ ((unsigned)&ADCON1)*8+13;
static volatile bit ADON                 @ ((unsigned)&ADCON1)*8+15;
static volatile bit SSRC0                @ ((unsigned)&ADCON1)*8+5;
static volatile bit SSRC1                @ ((unsigned)&ADCON1)*8+6;
static volatile bit SSRC2                @ ((unsigned)&ADCON1)*8+7;
static volatile bit FORM0                @ ((unsigned)&ADCON1)*8+8;
static volatile bit FORM1                @ ((unsigned)&ADCON1)*8+9;

// Register: ADCON2
static volatile unsigned int            ADCON2              @ 0x2A2;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned VCFG                : 3;
        volatile unsigned OFFCAL              : 1;
        volatile unsigned                     : 1;
        volatile unsigned CSCNA               : 1;
        volatile unsigned CHPS                : 2;
        volatile unsigned BUFS                : 1;
        volatile unsigned                     : 1;
        volatile unsigned SMPI                : 4;
        volatile unsigned BUFM                : 1;
        volatile unsigned ALTS                : 1;
    };
    struct {
        volatile unsigned VCFG2               : 1;
        volatile unsigned VCFG1               : 1;
        volatile unsigned VCFG0               : 1;
        volatile unsigned                     : 3;
        volatile unsigned CHPS1               : 1;
        volatile unsigned CHPS0               : 1;
        volatile unsigned                     : 2;
        volatile unsigned SMPI3               : 1;
        volatile unsigned SMPI2               : 1;
        volatile unsigned SMPI1               : 1;
        volatile unsigned SMPI0               : 1;
        volatile unsigned                     : 2;
    };
} ADCON2bits @ 0x2A2;
// bit variable definitions
static volatile bit ALTS                 @ ((unsigned)&ADCON2)*8+0;
static volatile bit BUFM                 @ ((unsigned)&ADCON2)*8+1;
static volatile bit BUFS                 @ ((unsigned)&ADCON2)*8+7;
static volatile bit CSCNA                @ ((unsigned)&ADCON2)*8+10;
static volatile bit OFFCAL               @ ((unsigned)&ADCON2)*8+12;
static volatile bit SMPI0                @ ((unsigned)&ADCON2)*8+2;
static volatile bit SMPI1                @ ((unsigned)&ADCON2)*8+3;
static volatile bit SMPI2                @ ((unsigned)&ADCON2)*8+4;
static volatile bit SMPI3                @ ((unsigned)&ADCON2)*8+5;
static volatile bit CHPS0                @ ((unsigned)&ADCON2)*8+8;
static volatile bit CHPS1                @ ((unsigned)&ADCON2)*8+9;
static volatile bit VCFG0                @ ((unsigned)&ADCON2)*8+13;
static volatile bit VCFG1                @ ((unsigned)&ADCON2)*8+14;
static volatile bit VCFG2                @ ((unsigned)&ADCON2)*8+15;

// Register: ADCON3
static volatile unsigned int            ADCON3              @ 0x2A4;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 3;
        volatile unsigned SAMC                : 5;
        volatile unsigned ADRC                : 1;
        volatile unsigned                     : 1;
        volatile unsigned ADCS                : 6;
    };
    struct {
        volatile unsigned                     : 2;
        volatile unsigned                     : 1;
        volatile unsigned SAMC4               : 1;
        volatile unsigned SAMC3               : 1;
        volatile unsigned SAMC2               : 1;
        volatile unsigned SAMC1               : 1;
        volatile unsigned SAMC0               : 1;
        volatile unsigned                     : 2;
        volatile unsigned ADCS5               : 1;
        volatile unsigned ADCS4               : 1;
        volatile unsigned ADCS3               : 1;
        volatile unsigned ADCS2               : 1;
        volatile unsigned ADCS1               : 1;
        volatile unsigned ADCS0               : 1;
    };
} ADCON3bits @ 0x2A4;
// bit variable definitions
static volatile bit ADRC                 @ ((unsigned)&ADCON3)*8+7;
static volatile bit ADCS0                @ ((unsigned)&ADCON3)*8+0;
static volatile bit ADCS1                @ ((unsigned)&ADCON3)*8+1;
static volatile bit ADCS2                @ ((unsigned)&ADCON3)*8+2;
static volatile bit ADCS3                @ ((unsigned)&ADCON3)*8+3;
static volatile bit ADCS4                @ ((unsigned)&ADCON3)*8+4;
static volatile bit ADCS5                @ ((unsigned)&ADCON3)*8+5;
static volatile bit SAMC0                @ ((unsigned)&ADCON3)*8+8;
static volatile bit SAMC1                @ ((unsigned)&ADCON3)*8+9;
static volatile bit SAMC2                @ ((unsigned)&ADCON3)*8+10;
static volatile bit SAMC3                @ ((unsigned)&ADCON3)*8+11;
static volatile bit SAMC4                @ ((unsigned)&ADCON3)*8+12;

// Register: ADCHS
static volatile unsigned int            ADCHS               @ 0x2A6;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned CH123NB             : 2;
        volatile unsigned CH123SB             : 1;
        volatile unsigned CH0NB               : 1;
        volatile unsigned CH0SB               : 4;
        volatile unsigned CH123NA             : 2;
        volatile unsigned CH123SA             : 1;
        volatile unsigned CH0NA               : 1;
        volatile unsigned CH0SA               : 4;
    };
    struct {
        volatile unsigned CH123NB1            : 1;
        volatile unsigned CH123NB0            : 1;
        volatile unsigned                     : 2;
        volatile unsigned CH0SB3              : 1;
        volatile unsigned CH0SB2              : 1;
        volatile unsigned CH0SB1              : 1;
        volatile unsigned CH0SB0              : 1;
        volatile unsigned CH123NA1            : 1;
        volatile unsigned CH123NA0            : 1;
        volatile unsigned                     : 2;
        volatile unsigned CH0SA3              : 1;
        volatile unsigned CH0SA2              : 1;
        volatile unsigned CH0SA1              : 1;
        volatile unsigned CH0SA0              : 1;
    };
} ADCHSbits @ 0x2A6;
// bit variable definitions
static volatile bit CH0NA                @ ((unsigned)&ADCHS)*8+4;
static volatile bit CH123SA              @ ((unsigned)&ADCHS)*8+5;
static volatile bit CH0NB                @ ((unsigned)&ADCHS)*8+12;
static volatile bit CH123SB              @ ((unsigned)&ADCHS)*8+13;
static volatile bit CH0SA0               @ ((unsigned)&ADCHS)*8+0;
static volatile bit CH0SA1               @ ((unsigned)&ADCHS)*8+1;
static volatile bit CH0SA2               @ ((unsigned)&ADCHS)*8+2;
static volatile bit CH0SA3               @ ((unsigned)&ADCHS)*8+3;
static volatile bit CH123NA0             @ ((unsigned)&ADCHS)*8+6;
static volatile bit CH123NA1             @ ((unsigned)&ADCHS)*8+7;
static volatile bit CH0SB0               @ ((unsigned)&ADCHS)*8+8;
static volatile bit CH0SB1               @ ((unsigned)&ADCHS)*8+9;
static volatile bit CH0SB2               @ ((unsigned)&ADCHS)*8+10;
static volatile bit CH0SB3               @ ((unsigned)&ADCHS)*8+11;
static volatile bit CH123NB0             @ ((unsigned)&ADCHS)*8+14;
static volatile bit CH123NB1             @ ((unsigned)&ADCHS)*8+15;

// Register: ADPCFG
static volatile unsigned int            ADPCFG              @ 0x2A8;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned PCFG15              : 1;
        volatile unsigned PCFG14              : 1;
        volatile unsigned PCFG13              : 1;
        volatile unsigned PCFG12              : 1;
        volatile unsigned PCFG11              : 1;
        volatile unsigned PCFG10              : 1;
        volatile unsigned PCFG9               : 1;
        volatile unsigned PCFG8               : 1;
        volatile unsigned PCFG7               : 1;
        volatile unsigned PCFG6               : 1;
        volatile unsigned PCFG5               : 1;
        volatile unsigned PCFG4               : 1;
        volatile unsigned PCFG3               : 1;
        volatile unsigned PCFG2               : 1;
        volatile unsigned PCFG1               : 1;
        volatile unsigned PCFG0               : 1;
    };
} ADPCFGbits @ 0x2A8;
// bit variable definitions
static volatile bit PCFG0                @ ((unsigned)&ADPCFG)*8+0;
static volatile bit PCFG1                @ ((unsigned)&ADPCFG)*8+1;
static volatile bit PCFG2                @ ((unsigned)&ADPCFG)*8+2;
static volatile bit PCFG3                @ ((unsigned)&ADPCFG)*8+3;
static volatile bit PCFG4                @ ((unsigned)&ADPCFG)*8+4;
static volatile bit PCFG5                @ ((unsigned)&ADPCFG)*8+5;
static volatile bit PCFG6                @ ((unsigned)&ADPCFG)*8+6;
static volatile bit PCFG7                @ ((unsigned)&ADPCFG)*8+7;
static volatile bit PCFG8                @ ((unsigned)&ADPCFG)*8+8;
static volatile bit PCFG9                @ ((unsigned)&ADPCFG)*8+9;
static volatile bit PCFG10               @ ((unsigned)&ADPCFG)*8+10;
static volatile bit PCFG11               @ ((unsigned)&ADPCFG)*8+11;
static volatile bit PCFG12               @ ((unsigned)&ADPCFG)*8+12;
static volatile bit PCFG13               @ ((unsigned)&ADPCFG)*8+13;
static volatile bit PCFG14               @ ((unsigned)&ADPCFG)*8+14;
static volatile bit PCFG15               @ ((unsigned)&ADPCFG)*8+15;

// Register: ADCSSL
static volatile unsigned int            ADCSSL              @ 0x2AA;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned CSSL15              : 1;
        volatile unsigned CSSL14              : 1;
        volatile unsigned CSSL13              : 1;
        volatile unsigned CSSL12              : 1;
        volatile unsigned CSSL11              : 1;
        volatile unsigned CSSL10              : 1;
        volatile unsigned CSSL9               : 1;
        volatile unsigned CSSL8               : 1;
        volatile unsigned CSSL7               : 1;
        volatile unsigned CSSL6               : 1;
        volatile unsigned CSSL5               : 1;
        volatile unsigned CSSL4               : 1;
        volatile unsigned CSSL3               : 1;
        volatile unsigned CSSL2               : 1;
        volatile unsigned CSSL1               : 1;
        volatile unsigned CSSL0               : 1;
    };
} ADCSSLbits @ 0x2AA;
// bit variable definitions
static volatile bit CSSL0                @ ((unsigned)&ADCSSL)*8+0;
static volatile bit CSSL1                @ ((unsigned)&ADCSSL)*8+1;
static volatile bit CSSL2                @ ((unsigned)&ADCSSL)*8+2;
static volatile bit CSSL3                @ ((unsigned)&ADCSSL)*8+3;
static volatile bit CSSL4                @ ((unsigned)&ADCSSL)*8+4;
static volatile bit CSSL5                @ ((unsigned)&ADCSSL)*8+5;
static volatile bit CSSL6                @ ((unsigned)&ADCSSL)*8+6;
static volatile bit CSSL7                @ ((unsigned)&ADCSSL)*8+7;
static volatile bit CSSL8                @ ((unsigned)&ADCSSL)*8+8;
static volatile bit CSSL9                @ ((unsigned)&ADCSSL)*8+9;
static volatile bit CSSL10               @ ((unsigned)&ADCSSL)*8+10;
static volatile bit CSSL11               @ ((unsigned)&ADCSSL)*8+11;
static volatile bit CSSL12               @ ((unsigned)&ADCSSL)*8+12;
static volatile bit CSSL13               @ ((unsigned)&ADCSSL)*8+13;
static volatile bit CSSL14               @ ((unsigned)&ADCSSL)*8+14;
static volatile bit CSSL15               @ ((unsigned)&ADCSSL)*8+15;

// Register: TRISA
static volatile unsigned int            TRISA               @ 0x2C0;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TRISA15             : 1;
        volatile unsigned TRISA14             : 1;
        volatile unsigned                     : 3;
        volatile unsigned TRISA10             : 1;
        volatile unsigned TRISA9              : 1;
        volatile unsigned                     : 9;
    };
} TRISAbits @ 0x2C0;
// bit variable definitions
static volatile bit TRISA9               @ ((unsigned)&TRISA)*8+9;
static volatile bit TRISA10              @ ((unsigned)&TRISA)*8+10;
static volatile bit TRISA14              @ ((unsigned)&TRISA)*8+14;
static volatile bit TRISA15              @ ((unsigned)&TRISA)*8+15;

// Register: PORTA
static volatile unsigned int            PORTA               @ 0x2C2;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned RA15                : 1;
        volatile unsigned RA14                : 1;
        volatile unsigned                     : 3;
        volatile unsigned RA10                : 1;
        volatile unsigned RA9                 : 1;
        volatile unsigned                     : 9;
    };
} PORTAbits @ 0x2C2;
// bit variable definitions
static volatile bit RA9                  @ ((unsigned)&PORTA)*8+9;
static volatile bit RA10                 @ ((unsigned)&PORTA)*8+10;
static volatile bit RA14                 @ ((unsigned)&PORTA)*8+14;
static volatile bit RA15                 @ ((unsigned)&PORTA)*8+15;

