Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: LATA
static volatile unsigned int            LATA                @ 0x2C4;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned LATA15              : 1;
        volatile unsigned LATA14              : 1;
        volatile unsigned                     : 3;
        volatile unsigned LATA10              : 1;
        volatile unsigned LATA9               : 1;
        volatile unsigned                     : 9;
    };
} LATAbits @ 0x2C4;
// bit variable definitions
static volatile bit LATA9                @ ((unsigned)&LATA)*8+9;
static volatile bit LATA10               @ ((unsigned)&LATA)*8+10;
static volatile bit LATA14               @ ((unsigned)&LATA)*8+14;
static volatile bit LATA15               @ ((unsigned)&LATA)*8+15;

// Register: TRISB
static volatile unsigned int            TRISB               @ 0x2C6;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TRISB15             : 1;
        volatile unsigned TRISB14             : 1;
        volatile unsigned TRISB13             : 1;
        volatile unsigned TRISB12             : 1;
        volatile unsigned TRISB11             : 1;
        volatile unsigned TRISB10             : 1;
        volatile unsigned TRISB9              : 1;
        volatile unsigned TRISB8              : 1;
        volatile unsigned TRISB7              : 1;
        volatile unsigned TRISB6              : 1;
        volatile unsigned TRISB5              : 1;
        volatile unsigned TRISB4              : 1;
        volatile unsigned TRISB3              : 1;
        volatile unsigned TRISB2              : 1;
        volatile unsigned TRISB1              : 1;
        volatile unsigned TRISB0              : 1;
    };
} TRISBbits @ 0x2C6;
// bit variable definitions
static volatile bit TRISB0               @ ((unsigned)&TRISB)*8+0;
static volatile bit TRISB1               @ ((unsigned)&TRISB)*8+1;
static volatile bit TRISB2               @ ((unsigned)&TRISB)*8+2;
static volatile bit TRISB3               @ ((unsigned)&TRISB)*8+3;
static volatile bit TRISB4               @ ((unsigned)&TRISB)*8+4;
static volatile bit TRISB5               @ ((unsigned)&TRISB)*8+5;
static volatile bit TRISB6               @ ((unsigned)&TRISB)*8+6;
static volatile bit TRISB7               @ ((unsigned)&TRISB)*8+7;
static volatile bit TRISB8               @ ((unsigned)&TRISB)*8+8;
static volatile bit TRISB9               @ ((unsigned)&TRISB)*8+9;
static volatile bit TRISB10              @ ((unsigned)&TRISB)*8+10;
static volatile bit TRISB11              @ ((unsigned)&TRISB)*8+11;
static volatile bit TRISB12              @ ((unsigned)&TRISB)*8+12;
static volatile bit TRISB13              @ ((unsigned)&TRISB)*8+13;
static volatile bit TRISB14              @ ((unsigned)&TRISB)*8+14;
static volatile bit TRISB15              @ ((unsigned)&TRISB)*8+15;

// Register: PORTB
static volatile unsigned int            PORTB               @ 0x2C8;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned RB15                : 1;
        volatile unsigned RB14                : 1;
        volatile unsigned RB13                : 1;
        volatile unsigned RB12                : 1;
        volatile unsigned RB11                : 1;
        volatile unsigned RB10                : 1;
        volatile unsigned RB9                 : 1;
        volatile unsigned RB8                 : 1;
        volatile unsigned RB7                 : 1;
        volatile unsigned RB6                 : 1;
        volatile unsigned RB5                 : 1;
        volatile unsigned RB4                 : 1;
        volatile unsigned RB3                 : 1;
        volatile unsigned RB2                 : 1;
        volatile unsigned RB1                 : 1;
        volatile unsigned RB0                 : 1;
    };
} PORTBbits @ 0x2C8;
// bit variable definitions
static volatile bit RB0                  @ ((unsigned)&PORTB)*8+0;
static volatile bit RB1                  @ ((unsigned)&PORTB)*8+1;
static volatile bit RB2                  @ ((unsigned)&PORTB)*8+2;
static volatile bit RB3                  @ ((unsigned)&PORTB)*8+3;
static volatile bit RB4                  @ ((unsigned)&PORTB)*8+4;
static volatile bit RB5                  @ ((unsigned)&PORTB)*8+5;
static volatile bit RB6                  @ ((unsigned)&PORTB)*8+6;
static volatile bit RB7                  @ ((unsigned)&PORTB)*8+7;
static volatile bit RB8                  @ ((unsigned)&PORTB)*8+8;
static volatile bit RB9                  @ ((unsigned)&PORTB)*8+9;
static volatile bit RB10                 @ ((unsigned)&PORTB)*8+10;
static volatile bit RB11                 @ ((unsigned)&PORTB)*8+11;
static volatile bit RB12                 @ ((unsigned)&PORTB)*8+12;
static volatile bit RB13                 @ ((unsigned)&PORTB)*8+13;
static volatile bit RB14                 @ ((unsigned)&PORTB)*8+14;
static volatile bit RB15                 @ ((unsigned)&PORTB)*8+15;

// Register: LATB
static volatile unsigned int            LATB                @ 0x2CA;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned LATB15              : 1;
        volatile unsigned LATB14              : 1;
        volatile unsigned LATB13              : 1;
        volatile unsigned LATB12              : 1;
        volatile unsigned LATB11              : 1;
        volatile unsigned LATB10              : 1;
        volatile unsigned LATB9               : 1;
        volatile unsigned LATB8               : 1;
        volatile unsigned LATB7               : 1;
        volatile unsigned LATB6               : 1;
        volatile unsigned LATB5               : 1;
        volatile unsigned LATB4               : 1;
        volatile unsigned LATB3               : 1;
        volatile unsigned LATB2               : 1;
        volatile unsigned LATB1               : 1;
        volatile unsigned LATB0               : 1;
    };
} LATBbits @ 0x2CA;
// bit variable definitions
static volatile bit LATB0                @ ((unsigned)&LATB)*8+0;
static volatile bit LATB1                @ ((unsigned)&LATB)*8+1;
static volatile bit LATB2                @ ((unsigned)&LATB)*8+2;
static volatile bit LATB3                @ ((unsigned)&LATB)*8+3;
static volatile bit LATB4                @ ((unsigned)&LATB)*8+4;
static volatile bit LATB5                @ ((unsigned)&LATB)*8+5;
static volatile bit LATB6                @ ((unsigned)&LATB)*8+6;
static volatile bit LATB7                @ ((unsigned)&LATB)*8+7;
static volatile bit LATB8                @ ((unsigned)&LATB)*8+8;
static volatile bit LATB9                @ ((unsigned)&LATB)*8+9;
static volatile bit LATB10               @ ((unsigned)&LATB)*8+10;
static volatile bit LATB11               @ ((unsigned)&LATB)*8+11;
static volatile bit LATB12               @ ((unsigned)&LATB)*8+12;
static volatile bit LATB13               @ ((unsigned)&LATB)*8+13;
static volatile bit LATB14               @ ((unsigned)&LATB)*8+14;
static volatile bit LATB15               @ ((unsigned)&LATB)*8+15;

// Register: TRISC
static volatile unsigned int            TRISC               @ 0x2CC;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TRISC15             : 1;
        volatile unsigned TRISC14             : 1;
        volatile unsigned TRISC13             : 1;
        volatile unsigned                     : 9;
        volatile unsigned TRISC3              : 1;
        volatile unsigned                     : 1;
        volatile unsigned TRISC1              : 1;
        volatile unsigned                     : 1;
    };
} TRISCbits @ 0x2CC;
// bit variable definitions
static volatile bit TRISC1               @ ((unsigned)&TRISC)*8+1;
static volatile bit TRISC3               @ ((unsigned)&TRISC)*8+3;
static volatile bit TRISC13              @ ((unsigned)&TRISC)*8+13;
static volatile bit TRISC14              @ ((unsigned)&TRISC)*8+14;
static volatile bit TRISC15              @ ((unsigned)&TRISC)*8+15;

// Register: PORTC
static volatile unsigned int            PORTC               @ 0x2CE;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned RC15                : 1;
        volatile unsigned RC14                : 1;
        volatile unsigned RC13                : 1;
        volatile unsigned                     : 9;
        volatile unsigned RC3                 : 1;
        volatile unsigned                     : 1;
        volatile unsigned RC1                 : 1;
        volatile unsigned                     : 1;
    };
} PORTCbits @ 0x2CE;
// bit variable definitions
static volatile bit RC1                  @ ((unsigned)&PORTC)*8+1;
static volatile bit RC3                  @ ((unsigned)&PORTC)*8+3;
static volatile bit RC13                 @ ((unsigned)&PORTC)*8+13;
static volatile bit RC14                 @ ((unsigned)&PORTC)*8+14;
static volatile bit RC15                 @ ((unsigned)&PORTC)*8+15;

