Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: LATC
static volatile unsigned int            LATC                @ 0x2D0;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned LATC15              : 1;
        volatile unsigned LATC14              : 1;
        volatile unsigned LATC13              : 1;
        volatile unsigned                     : 9;
        volatile unsigned LATC3               : 1;
        volatile unsigned                     : 1;
        volatile unsigned LATC1               : 1;
        volatile unsigned                     : 1;
    };
} LATCbits @ 0x2D0;
// bit variable definitions
static volatile bit LATC1                @ ((unsigned)&LATC)*8+1;
static volatile bit LATC3                @ ((unsigned)&LATC)*8+3;
static volatile bit LATC13               @ ((unsigned)&LATC)*8+13;
static volatile bit LATC14               @ ((unsigned)&LATC)*8+14;
static volatile bit LATC15               @ ((unsigned)&LATC)*8+15;

// Register: TRISD
static volatile unsigned int            TRISD               @ 0x2D2;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TRISD15             : 1;
        volatile unsigned TRISD14             : 1;
        volatile unsigned TRISD13             : 1;
        volatile unsigned TRISD12             : 1;
        volatile unsigned TRISD11             : 1;
        volatile unsigned TRISD10             : 1;
        volatile unsigned TRISD9              : 1;
        volatile unsigned TRISD8              : 1;
        volatile unsigned TRISD7              : 1;
        volatile unsigned TRISD6              : 1;
        volatile unsigned TRISD5              : 1;
        volatile unsigned TRISD4              : 1;
        volatile unsigned TRISD3              : 1;
        volatile unsigned TRISD2              : 1;
        volatile unsigned TRISD1              : 1;
        volatile unsigned TRISD0              : 1;
    };
} TRISDbits @ 0x2D2;
// bit variable definitions
static volatile bit TRISD0               @ ((unsigned)&TRISD)*8+0;
static volatile bit TRISD1               @ ((unsigned)&TRISD)*8+1;
static volatile bit TRISD2               @ ((unsigned)&TRISD)*8+2;
static volatile bit TRISD3               @ ((unsigned)&TRISD)*8+3;
static volatile bit TRISD4               @ ((unsigned)&TRISD)*8+4;
static volatile bit TRISD5               @ ((unsigned)&TRISD)*8+5;
static volatile bit TRISD6               @ ((unsigned)&TRISD)*8+6;
static volatile bit TRISD7               @ ((unsigned)&TRISD)*8+7;
static volatile bit TRISD8               @ ((unsigned)&TRISD)*8+8;
static volatile bit TRISD9               @ ((unsigned)&TRISD)*8+9;
static volatile bit TRISD10              @ ((unsigned)&TRISD)*8+10;
static volatile bit TRISD11              @ ((unsigned)&TRISD)*8+11;
static volatile bit TRISD12              @ ((unsigned)&TRISD)*8+12;
static volatile bit TRISD13              @ ((unsigned)&TRISD)*8+13;
static volatile bit TRISD14              @ ((unsigned)&TRISD)*8+14;
static volatile bit TRISD15              @ ((unsigned)&TRISD)*8+15;

// Register: PORTD
static volatile unsigned int            PORTD               @ 0x2D4;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned RD15                : 1;
        volatile unsigned RD14                : 1;
        volatile unsigned RD13                : 1;
        volatile unsigned RD12                : 1;
        volatile unsigned RD11                : 1;
        volatile unsigned RD10                : 1;
        volatile unsigned RD9                 : 1;
        volatile unsigned RD8                 : 1;
        volatile unsigned RD7                 : 1;
        volatile unsigned RD6                 : 1;
        volatile unsigned RD5                 : 1;
        volatile unsigned RD4                 : 1;
        volatile unsigned RD3                 : 1;
        volatile unsigned RD2                 : 1;
        volatile unsigned RD1                 : 1;
        volatile unsigned RD0                 : 1;
    };
} PORTDbits @ 0x2D4;
// bit variable definitions
static volatile bit RD0                  @ ((unsigned)&PORTD)*8+0;
static volatile bit RD1                  @ ((unsigned)&PORTD)*8+1;
static volatile bit RD2                  @ ((unsigned)&PORTD)*8+2;
static volatile bit RD3                  @ ((unsigned)&PORTD)*8+3;
static volatile bit RD4                  @ ((unsigned)&PORTD)*8+4;
static volatile bit RD5                  @ ((unsigned)&PORTD)*8+5;
static volatile bit RD6                  @ ((unsigned)&PORTD)*8+6;
static volatile bit RD7                  @ ((unsigned)&PORTD)*8+7;
static volatile bit RD8                  @ ((unsigned)&PORTD)*8+8;
static volatile bit RD9                  @ ((unsigned)&PORTD)*8+9;
static volatile bit RD10                 @ ((unsigned)&PORTD)*8+10;
static volatile bit RD11                 @ ((unsigned)&PORTD)*8+11;
static volatile bit RD12                 @ ((unsigned)&PORTD)*8+12;
static volatile bit RD13                 @ ((unsigned)&PORTD)*8+13;
static volatile bit RD14                 @ ((unsigned)&PORTD)*8+14;
static volatile bit RD15                 @ ((unsigned)&PORTD)*8+15;

// Register: LATD
static volatile unsigned int            LATD                @ 0x2D6;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned LATD15              : 1;
        volatile unsigned LATD14              : 1;
        volatile unsigned LATD13              : 1;
        volatile unsigned LATD12              : 1;
        volatile unsigned LATD11              : 1;
        volatile unsigned LATD10              : 1;
        volatile unsigned LATD9               : 1;
        volatile unsigned LATD8               : 1;
        volatile unsigned LATD7               : 1;
        volatile unsigned LATD6               : 1;
        volatile unsigned LATD5               : 1;
        volatile unsigned LATD4               : 1;
        volatile unsigned LATD3               : 1;
        volatile unsigned LATD2               : 1;
        volatile unsigned LATD1               : 1;
        volatile unsigned LATD0               : 1;
    };
} LATDbits @ 0x2D6;
// bit variable definitions
static volatile bit LATD0                @ ((unsigned)&LATD)*8+0;
static volatile bit LATD1                @ ((unsigned)&LATD)*8+1;
static volatile bit LATD2                @ ((unsigned)&LATD)*8+2;
static volatile bit LATD3                @ ((unsigned)&LATD)*8+3;
static volatile bit LATD4                @ ((unsigned)&LATD)*8+4;
static volatile bit LATD5                @ ((unsigned)&LATD)*8+5;
static volatile bit LATD6                @ ((unsigned)&LATD)*8+6;
static volatile bit LATD7                @ ((unsigned)&LATD)*8+7;
static volatile bit LATD8                @ ((unsigned)&LATD)*8+8;
static volatile bit LATD9                @ ((unsigned)&LATD)*8+9;
static volatile bit LATD10               @ ((unsigned)&LATD)*8+10;
static volatile bit LATD11               @ ((unsigned)&LATD)*8+11;
static volatile bit LATD12               @ ((unsigned)&LATD)*8+12;
static volatile bit LATD13               @ ((unsigned)&LATD)*8+13;
static volatile bit LATD14               @ ((unsigned)&LATD)*8+14;
static volatile bit LATD15               @ ((unsigned)&LATD)*8+15;

// Register: TRISE
static volatile unsigned int            TRISE               @ 0x2D8;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 6;
        volatile unsigned TRISE9              : 1;
        volatile unsigned TRISE8              : 1;
        volatile unsigned TRISE7              : 1;
        volatile unsigned TRISE6              : 1;
        volatile unsigned TRISE5              : 1;
        volatile unsigned TRISE4              : 1;
        volatile unsigned TRISE3              : 1;
        volatile unsigned TRISE2              : 1;
        volatile unsigned TRISE1              : 1;
        volatile unsigned TRISE0              : 1;
    };
} TRISEbits @ 0x2D8;
// bit variable definitions
static volatile bit TRISE0               @ ((unsigned)&TRISE)*8+0;
static volatile bit TRISE1               @ ((unsigned)&TRISE)*8+1;
static volatile bit TRISE2               @ ((unsigned)&TRISE)*8+2;
static volatile bit TRISE3               @ ((unsigned)&TRISE)*8+3;
static volatile bit TRISE4               @ ((unsigned)&TRISE)*8+4;
static volatile bit TRISE5               @ ((unsigned)&TRISE)*8+5;
static volatile bit TRISE6               @ ((unsigned)&TRISE)*8+6;
static volatile bit TRISE7               @ ((unsigned)&TRISE)*8+7;
static volatile bit TRISE8               @ ((unsigned)&TRISE)*8+8;
static volatile bit TRISE9               @ ((unsigned)&TRISE)*8+9;

// Register: PORTE
static volatile unsigned int            PORTE               @ 0x2DA;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 6;
        volatile unsigned RE9                 : 1;
        volatile unsigned RE8                 : 1;
        volatile unsigned RE7                 : 1;
        volatile unsigned RE6                 : 1;
        volatile unsigned RE5                 : 1;
        volatile unsigned RE4                 : 1;
        volatile unsigned RE3                 : 1;
        volatile unsigned RE2                 : 1;
        volatile unsigned RE1                 : 1;
        volatile unsigned RE0                 : 1;
    };
} PORTEbits @ 0x2DA;
// bit variable definitions
static volatile bit RE0                  @ ((unsigned)&PORTE)*8+0;
static volatile bit RE1                  @ ((unsigned)&PORTE)*8+1;
static volatile bit RE2                  @ ((unsigned)&PORTE)*8+2;
static volatile bit RE3                  @ ((unsigned)&PORTE)*8+3;
static volatile bit RE4                  @ ((unsigned)&PORTE)*8+4;
static volatile bit RE5                  @ ((unsigned)&PORTE)*8+5;
static volatile bit RE6                  @ ((unsigned)&PORTE)*8+6;
static volatile bit RE7                  @ ((unsigned)&PORTE)*8+7;
static volatile bit RE8                  @ ((unsigned)&PORTE)*8+8;
static volatile bit RE9                  @ ((unsigned)&PORTE)*8+9;

// Register: LATE
static volatile unsigned int            LATE                @ 0x2DC;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 6;
        volatile unsigned LATE9               : 1;
        volatile unsigned LATE8               : 1;
        volatile unsigned LATE7               : 1;
        volatile unsigned LATE6               : 1;
        volatile unsigned LATE5               : 1;
        volatile unsigned LATE4               : 1;
        volatile unsigned LATE3               : 1;
        volatile unsigned LATE2               : 1;
        volatile unsigned LATE1               : 1;
        volatile unsigned LATE0               : 1;
    };
} LATEbits @ 0x2DC;
// bit variable definitions
static volatile bit LATE0                @ ((unsigned)&LATE)*8+0;
static volatile bit LATE1                @ ((unsigned)&LATE)*8+1;
static volatile bit LATE2                @ ((unsigned)&LATE)*8+2;
static volatile bit LATE3                @ ((unsigned)&LATE)*8+3;
static volatile bit LATE4                @ ((unsigned)&LATE)*8+4;
static volatile bit LATE5                @ ((unsigned)&LATE)*8+5;
static volatile bit LATE6                @ ((unsigned)&LATE)*8+6;
static volatile bit LATE7                @ ((unsigned)&LATE)*8+7;
static volatile bit LATE8                @ ((unsigned)&LATE)*8+8;
static volatile bit LATE9                @ ((unsigned)&LATE)*8+9;

