Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: TRISF
static volatile unsigned int            TRISF               @ 0x2DE;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 7;
        volatile unsigned TRISF8              : 1;
        volatile unsigned TRISF7              : 1;
        volatile unsigned TRISF6              : 1;
        volatile unsigned TRISF5              : 1;
        volatile unsigned TRISF4              : 1;
        volatile unsigned TRISF3              : 1;
        volatile unsigned TRISF2              : 1;
        volatile unsigned TRISF1              : 1;
        volatile unsigned TRISF0              : 1;
    };
} TRISFbits @ 0x2DE;
// bit variable definitions
static volatile bit TRISF0               @ ((unsigned)&TRISF)*8+0;
static volatile bit TRISF1               @ ((unsigned)&TRISF)*8+1;
static volatile bit TRISF2               @ ((unsigned)&TRISF)*8+2;
static volatile bit TRISF3               @ ((unsigned)&TRISF)*8+3;
static volatile bit TRISF4               @ ((unsigned)&TRISF)*8+4;
static volatile bit TRISF5               @ ((unsigned)&TRISF)*8+5;
static volatile bit TRISF6               @ ((unsigned)&TRISF)*8+6;
static volatile bit TRISF7               @ ((unsigned)&TRISF)*8+7;
static volatile bit TRISF8               @ ((unsigned)&TRISF)*8+8;

// Register: PORTF
static volatile unsigned int            PORTF               @ 0x2E0;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 7;
        volatile unsigned RF8                 : 1;
        volatile unsigned RF7                 : 1;
        volatile unsigned RF6                 : 1;
        volatile unsigned RF5                 : 1;
        volatile unsigned RF4                 : 1;
        volatile unsigned RF3                 : 1;
        volatile unsigned RF2                 : 1;
        volatile unsigned RF1                 : 1;
        volatile unsigned RF0                 : 1;
    };
} PORTFbits @ 0x2E0;
// bit variable definitions
static volatile bit RF0                  @ ((unsigned)&PORTF)*8+0;
static volatile bit RF1                  @ ((unsigned)&PORTF)*8+1;
static volatile bit RF2                  @ ((unsigned)&PORTF)*8+2;
static volatile bit RF3                  @ ((unsigned)&PORTF)*8+3;
static volatile bit RF4                  @ ((unsigned)&PORTF)*8+4;
static volatile bit RF5                  @ ((unsigned)&PORTF)*8+5;
static volatile bit RF6                  @ ((unsigned)&PORTF)*8+6;
static volatile bit RF7                  @ ((unsigned)&PORTF)*8+7;
static volatile bit RF8                  @ ((unsigned)&PORTF)*8+8;

// Register: LATF
static volatile unsigned int            LATF                @ 0x2E2;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 7;
        volatile unsigned LATF8               : 1;
        volatile unsigned LATF7               : 1;
        volatile unsigned LATF6               : 1;
        volatile unsigned LATF5               : 1;
        volatile unsigned LATF4               : 1;
        volatile unsigned LATF3               : 1;
        volatile unsigned LATF2               : 1;
        volatile unsigned LATF1               : 1;
        volatile unsigned LATF0               : 1;
    };
} LATFbits @ 0x2E2;
// bit variable definitions
static volatile bit LATF0                @ ((unsigned)&LATF)*8+0;
static volatile bit LATF1                @ ((unsigned)&LATF)*8+1;
static volatile bit LATF2                @ ((unsigned)&LATF)*8+2;
static volatile bit LATF3                @ ((unsigned)&LATF)*8+3;
static volatile bit LATF4                @ ((unsigned)&LATF)*8+4;
static volatile bit LATF5                @ ((unsigned)&LATF)*8+5;
static volatile bit LATF6                @ ((unsigned)&LATF)*8+6;
static volatile bit LATF7                @ ((unsigned)&LATF)*8+7;
static volatile bit LATF8                @ ((unsigned)&LATF)*8+8;

// Register: TRISG
static volatile unsigned int            TRISG               @ 0x2E4;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 6;
        volatile unsigned TRISG9              : 1;
        volatile unsigned TRISG8              : 1;
        volatile unsigned TRISG7              : 1;
        volatile unsigned TRISG6              : 1;
        volatile unsigned                     : 2;
        volatile unsigned TRISG3              : 1;
        volatile unsigned TRISG2              : 1;
        volatile unsigned TRISG1              : 1;
        volatile unsigned TRISG0              : 1;
    };
} TRISGbits @ 0x2E4;
// bit variable definitions
static volatile bit TRISG0               @ ((unsigned)&TRISG)*8+0;
static volatile bit TRISG1               @ ((unsigned)&TRISG)*8+1;
static volatile bit TRISG2               @ ((unsigned)&TRISG)*8+2;
static volatile bit TRISG3               @ ((unsigned)&TRISG)*8+3;
static volatile bit TRISG6               @ ((unsigned)&TRISG)*8+6;
static volatile bit TRISG7               @ ((unsigned)&TRISG)*8+7;
static volatile bit TRISG8               @ ((unsigned)&TRISG)*8+8;
static volatile bit TRISG9               @ ((unsigned)&TRISG)*8+9;

// Register: PORTG
static volatile unsigned int            PORTG               @ 0x2E6;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 6;
        volatile unsigned RG9                 : 1;
        volatile unsigned RG8                 : 1;
        volatile unsigned RG7                 : 1;
        volatile unsigned RG6                 : 1;
        volatile unsigned                     : 2;
        volatile unsigned RG3                 : 1;
        volatile unsigned RG2                 : 1;
        volatile unsigned RG1                 : 1;
        volatile unsigned RG0                 : 1;
    };
} PORTGbits @ 0x2E6;
// bit variable definitions
static volatile bit RG0                  @ ((unsigned)&PORTG)*8+0;
static volatile bit RG1                  @ ((unsigned)&PORTG)*8+1;
static volatile bit RG2                  @ ((unsigned)&PORTG)*8+2;
static volatile bit RG3                  @ ((unsigned)&PORTG)*8+3;
static volatile bit RG6                  @ ((unsigned)&PORTG)*8+6;
static volatile bit RG7                  @ ((unsigned)&PORTG)*8+7;
static volatile bit RG8                  @ ((unsigned)&PORTG)*8+8;
static volatile bit RG9                  @ ((unsigned)&PORTG)*8+9;

// Register: LATG
static volatile unsigned int            LATG                @ 0x2E8;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 6;
        volatile unsigned LATG9               : 1;
        volatile unsigned LATG8               : 1;
        volatile unsigned LATG7               : 1;
        volatile unsigned LATG6               : 1;
        volatile unsigned                     : 2;
        volatile unsigned LATG3               : 1;
        volatile unsigned LATG2               : 1;
        volatile unsigned LATG1               : 1;
        volatile unsigned LATG0               : 1;
    };
} LATGbits @ 0x2E8;
// bit variable definitions
static volatile bit LATG0                @ ((unsigned)&LATG)*8+0;
static volatile bit LATG1                @ ((unsigned)&LATG)*8+1;
static volatile bit LATG2                @ ((unsigned)&LATG)*8+2;
static volatile bit LATG3                @ ((unsigned)&LATG)*8+3;
static volatile bit LATG6                @ ((unsigned)&LATG)*8+6;
static volatile bit LATG7                @ ((unsigned)&LATG)*8+7;
static volatile bit LATG8                @ ((unsigned)&LATG)*8+8;
static volatile bit LATG9                @ ((unsigned)&LATG)*8+9;

// Register: C1RXF0SID
static volatile unsigned int            C1RXF0SID           @ 0x300;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 3;
        volatile unsigned SID10               : 1;
        volatile unsigned SID9                : 1;
        volatile unsigned SID8                : 1;
        volatile unsigned SID7                : 1;
        volatile unsigned SID6                : 1;
        volatile unsigned SID5                : 1;
        volatile unsigned SID4                : 1;
        volatile unsigned SID3                : 1;
        volatile unsigned SID2                : 1;
        volatile unsigned SID1                : 1;
        volatile unsigned SID0                : 1;
        volatile unsigned                     : 1;
        volatile unsigned EXIDE               : 1;
    };
} C1RXF0SIDbits @ 0x300;
// bit variable definitions
static volatile bit EXIDE                @ ((unsigned)&C1RXF0SID)*8+0;
static volatile bit SID0                 @ ((unsigned)&C1RXF0SID)*8+2;
static volatile bit SID1                 @ ((unsigned)&C1RXF0SID)*8+3;
static volatile bit SID2                 @ ((unsigned)&C1RXF0SID)*8+4;
static volatile bit SID3                 @ ((unsigned)&C1RXF0SID)*8+5;
static volatile bit SID4                 @ ((unsigned)&C1RXF0SID)*8+6;
static volatile bit SID5                 @ ((unsigned)&C1RXF0SID)*8+7;
static volatile bit SID6                 @ ((unsigned)&C1RXF0SID)*8+8;
static volatile bit SID7                 @ ((unsigned)&C1RXF0SID)*8+9;
static volatile bit SID8                 @ ((unsigned)&C1RXF0SID)*8+10;
static volatile bit SID9                 @ ((unsigned)&C1RXF0SID)*8+11;
static volatile bit SID10                @ ((unsigned)&C1RXF0SID)*8+12;

// Register: C1RXF0EIDH
static volatile unsigned int            C1RXF0EIDH          @ 0x302;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 4;
        volatile unsigned EID17               : 1;
        volatile unsigned EID16               : 1;
        volatile unsigned EID15               : 1;
        volatile unsigned EID14               : 1;
        volatile unsigned EID13               : 1;
        volatile unsigned EID12               : 1;
        volatile unsigned EID11               : 1;
        volatile unsigned EID10               : 1;
        volatile unsigned EID9                : 1;
        volatile unsigned EID8                : 1;
        volatile unsigned EID7                : 1;
        volatile unsigned EID6                : 1;
    };
} C1RXF0EIDHbits @ 0x302;
// bit variable definitions
static volatile bit EID6                 @ ((unsigned)&C1RXF0EIDH)*8+0;
static volatile bit EID7                 @ ((unsigned)&C1RXF0EIDH)*8+1;
static volatile bit EID8                 @ ((unsigned)&C1RXF0EIDH)*8+2;
static volatile bit EID9                 @ ((unsigned)&C1RXF0EIDH)*8+3;
static volatile bit EID10                @ ((unsigned)&C1RXF0EIDH)*8+4;
static volatile bit EID11                @ ((unsigned)&C1RXF0EIDH)*8+5;
static volatile bit EID12                @ ((unsigned)&C1RXF0EIDH)*8+6;
static volatile bit EID13                @ ((unsigned)&C1RXF0EIDH)*8+7;
static volatile bit EID14                @ ((unsigned)&C1RXF0EIDH)*8+8;
static volatile bit EID15                @ ((unsigned)&C1RXF0EIDH)*8+9;
static volatile bit EID16                @ ((unsigned)&C1RXF0EIDH)*8+10;
static volatile bit EID17                @ ((unsigned)&C1RXF0EIDH)*8+11;

