Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: C1TX2B2
static volatile unsigned int            C1TX2B2             @ 0x348;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB2D3              : 8;
        volatile unsigned TXB2D2              : 8;
    };
    struct {
        volatile unsigned TXB2D37             : 1;
        volatile unsigned TXB2D36             : 1;
        volatile unsigned TXB2D35             : 1;
        volatile unsigned TXB2D34             : 1;
        volatile unsigned TXB2D33             : 1;
        volatile unsigned TXB2D32             : 1;
        volatile unsigned TXB2D31             : 1;
        volatile unsigned TXB2D30             : 1;
        volatile unsigned TXB2D27             : 1;
        volatile unsigned TXB2D26             : 1;
        volatile unsigned TXB2D25             : 1;
        volatile unsigned TXB2D24             : 1;
        volatile unsigned TXB2D23             : 1;
        volatile unsigned TXB2D22             : 1;
        volatile unsigned TXB2D21             : 1;
        volatile unsigned TXB2D20             : 1;
    };
} C1TX2B2bits @ 0x348;
// bit variable definitions
static volatile bit TXB2D20              @ ((unsigned)&C1TX2B2)*8+0;
static volatile bit TXB2D21              @ ((unsigned)&C1TX2B2)*8+1;
static volatile bit TXB2D22              @ ((unsigned)&C1TX2B2)*8+2;
static volatile bit TXB2D23              @ ((unsigned)&C1TX2B2)*8+3;
static volatile bit TXB2D24              @ ((unsigned)&C1TX2B2)*8+4;
static volatile bit TXB2D25              @ ((unsigned)&C1TX2B2)*8+5;
static volatile bit TXB2D26              @ ((unsigned)&C1TX2B2)*8+6;
static volatile bit TXB2D27              @ ((unsigned)&C1TX2B2)*8+7;
static volatile bit TXB2D30              @ ((unsigned)&C1TX2B2)*8+8;
static volatile bit TXB2D31              @ ((unsigned)&C1TX2B2)*8+9;
static volatile bit TXB2D32              @ ((unsigned)&C1TX2B2)*8+10;
static volatile bit TXB2D33              @ ((unsigned)&C1TX2B2)*8+11;
static volatile bit TXB2D34              @ ((unsigned)&C1TX2B2)*8+12;
static volatile bit TXB2D35              @ ((unsigned)&C1TX2B2)*8+13;
static volatile bit TXB2D36              @ ((unsigned)&C1TX2B2)*8+14;
static volatile bit TXB2D37              @ ((unsigned)&C1TX2B2)*8+15;

// Register: C1TX2B3
static volatile unsigned int            C1TX2B3             @ 0x34A;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB2D5              : 8;
        volatile unsigned TXB2D4              : 8;
    };
    struct {
        volatile unsigned TXB2D57             : 1;
        volatile unsigned TXB2D56             : 1;
        volatile unsigned TXB2D55             : 1;
        volatile unsigned TXB2D54             : 1;
        volatile unsigned TXB2D53             : 1;
        volatile unsigned TXB2D52             : 1;
        volatile unsigned TXB2D51             : 1;
        volatile unsigned TXB2D50             : 1;
        volatile unsigned TX2B2D47            : 1;
        volatile unsigned TX2B2D46            : 1;
        volatile unsigned TX2B2D45            : 1;
        volatile unsigned TX2B2D44            : 1;
        volatile unsigned TX2B2D43            : 1;
        volatile unsigned TX2B2D42            : 1;
        volatile unsigned TX2B2D41            : 1;
        volatile unsigned TX2B2D40            : 1;
    };
} C1TX2B3bits @ 0x34A;
// bit variable definitions
static volatile bit TX2B2D40             @ ((unsigned)&C1TX2B3)*8+0;
static volatile bit TX2B2D41             @ ((unsigned)&C1TX2B3)*8+1;
static volatile bit TX2B2D42             @ ((unsigned)&C1TX2B3)*8+2;
static volatile bit TX2B2D43             @ ((unsigned)&C1TX2B3)*8+3;
static volatile bit TX2B2D44             @ ((unsigned)&C1TX2B3)*8+4;
static volatile bit TX2B2D45             @ ((unsigned)&C1TX2B3)*8+5;
static volatile bit TX2B2D46             @ ((unsigned)&C1TX2B3)*8+6;
static volatile bit TX2B2D47             @ ((unsigned)&C1TX2B3)*8+7;
static volatile bit TXB2D50              @ ((unsigned)&C1TX2B3)*8+8;
static volatile bit TXB2D51              @ ((unsigned)&C1TX2B3)*8+9;
static volatile bit TXB2D52              @ ((unsigned)&C1TX2B3)*8+10;
static volatile bit TXB2D53              @ ((unsigned)&C1TX2B3)*8+11;
static volatile bit TXB2D54              @ ((unsigned)&C1TX2B3)*8+12;
static volatile bit TXB2D55              @ ((unsigned)&C1TX2B3)*8+13;
static volatile bit TXB2D56              @ ((unsigned)&C1TX2B3)*8+14;
static volatile bit TXB2D57              @ ((unsigned)&C1TX2B3)*8+15;

// Register: C1TX2B4
static volatile unsigned int            C1TX2B4             @ 0x34C;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB2D7              : 8;
        volatile unsigned TXB2D6              : 8;
    };
    struct {
        volatile unsigned TX2B2D77            : 1;
        volatile unsigned TX2B2D76            : 1;
        volatile unsigned TX2B2D75            : 1;
        volatile unsigned TX2B2D74            : 1;
        volatile unsigned TX2B2D73            : 1;
        volatile unsigned TX2B2D72            : 1;
        volatile unsigned TX2B2D71            : 1;
        volatile unsigned TX2B2D70            : 1;
        volatile unsigned TX2B2D67            : 1;
        volatile unsigned TX2B2D66            : 1;
        volatile unsigned TX2B2D65            : 1;
        volatile unsigned TX2B2D64            : 1;
        volatile unsigned TX2B2D63            : 1;
        volatile unsigned TX2B2D62            : 1;
        volatile unsigned TX2B2D61            : 1;
        volatile unsigned TX2B2D60            : 1;
    };
} C1TX2B4bits @ 0x34C;
// bit variable definitions
static volatile bit TX2B2D60             @ ((unsigned)&C1TX2B4)*8+0;
static volatile bit TX2B2D61             @ ((unsigned)&C1TX2B4)*8+1;
static volatile bit TX2B2D62             @ ((unsigned)&C1TX2B4)*8+2;
static volatile bit TX2B2D63             @ ((unsigned)&C1TX2B4)*8+3;
static volatile bit TX2B2D64             @ ((unsigned)&C1TX2B4)*8+4;
static volatile bit TX2B2D65             @ ((unsigned)&C1TX2B4)*8+5;
static volatile bit TX2B2D66             @ ((unsigned)&C1TX2B4)*8+6;
static volatile bit TX2B2D67             @ ((unsigned)&C1TX2B4)*8+7;
static volatile bit TX2B2D70             @ ((unsigned)&C1TX2B4)*8+8;
static volatile bit TX2B2D71             @ ((unsigned)&C1TX2B4)*8+9;
static volatile bit TX2B2D72             @ ((unsigned)&C1TX2B4)*8+10;
static volatile bit TX2B2D73             @ ((unsigned)&C1TX2B4)*8+11;
static volatile bit TX2B2D74             @ ((unsigned)&C1TX2B4)*8+12;
static volatile bit TX2B2D75             @ ((unsigned)&C1TX2B4)*8+13;
static volatile bit TX2B2D76             @ ((unsigned)&C1TX2B4)*8+14;
static volatile bit TX2B2D77             @ ((unsigned)&C1TX2B4)*8+15;

// Register: C1TX2CON
static volatile unsigned int            C1TX2CON            @ 0x34E;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 9;
        volatile unsigned TXABT               : 1;
        volatile unsigned TXLARB              : 1;
        volatile unsigned TXERR               : 1;
        volatile unsigned TXREQ               : 1;
        volatile unsigned                     : 1;
        volatile unsigned TXPRI               : 2;
    };
    struct {
        volatile unsigned                     : 14;
        volatile unsigned TXPRI1              : 1;
        volatile unsigned TXPRI0              : 1;
    };
} C1TX2CONbits @ 0x34E;
// bit variable definitions
static volatile bit TXREQ                @ ((unsigned)&C1TX2CON)*8+3;
static volatile bit TXERR                @ ((unsigned)&C1TX2CON)*8+4;
static volatile bit TXLARB               @ ((unsigned)&C1TX2CON)*8+5;
static volatile bit TXABT                @ ((unsigned)&C1TX2CON)*8+6;
static volatile bit TXPRI0               @ ((unsigned)&C1TX2CON)*8+0;
static volatile bit TXPRI1               @ ((unsigned)&C1TX2CON)*8+1;

// Register: C1TX1SID
static volatile unsigned int            C1TX1SID            @ 0x350;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned SID10               : 1;
        volatile unsigned SID9                : 1;
        volatile unsigned SID8                : 1;
        volatile unsigned SID7                : 1;
        volatile unsigned SID6                : 1;
        volatile unsigned                     : 3;
        volatile unsigned SID5                : 1;
        volatile unsigned SID4                : 1;
        volatile unsigned SID3                : 1;
        volatile unsigned SID2                : 1;
        volatile unsigned SID1                : 1;
        volatile unsigned SID0                : 1;
        volatile unsigned SRR                 : 1;
        volatile unsigned TXIDE               : 1;
    };
} C1TX1SIDbits @ 0x350;
// bit variable definitions
// duplicate bit in register C1TX2SID, definition disabled
// static volatile bit TXIDE                @ ((unsigned)&C1TX1SID)*8+0;
// duplicate bit in register C1TX2SID, definition disabled
// static volatile bit SRR                  @ ((unsigned)&C1TX1SID)*8+1;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID0                 @ ((unsigned)&C1TX1SID)*8+2;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID1                 @ ((unsigned)&C1TX1SID)*8+3;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID2                 @ ((unsigned)&C1TX1SID)*8+4;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID3                 @ ((unsigned)&C1TX1SID)*8+5;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID4                 @ ((unsigned)&C1TX1SID)*8+6;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID5                 @ ((unsigned)&C1TX1SID)*8+7;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID6                 @ ((unsigned)&C1TX1SID)*8+11;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID7                 @ ((unsigned)&C1TX1SID)*8+12;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID8                 @ ((unsigned)&C1TX1SID)*8+13;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID9                 @ ((unsigned)&C1TX1SID)*8+14;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID10                @ ((unsigned)&C1TX1SID)*8+15;

// Register: C1TX1EID
static volatile unsigned int            C1TX1EID            @ 0x352;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned EID17               : 1;
        volatile unsigned EID16               : 1;
        volatile unsigned EID15               : 1;
        volatile unsigned EID14               : 1;
        volatile unsigned                     : 4;
        volatile unsigned EID13               : 1;
        volatile unsigned EID12               : 1;
        volatile unsigned EID11               : 1;
        volatile unsigned EID10               : 1;
        volatile unsigned EID9                : 1;
        volatile unsigned EID8                : 1;
        volatile unsigned EID7                : 1;
        volatile unsigned EID6                : 1;
    };
} C1TX1EIDbits @ 0x352;
// bit variable definitions
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID6                 @ ((unsigned)&C1TX1EID)*8+0;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID7                 @ ((unsigned)&C1TX1EID)*8+1;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID8                 @ ((unsigned)&C1TX1EID)*8+2;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID9                 @ ((unsigned)&C1TX1EID)*8+3;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID10                @ ((unsigned)&C1TX1EID)*8+4;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID11                @ ((unsigned)&C1TX1EID)*8+5;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID12                @ ((unsigned)&C1TX1EID)*8+6;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID13                @ ((unsigned)&C1TX1EID)*8+7;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID14                @ ((unsigned)&C1TX1EID)*8+12;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID15                @ ((unsigned)&C1TX1EID)*8+13;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID16                @ ((unsigned)&C1TX1EID)*8+14;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID17                @ ((unsigned)&C1TX1EID)*8+15;

