Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: C1TX1DLC
static volatile unsigned int            C1TX1DLC            @ 0x354;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned EID5                : 1;
        volatile unsigned EID4                : 1;
        volatile unsigned EID3                : 1;
        volatile unsigned EID2                : 1;
        volatile unsigned EID1                : 1;
        volatile unsigned EID0                : 1;
        volatile unsigned TXRTR               : 1;
        volatile unsigned TXRB1               : 1;
        volatile unsigned TXRB0               : 1;
        volatile unsigned DLC                 : 4;
        volatile unsigned                     : 3;
    };
    struct {
        volatile unsigned                     : 9;
        volatile unsigned DLC3                : 1;
        volatile unsigned DLC2                : 1;
        volatile unsigned DLC1                : 1;
        volatile unsigned DLC0                : 1;
        volatile unsigned                     : 3;
    };
} C1TX1DLCbits @ 0x354;
// bit variable definitions
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit TXRB0                @ ((unsigned)&C1TX1DLC)*8+7;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit TXRB1                @ ((unsigned)&C1TX1DLC)*8+8;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit TXRTR                @ ((unsigned)&C1TX1DLC)*8+9;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID0                 @ ((unsigned)&C1TX1DLC)*8+10;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID1                 @ ((unsigned)&C1TX1DLC)*8+11;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID2                 @ ((unsigned)&C1TX1DLC)*8+12;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID3                 @ ((unsigned)&C1TX1DLC)*8+13;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID4                 @ ((unsigned)&C1TX1DLC)*8+14;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID5                 @ ((unsigned)&C1TX1DLC)*8+15;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC0                 @ ((unsigned)&C1TX1DLC)*8+3;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC1                 @ ((unsigned)&C1TX1DLC)*8+4;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC2                 @ ((unsigned)&C1TX1DLC)*8+5;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC3                 @ ((unsigned)&C1TX1DLC)*8+6;

// Register: C1TX1B1
static volatile unsigned int            C1TX1B1             @ 0x356;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB1D1              : 8;
        volatile unsigned TXB1D0              : 8;
    };
    struct {
        volatile unsigned TXB1D17             : 1;
        volatile unsigned TXB1D16             : 1;
        volatile unsigned TXB1D15             : 1;
        volatile unsigned TXB1D14             : 1;
        volatile unsigned TXB1D13             : 1;
        volatile unsigned TXB1D12             : 1;
        volatile unsigned TXB1D11             : 1;
        volatile unsigned TXB1D10             : 1;
        volatile unsigned TXB1D07             : 1;
        volatile unsigned TXB1D06             : 1;
        volatile unsigned TXB1D05             : 1;
        volatile unsigned TXB1D04             : 1;
        volatile unsigned TXB1D03             : 1;
        volatile unsigned TXB1D02             : 1;
        volatile unsigned TXB1D01             : 1;
        volatile unsigned TXB1D00             : 1;
    };
} C1TX1B1bits @ 0x356;
// bit variable definitions
static volatile bit TXB1D00              @ ((unsigned)&C1TX1B1)*8+0;
static volatile bit TXB1D01              @ ((unsigned)&C1TX1B1)*8+1;
static volatile bit TXB1D02              @ ((unsigned)&C1TX1B1)*8+2;
static volatile bit TXB1D03              @ ((unsigned)&C1TX1B1)*8+3;
static volatile bit TXB1D04              @ ((unsigned)&C1TX1B1)*8+4;
static volatile bit TXB1D05              @ ((unsigned)&C1TX1B1)*8+5;
static volatile bit TXB1D06              @ ((unsigned)&C1TX1B1)*8+6;
static volatile bit TXB1D07              @ ((unsigned)&C1TX1B1)*8+7;
static volatile bit TXB1D10              @ ((unsigned)&C1TX1B1)*8+8;
static volatile bit TXB1D11              @ ((unsigned)&C1TX1B1)*8+9;
static volatile bit TXB1D12              @ ((unsigned)&C1TX1B1)*8+10;
static volatile bit TXB1D13              @ ((unsigned)&C1TX1B1)*8+11;
static volatile bit TXB1D14              @ ((unsigned)&C1TX1B1)*8+12;
static volatile bit TXB1D15              @ ((unsigned)&C1TX1B1)*8+13;
static volatile bit TXB1D16              @ ((unsigned)&C1TX1B1)*8+14;
static volatile bit TXB1D17              @ ((unsigned)&C1TX1B1)*8+15;

// Register: C1TX1B2
static volatile unsigned int            C1TX1B2             @ 0x358;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB1D3              : 8;
        volatile unsigned TXB1D2              : 8;
    };
    struct {
        volatile unsigned TXB1D37             : 1;
        volatile unsigned TXB1D36             : 1;
        volatile unsigned TXB1D35             : 1;
        volatile unsigned TXB1D34             : 1;
        volatile unsigned TXB1D33             : 1;
        volatile unsigned TXB1D32             : 1;
        volatile unsigned TXB1D31             : 1;
        volatile unsigned TXB1D30             : 1;
        volatile unsigned TXB1D27             : 1;
        volatile unsigned TXB1D26             : 1;
        volatile unsigned TXB1D25             : 1;
        volatile unsigned TXB1D24             : 1;
        volatile unsigned TXB1D23             : 1;
        volatile unsigned TXB1D22             : 1;
        volatile unsigned TXB1D21             : 1;
        volatile unsigned TXB1D20             : 1;
    };
} C1TX1B2bits @ 0x358;
// bit variable definitions
static volatile bit TXB1D20              @ ((unsigned)&C1TX1B2)*8+0;
static volatile bit TXB1D21              @ ((unsigned)&C1TX1B2)*8+1;
static volatile bit TXB1D22              @ ((unsigned)&C1TX1B2)*8+2;
static volatile bit TXB1D23              @ ((unsigned)&C1TX1B2)*8+3;
static volatile bit TXB1D24              @ ((unsigned)&C1TX1B2)*8+4;
static volatile bit TXB1D25              @ ((unsigned)&C1TX1B2)*8+5;
static volatile bit TXB1D26              @ ((unsigned)&C1TX1B2)*8+6;
static volatile bit TXB1D27              @ ((unsigned)&C1TX1B2)*8+7;
static volatile bit TXB1D30              @ ((unsigned)&C1TX1B2)*8+8;
static volatile bit TXB1D31              @ ((unsigned)&C1TX1B2)*8+9;
static volatile bit TXB1D32              @ ((unsigned)&C1TX1B2)*8+10;
static volatile bit TXB1D33              @ ((unsigned)&C1TX1B2)*8+11;
static volatile bit TXB1D34              @ ((unsigned)&C1TX1B2)*8+12;
static volatile bit TXB1D35              @ ((unsigned)&C1TX1B2)*8+13;
static volatile bit TXB1D36              @ ((unsigned)&C1TX1B2)*8+14;
static volatile bit TXB1D37              @ ((unsigned)&C1TX1B2)*8+15;

// Register: C1TX1B3
static volatile unsigned int            C1TX1B3             @ 0x35A;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB1D5              : 8;
        volatile unsigned TXB1D4              : 8;
    };
    struct {
        volatile unsigned TXB1D57             : 1;
        volatile unsigned TXB1D56             : 1;
        volatile unsigned TXB1D55             : 1;
        volatile unsigned TXB1D54             : 1;
        volatile unsigned TXB1D53             : 1;
        volatile unsigned TXB1D52             : 1;
        volatile unsigned TXB1D51             : 1;
        volatile unsigned TXB1D50             : 1;
        volatile unsigned TXB1D47             : 1;
        volatile unsigned TXB1D46             : 1;
        volatile unsigned TXB1D45             : 1;
        volatile unsigned TXB1D44             : 1;
        volatile unsigned TXB1D43             : 1;
        volatile unsigned TXB1D42             : 1;
        volatile unsigned TXB1D41             : 1;
        volatile unsigned TXB1D40             : 1;
    };
} C1TX1B3bits @ 0x35A;
// bit variable definitions
static volatile bit TXB1D40              @ ((unsigned)&C1TX1B3)*8+0;
static volatile bit TXB1D41              @ ((unsigned)&C1TX1B3)*8+1;
static volatile bit TXB1D42              @ ((unsigned)&C1TX1B3)*8+2;
static volatile bit TXB1D43              @ ((unsigned)&C1TX1B3)*8+3;
static volatile bit TXB1D44              @ ((unsigned)&C1TX1B3)*8+4;
static volatile bit TXB1D45              @ ((unsigned)&C1TX1B3)*8+5;
static volatile bit TXB1D46              @ ((unsigned)&C1TX1B3)*8+6;
static volatile bit TXB1D47              @ ((unsigned)&C1TX1B3)*8+7;
static volatile bit TXB1D50              @ ((unsigned)&C1TX1B3)*8+8;
static volatile bit TXB1D51              @ ((unsigned)&C1TX1B3)*8+9;
static volatile bit TXB1D52              @ ((unsigned)&C1TX1B3)*8+10;
static volatile bit TXB1D53              @ ((unsigned)&C1TX1B3)*8+11;
static volatile bit TXB1D54              @ ((unsigned)&C1TX1B3)*8+12;
static volatile bit TXB1D55              @ ((unsigned)&C1TX1B3)*8+13;
static volatile bit TXB1D56              @ ((unsigned)&C1TX1B3)*8+14;
static volatile bit TXB1D57              @ ((unsigned)&C1TX1B3)*8+15;

// Register: C1TX1B4
static volatile unsigned int            C1TX1B4             @ 0x35C;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB1D7              : 8;
        volatile unsigned TXB1D6              : 8;
    };
    struct {
        volatile unsigned TXB1D77             : 1;
        volatile unsigned TXB1D76             : 1;
        volatile unsigned TXB1D75             : 1;
        volatile unsigned TXB1D74             : 1;
        volatile unsigned TXB1D73             : 1;
        volatile unsigned TXB1D72             : 1;
        volatile unsigned TXB1D71             : 1;
        volatile unsigned TXB1D70             : 1;
        volatile unsigned TXB1D67             : 1;
        volatile unsigned TXB1D66             : 1;
        volatile unsigned TXB1D65             : 1;
        volatile unsigned TXB1D64             : 1;
        volatile unsigned TXB1D63             : 1;
        volatile unsigned TXB1D62             : 1;
        volatile unsigned TXB1D61             : 1;
        volatile unsigned TXB1D60             : 1;
    };
} C1TX1B4bits @ 0x35C;
// bit variable definitions
static volatile bit TXB1D60              @ ((unsigned)&C1TX1B4)*8+0;
static volatile bit TXB1D61              @ ((unsigned)&C1TX1B4)*8+1;
static volatile bit TXB1D62              @ ((unsigned)&C1TX1B4)*8+2;
static volatile bit TXB1D63              @ ((unsigned)&C1TX1B4)*8+3;
static volatile bit TXB1D64              @ ((unsigned)&C1TX1B4)*8+4;
static volatile bit TXB1D65              @ ((unsigned)&C1TX1B4)*8+5;
static volatile bit TXB1D66              @ ((unsigned)&C1TX1B4)*8+6;
static volatile bit TXB1D67              @ ((unsigned)&C1TX1B4)*8+7;
static volatile bit TXB1D70              @ ((unsigned)&C1TX1B4)*8+8;
static volatile bit TXB1D71              @ ((unsigned)&C1TX1B4)*8+9;
static volatile bit TXB1D72              @ ((unsigned)&C1TX1B4)*8+10;
static volatile bit TXB1D73              @ ((unsigned)&C1TX1B4)*8+11;
static volatile bit TXB1D74              @ ((unsigned)&C1TX1B4)*8+12;
static volatile bit TXB1D75              @ ((unsigned)&C1TX1B4)*8+13;
static volatile bit TXB1D76              @ ((unsigned)&C1TX1B4)*8+14;
static volatile bit TXB1D77              @ ((unsigned)&C1TX1B4)*8+15;

// Register: C1TX1CON
static volatile unsigned int            C1TX1CON            @ 0x35E;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 9;
        volatile unsigned TXABT               : 1;
        volatile unsigned TXLARB              : 1;
        volatile unsigned TXERR               : 1;
        volatile unsigned TXREQ               : 1;
        volatile unsigned                     : 1;
        volatile unsigned TXPRI               : 2;
    };
    struct {
        volatile unsigned                     : 14;
        volatile unsigned TXPRI1              : 1;
        volatile unsigned TXPRI0              : 1;
    };
} C1TX1CONbits @ 0x35E;
// bit variable definitions
// duplicate bit in register C1TX2CON, definition disabled
// static volatile bit TXREQ                @ ((unsigned)&C1TX1CON)*8+3;
// duplicate bit in register C1TX2CON, definition disabled
// static volatile bit TXERR                @ ((unsigned)&C1TX1CON)*8+4;
// duplicate bit in register C1TX2CON, definition disabled
// static volatile bit TXLARB               @ ((unsigned)&C1TX1CON)*8+5;
// duplicate bit in register C1TX2CON, definition disabled
// static volatile bit TXABT                @ ((unsigned)&C1TX1CON)*8+6;
// duplicate bit in register C1TX2CON, definition disabled
// static volatile bit TXPRI0               @ ((unsigned)&C1TX1CON)*8+0;
// duplicate bit in register C1TX2CON, definition disabled
// static volatile bit TXPRI1               @ ((unsigned)&C1TX1CON)*8+1;

// Register: C1TX0SID
static volatile unsigned int            C1TX0SID            @ 0x360;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned SID10               : 1;
        volatile unsigned SID9                : 1;
        volatile unsigned SID8                : 1;
        volatile unsigned SID7                : 1;
        volatile unsigned SID6                : 1;
        volatile unsigned                     : 3;
        volatile unsigned SID5                : 1;
        volatile unsigned SID4                : 1;
        volatile unsigned SID3                : 1;
        volatile unsigned SID2                : 1;
        volatile unsigned SID1                : 1;
        volatile unsigned SID0                : 1;
        volatile unsigned SRR                 : 1;
        volatile unsigned TXIDE               : 1;
    };
} C1TX0SIDbits @ 0x360;
// bit variable definitions
// duplicate bit in register C1TX2SID, definition disabled
// static volatile bit TXIDE                @ ((unsigned)&C1TX0SID)*8+0;
// duplicate bit in register C1TX2SID, definition disabled
// static volatile bit SRR                  @ ((unsigned)&C1TX0SID)*8+1;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID0                 @ ((unsigned)&C1TX0SID)*8+2;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID1                 @ ((unsigned)&C1TX0SID)*8+3;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID2                 @ ((unsigned)&C1TX0SID)*8+4;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID3                 @ ((unsigned)&C1TX0SID)*8+5;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID4                 @ ((unsigned)&C1TX0SID)*8+6;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID5                 @ ((unsigned)&C1TX0SID)*8+7;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID6                 @ ((unsigned)&C1TX0SID)*8+11;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID7                 @ ((unsigned)&C1TX0SID)*8+12;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID8                 @ ((unsigned)&C1TX0SID)*8+13;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID9                 @ ((unsigned)&C1TX0SID)*8+14;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID10                @ ((unsigned)&C1TX0SID)*8+15;

