Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: C1TX0EID
static volatile unsigned int            C1TX0EID            @ 0x362;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned EID17               : 1;
        volatile unsigned EID16               : 1;
        volatile unsigned EID15               : 1;
        volatile unsigned EID14               : 1;
        volatile unsigned                     : 4;
        volatile unsigned EID13               : 1;
        volatile unsigned EID12               : 1;
        volatile unsigned EID11               : 1;
        volatile unsigned EID10               : 1;
        volatile unsigned EID9                : 1;
        volatile unsigned EID8                : 1;
        volatile unsigned EID7                : 1;
        volatile unsigned EID6                : 1;
    };
} C1TX0EIDbits @ 0x362;
// bit variable definitions
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID6                 @ ((unsigned)&C1TX0EID)*8+0;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID7                 @ ((unsigned)&C1TX0EID)*8+1;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID8                 @ ((unsigned)&C1TX0EID)*8+2;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID9                 @ ((unsigned)&C1TX0EID)*8+3;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID10                @ ((unsigned)&C1TX0EID)*8+4;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID11                @ ((unsigned)&C1TX0EID)*8+5;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID12                @ ((unsigned)&C1TX0EID)*8+6;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID13                @ ((unsigned)&C1TX0EID)*8+7;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID14                @ ((unsigned)&C1TX0EID)*8+12;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID15                @ ((unsigned)&C1TX0EID)*8+13;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID16                @ ((unsigned)&C1TX0EID)*8+14;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID17                @ ((unsigned)&C1TX0EID)*8+15;

// Register: C1TX0DLC
static volatile unsigned int            C1TX0DLC            @ 0x364;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned EID5                : 1;
        volatile unsigned EID4                : 1;
        volatile unsigned EID3                : 1;
        volatile unsigned EID2                : 1;
        volatile unsigned EID1                : 1;
        volatile unsigned EID0                : 1;
        volatile unsigned TXRTR               : 1;
        volatile unsigned TXRB1               : 1;
        volatile unsigned TXRB0               : 1;
        volatile unsigned DLC                 : 4;
        volatile unsigned                     : 3;
    };
    struct {
        volatile unsigned                     : 9;
        volatile unsigned DLC3                : 1;
        volatile unsigned DLC2                : 1;
        volatile unsigned DLC1                : 1;
        volatile unsigned DLC0                : 1;
        volatile unsigned                     : 3;
    };
} C1TX0DLCbits @ 0x364;
// bit variable definitions
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit TXRB0                @ ((unsigned)&C1TX0DLC)*8+7;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit TXRB1                @ ((unsigned)&C1TX0DLC)*8+8;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit TXRTR                @ ((unsigned)&C1TX0DLC)*8+9;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID0                 @ ((unsigned)&C1TX0DLC)*8+10;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID1                 @ ((unsigned)&C1TX0DLC)*8+11;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID2                 @ ((unsigned)&C1TX0DLC)*8+12;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID3                 @ ((unsigned)&C1TX0DLC)*8+13;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID4                 @ ((unsigned)&C1TX0DLC)*8+14;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID5                 @ ((unsigned)&C1TX0DLC)*8+15;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC0                 @ ((unsigned)&C1TX0DLC)*8+3;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC1                 @ ((unsigned)&C1TX0DLC)*8+4;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC2                 @ ((unsigned)&C1TX0DLC)*8+5;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC3                 @ ((unsigned)&C1TX0DLC)*8+6;

// Register: C1TX0B1
static volatile unsigned int            C1TX0B1             @ 0x366;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB0D1              : 8;
        volatile unsigned TXB0D0              : 8;
    };
    struct {
        volatile unsigned TXB0D17             : 1;
        volatile unsigned TXB0D16             : 1;
        volatile unsigned TXB0D15             : 1;
        volatile unsigned TXB0D14             : 1;
        volatile unsigned TXB0D13             : 1;
        volatile unsigned TXB0D12             : 1;
        volatile unsigned TXB0D11             : 1;
        volatile unsigned TXB0D10             : 1;
        volatile unsigned TXB0D07             : 1;
        volatile unsigned TXB0D06             : 1;
        volatile unsigned TXB0D05             : 1;
        volatile unsigned TXB0D04             : 1;
        volatile unsigned TXB0D03             : 1;
        volatile unsigned TXB0D02             : 1;
        volatile unsigned TXB0D01             : 1;
        volatile unsigned TXB0D00             : 1;
    };
} C1TX0B1bits @ 0x366;
// bit variable definitions
static volatile bit TXB0D00              @ ((unsigned)&C1TX0B1)*8+0;
static volatile bit TXB0D01              @ ((unsigned)&C1TX0B1)*8+1;
static volatile bit TXB0D02              @ ((unsigned)&C1TX0B1)*8+2;
static volatile bit TXB0D03              @ ((unsigned)&C1TX0B1)*8+3;
static volatile bit TXB0D04              @ ((unsigned)&C1TX0B1)*8+4;
static volatile bit TXB0D05              @ ((unsigned)&C1TX0B1)*8+5;
static volatile bit TXB0D06              @ ((unsigned)&C1TX0B1)*8+6;
static volatile bit TXB0D07              @ ((unsigned)&C1TX0B1)*8+7;
static volatile bit TXB0D10              @ ((unsigned)&C1TX0B1)*8+8;
static volatile bit TXB0D11              @ ((unsigned)&C1TX0B1)*8+9;
static volatile bit TXB0D12              @ ((unsigned)&C1TX0B1)*8+10;
static volatile bit TXB0D13              @ ((unsigned)&C1TX0B1)*8+11;
static volatile bit TXB0D14              @ ((unsigned)&C1TX0B1)*8+12;
static volatile bit TXB0D15              @ ((unsigned)&C1TX0B1)*8+13;
static volatile bit TXB0D16              @ ((unsigned)&C1TX0B1)*8+14;
static volatile bit TXB0D17              @ ((unsigned)&C1TX0B1)*8+15;

// Register: C1TX0B2
static volatile unsigned int            C1TX0B2             @ 0x368;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB0D3              : 8;
        volatile unsigned TXB0D2              : 8;
    };
    struct {
        volatile unsigned TXB0D37             : 1;
        volatile unsigned TXB0D36             : 1;
        volatile unsigned TXB0D35             : 1;
        volatile unsigned TXB0D34             : 1;
        volatile unsigned TXB0D33             : 1;
        volatile unsigned TXB0D32             : 1;
        volatile unsigned TXB0D31             : 1;
        volatile unsigned TXB0D30             : 1;
        volatile unsigned TXB0D27             : 1;
        volatile unsigned TXB0D26             : 1;
        volatile unsigned TXB0D25             : 1;
        volatile unsigned TXB0D24             : 1;
        volatile unsigned TXB0D23             : 1;
        volatile unsigned TXB0D22             : 1;
        volatile unsigned TXB0D21             : 1;
        volatile unsigned TXB0D20             : 1;
    };
} C1TX0B2bits @ 0x368;
// bit variable definitions
static volatile bit TXB0D20              @ ((unsigned)&C1TX0B2)*8+0;
static volatile bit TXB0D21              @ ((unsigned)&C1TX0B2)*8+1;
static volatile bit TXB0D22              @ ((unsigned)&C1TX0B2)*8+2;
static volatile bit TXB0D23              @ ((unsigned)&C1TX0B2)*8+3;
static volatile bit TXB0D24              @ ((unsigned)&C1TX0B2)*8+4;
static volatile bit TXB0D25              @ ((unsigned)&C1TX0B2)*8+5;
static volatile bit TXB0D26              @ ((unsigned)&C1TX0B2)*8+6;
static volatile bit TXB0D27              @ ((unsigned)&C1TX0B2)*8+7;
static volatile bit TXB0D30              @ ((unsigned)&C1TX0B2)*8+8;
static volatile bit TXB0D31              @ ((unsigned)&C1TX0B2)*8+9;
static volatile bit TXB0D32              @ ((unsigned)&C1TX0B2)*8+10;
static volatile bit TXB0D33              @ ((unsigned)&C1TX0B2)*8+11;
static volatile bit TXB0D34              @ ((unsigned)&C1TX0B2)*8+12;
static volatile bit TXB0D35              @ ((unsigned)&C1TX0B2)*8+13;
static volatile bit TXB0D36              @ ((unsigned)&C1TX0B2)*8+14;
static volatile bit TXB0D37              @ ((unsigned)&C1TX0B2)*8+15;

// Register: C1TX0B3
static volatile unsigned int            C1TX0B3             @ 0x36A;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB0D5              : 8;
        volatile unsigned TXB0D4              : 8;
    };
    struct {
        volatile unsigned TXB0D57             : 1;
        volatile unsigned TXB0D56             : 1;
        volatile unsigned TXB0D55             : 1;
        volatile unsigned TXB0D54             : 1;
        volatile unsigned TXB0D53             : 1;
        volatile unsigned TXB0D52             : 1;
        volatile unsigned TXB0D51             : 1;
        volatile unsigned TXB0D50             : 1;
        volatile unsigned TXB0D47             : 1;
        volatile unsigned TXB0D46             : 1;
        volatile unsigned TXB0D45             : 1;
        volatile unsigned TXB0D44             : 1;
        volatile unsigned TXB0D43             : 1;
        volatile unsigned TXB0D42             : 1;
        volatile unsigned TXB0D41             : 1;
        volatile unsigned TXB0D40             : 1;
    };
} C1TX0B3bits @ 0x36A;
// bit variable definitions
static volatile bit TXB0D40              @ ((unsigned)&C1TX0B3)*8+0;
static volatile bit TXB0D41              @ ((unsigned)&C1TX0B3)*8+1;
static volatile bit TXB0D42              @ ((unsigned)&C1TX0B3)*8+2;
static volatile bit TXB0D43              @ ((unsigned)&C1TX0B3)*8+3;
static volatile bit TXB0D44              @ ((unsigned)&C1TX0B3)*8+4;
static volatile bit TXB0D45              @ ((unsigned)&C1TX0B3)*8+5;
static volatile bit TXB0D46              @ ((unsigned)&C1TX0B3)*8+6;
static volatile bit TXB0D47              @ ((unsigned)&C1TX0B3)*8+7;
static volatile bit TXB0D50              @ ((unsigned)&C1TX0B3)*8+8;
static volatile bit TXB0D51              @ ((unsigned)&C1TX0B3)*8+9;
static volatile bit TXB0D52              @ ((unsigned)&C1TX0B3)*8+10;
static volatile bit TXB0D53              @ ((unsigned)&C1TX0B3)*8+11;
static volatile bit TXB0D54              @ ((unsigned)&C1TX0B3)*8+12;
static volatile bit TXB0D55              @ ((unsigned)&C1TX0B3)*8+13;
static volatile bit TXB0D56              @ ((unsigned)&C1TX0B3)*8+14;
static volatile bit TXB0D57              @ ((unsigned)&C1TX0B3)*8+15;

// Register: C1TX0B4
static volatile unsigned int            C1TX0B4             @ 0x36C;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB0D7              : 8;
        volatile unsigned TXB0D6              : 8;
    };
    struct {
        volatile unsigned TXB0D77             : 1;
        volatile unsigned TXB0D76             : 1;
        volatile unsigned TXB0D75             : 1;
        volatile unsigned TXB0D74             : 1;
        volatile unsigned TXB0D73             : 1;
        volatile unsigned TXB0D72             : 1;
        volatile unsigned TXB0D71             : 1;
        volatile unsigned TXB0D70             : 1;
        volatile unsigned TXB0D67             : 1;
        volatile unsigned TXB0D66             : 1;
        volatile unsigned TXB0D65             : 1;
        volatile unsigned TXB0D64             : 1;
        volatile unsigned TXB0D63             : 1;
        volatile unsigned TXB0D62             : 1;
        volatile unsigned TXB0D61             : 1;
        volatile unsigned TXB0D60             : 1;
    };
} C1TX0B4bits @ 0x36C;
// bit variable definitions
static volatile bit TXB0D60              @ ((unsigned)&C1TX0B4)*8+0;
static volatile bit TXB0D61              @ ((unsigned)&C1TX0B4)*8+1;
static volatile bit TXB0D62              @ ((unsigned)&C1TX0B4)*8+2;
static volatile bit TXB0D63              @ ((unsigned)&C1TX0B4)*8+3;
static volatile bit TXB0D64              @ ((unsigned)&C1TX0B4)*8+4;
static volatile bit TXB0D65              @ ((unsigned)&C1TX0B4)*8+5;
static volatile bit TXB0D66              @ ((unsigned)&C1TX0B4)*8+6;
static volatile bit TXB0D67              @ ((unsigned)&C1TX0B4)*8+7;
static volatile bit TXB0D70              @ ((unsigned)&C1TX0B4)*8+8;
static volatile bit TXB0D71              @ ((unsigned)&C1TX0B4)*8+9;
static volatile bit TXB0D72              @ ((unsigned)&C1TX0B4)*8+10;
static volatile bit TXB0D73              @ ((unsigned)&C1TX0B4)*8+11;
static volatile bit TXB0D74              @ ((unsigned)&C1TX0B4)*8+12;
static volatile bit TXB0D75              @ ((unsigned)&C1TX0B4)*8+13;
static volatile bit TXB0D76              @ ((unsigned)&C1TX0B4)*8+14;
static volatile bit TXB0D77              @ ((unsigned)&C1TX0B4)*8+15;

// Register: C1TX0CON
static volatile unsigned int            C1TX0CON            @ 0x36E;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 9;
        volatile unsigned TXABT               : 1;
        volatile unsigned TXLARB              : 1;
        volatile unsigned TXERR               : 1;
        volatile unsigned TXREQ               : 1;
        volatile unsigned                     : 1;
        volatile unsigned TXPRI               : 2;
    };
    struct {
        volatile unsigned                     : 14;
        volatile unsigned TXPRI1              : 1;
        volatile unsigned TXPRI0              : 1;
    };
} C1TX0CONbits @ 0x36E;
// bit variable definitions
// duplicate bit in register C1TX2CON, definition disabled
// static volatile bit TXREQ                @ ((unsigned)&C1TX0CON)*8+3;
// duplicate bit in register C1TX2CON, definition disabled
// static volatile bit TXERR                @ ((unsigned)&C1TX0CON)*8+4;
// duplicate bit in register C1TX2CON, definition disabled
// static volatile bit TXLARB               @ ((unsigned)&C1TX0CON)*8+5;
// duplicate bit in register C1TX2CON, definition disabled
// static volatile bit TXABT                @ ((unsigned)&C1TX0CON)*8+6;
// duplicate bit in register C1TX2CON, definition disabled
// static volatile bit TXPRI0               @ ((unsigned)&C1TX0CON)*8+0;
// duplicate bit in register C1TX2CON, definition disabled
// static volatile bit TXPRI1               @ ((unsigned)&C1TX0CON)*8+1;

// Register: C1RX1SID
static volatile unsigned int            C1RX1SID            @ 0x370;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 3;
        volatile unsigned SID10               : 1;
        volatile unsigned SID9                : 1;
        volatile unsigned SID8                : 1;
        volatile unsigned SID7                : 1;
        volatile unsigned SID6                : 1;
        volatile unsigned SID5                : 1;
        volatile unsigned SID4                : 1;
        volatile unsigned SID3                : 1;
        volatile unsigned SID2                : 1;
        volatile unsigned SID1                : 1;
        volatile unsigned SID0                : 1;
        volatile unsigned SRR                 : 1;
        volatile unsigned TXIDE               : 1;
    };
} C1RX1SIDbits @ 0x370;
// bit variable definitions
// duplicate bit in register C1TX2SID, definition disabled
// static volatile bit TXIDE                @ ((unsigned)&C1RX1SID)*8+0;
// duplicate bit in register C1TX2SID, definition disabled
// static volatile bit SRR                  @ ((unsigned)&C1RX1SID)*8+1;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID0                 @ ((unsigned)&C1RX1SID)*8+2;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID1                 @ ((unsigned)&C1RX1SID)*8+3;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID2                 @ ((unsigned)&C1RX1SID)*8+4;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID3                 @ ((unsigned)&C1RX1SID)*8+5;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID4                 @ ((unsigned)&C1RX1SID)*8+6;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID5                 @ ((unsigned)&C1RX1SID)*8+7;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID6                 @ ((unsigned)&C1RX1SID)*8+8;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID7                 @ ((unsigned)&C1RX1SID)*8+9;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID8                 @ ((unsigned)&C1RX1SID)*8+10;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID9                 @ ((unsigned)&C1RX1SID)*8+11;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID10                @ ((unsigned)&C1RX1SID)*8+12;

