Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: C1RX1EID
static volatile unsigned int            C1RX1EID            @ 0x372;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 4;
        volatile unsigned EID17               : 1;
        volatile unsigned EID16               : 1;
        volatile unsigned EID15               : 1;
        volatile unsigned EID14               : 1;
        volatile unsigned EID13               : 1;
        volatile unsigned EID12               : 1;
        volatile unsigned EID11               : 1;
        volatile unsigned EID10               : 1;
        volatile unsigned EID9                : 1;
        volatile unsigned EID8                : 1;
        volatile unsigned EID7                : 1;
        volatile unsigned EID6                : 1;
    };
} C1RX1EIDbits @ 0x372;
// bit variable definitions
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID6                 @ ((unsigned)&C1RX1EID)*8+0;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID7                 @ ((unsigned)&C1RX1EID)*8+1;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID8                 @ ((unsigned)&C1RX1EID)*8+2;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID9                 @ ((unsigned)&C1RX1EID)*8+3;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID10                @ ((unsigned)&C1RX1EID)*8+4;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID11                @ ((unsigned)&C1RX1EID)*8+5;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID12                @ ((unsigned)&C1RX1EID)*8+6;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID13                @ ((unsigned)&C1RX1EID)*8+7;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID14                @ ((unsigned)&C1RX1EID)*8+8;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID15                @ ((unsigned)&C1RX1EID)*8+9;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID16                @ ((unsigned)&C1RX1EID)*8+10;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID17                @ ((unsigned)&C1RX1EID)*8+11;

// Register: C1RX1DLC
static volatile unsigned int            C1RX1DLC            @ 0x374;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned EID5                : 1;
        volatile unsigned EID4                : 1;
        volatile unsigned EID3                : 1;
        volatile unsigned EID2                : 1;
        volatile unsigned EID1                : 1;
        volatile unsigned EID0                : 1;
        volatile unsigned RXRTR               : 1;
        volatile unsigned RXRB1               : 1;
        volatile unsigned                     : 3;
        volatile unsigned RXRB0               : 1;
        volatile unsigned DLC                 : 4;
    };
    struct {
        volatile unsigned                     : 12;
        volatile unsigned DLC3                : 1;
        volatile unsigned DLC2                : 1;
        volatile unsigned DLC1                : 1;
        volatile unsigned DLC0                : 1;
    };
} C1RX1DLCbits @ 0x374;
// bit variable definitions
static volatile bit RXRB0                @ ((unsigned)&C1RX1DLC)*8+4;
static volatile bit RXRB1                @ ((unsigned)&C1RX1DLC)*8+8;
static volatile bit RXRTR                @ ((unsigned)&C1RX1DLC)*8+9;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID0                 @ ((unsigned)&C1RX1DLC)*8+10;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID1                 @ ((unsigned)&C1RX1DLC)*8+11;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID2                 @ ((unsigned)&C1RX1DLC)*8+12;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID3                 @ ((unsigned)&C1RX1DLC)*8+13;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID4                 @ ((unsigned)&C1RX1DLC)*8+14;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID5                 @ ((unsigned)&C1RX1DLC)*8+15;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC0                 @ ((unsigned)&C1RX1DLC)*8+0;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC1                 @ ((unsigned)&C1RX1DLC)*8+1;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC2                 @ ((unsigned)&C1RX1DLC)*8+2;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC3                 @ ((unsigned)&C1RX1DLC)*8+3;

// Register: C1RX1B1
static volatile unsigned int            C1RX1B1             @ 0x376;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB1D1              : 8;
        volatile unsigned TXB1D0              : 8;
    };
    struct {
        volatile unsigned TXB1D17             : 1;
        volatile unsigned TXB1D16             : 1;
        volatile unsigned TXB1D15             : 1;
        volatile unsigned TXB1D14             : 1;
        volatile unsigned TXB1D13             : 1;
        volatile unsigned TXB1D12             : 1;
        volatile unsigned TXB1D11             : 1;
        volatile unsigned TXB1D10             : 1;
        volatile unsigned TXB1D07             : 1;
        volatile unsigned TXB1D06             : 1;
        volatile unsigned TXB1D05             : 1;
        volatile unsigned TXB1D04             : 1;
        volatile unsigned TXB1D03             : 1;
        volatile unsigned TXB1D02             : 1;
        volatile unsigned TXB1D01             : 1;
        volatile unsigned TXB1D00             : 1;
    };
} C1RX1B1bits @ 0x376;
// bit variable definitions
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D00              @ ((unsigned)&C1RX1B1)*8+0;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D01              @ ((unsigned)&C1RX1B1)*8+1;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D02              @ ((unsigned)&C1RX1B1)*8+2;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D03              @ ((unsigned)&C1RX1B1)*8+3;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D04              @ ((unsigned)&C1RX1B1)*8+4;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D05              @ ((unsigned)&C1RX1B1)*8+5;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D06              @ ((unsigned)&C1RX1B1)*8+6;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D07              @ ((unsigned)&C1RX1B1)*8+7;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D10              @ ((unsigned)&C1RX1B1)*8+8;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D11              @ ((unsigned)&C1RX1B1)*8+9;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D12              @ ((unsigned)&C1RX1B1)*8+10;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D13              @ ((unsigned)&C1RX1B1)*8+11;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D14              @ ((unsigned)&C1RX1B1)*8+12;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D15              @ ((unsigned)&C1RX1B1)*8+13;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D16              @ ((unsigned)&C1RX1B1)*8+14;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D17              @ ((unsigned)&C1RX1B1)*8+15;

