Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: C1RX1B2
static volatile unsigned int            C1RX1B2             @ 0x378;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB1D3              : 8;
        volatile unsigned TXB1D2              : 8;
    };
    struct {
        volatile unsigned TXB1D37             : 1;
        volatile unsigned TXB1D36             : 1;
        volatile unsigned TXB1D35             : 1;
        volatile unsigned TXB1D34             : 1;
        volatile unsigned TXB1D33             : 1;
        volatile unsigned TXB1D32             : 1;
        volatile unsigned TXB1D31             : 1;
        volatile unsigned TXB1D30             : 1;
        volatile unsigned TXB1D27             : 1;
        volatile unsigned TXB1D26             : 1;
        volatile unsigned TXB1D25             : 1;
        volatile unsigned TXB1D24             : 1;
        volatile unsigned TXB1D23             : 1;
        volatile unsigned TXB1D22             : 1;
        volatile unsigned TXB1D21             : 1;
        volatile unsigned TXB1D20             : 1;
    };
} C1RX1B2bits @ 0x378;
// bit variable definitions
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D20              @ ((unsigned)&C1RX1B2)*8+0;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D21              @ ((unsigned)&C1RX1B2)*8+1;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D22              @ ((unsigned)&C1RX1B2)*8+2;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D23              @ ((unsigned)&C1RX1B2)*8+3;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D24              @ ((unsigned)&C1RX1B2)*8+4;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D25              @ ((unsigned)&C1RX1B2)*8+5;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D26              @ ((unsigned)&C1RX1B2)*8+6;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D27              @ ((unsigned)&C1RX1B2)*8+7;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D30              @ ((unsigned)&C1RX1B2)*8+8;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D31              @ ((unsigned)&C1RX1B2)*8+9;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D32              @ ((unsigned)&C1RX1B2)*8+10;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D33              @ ((unsigned)&C1RX1B2)*8+11;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D34              @ ((unsigned)&C1RX1B2)*8+12;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D35              @ ((unsigned)&C1RX1B2)*8+13;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D36              @ ((unsigned)&C1RX1B2)*8+14;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D37              @ ((unsigned)&C1RX1B2)*8+15;

// Register: C1RX1B3
static volatile unsigned int            C1RX1B3             @ 0x37A;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB1D5              : 8;
        volatile unsigned TXB1D4              : 8;
    };
    struct {
        volatile unsigned TXB1D57             : 1;
        volatile unsigned TXB1D56             : 1;
        volatile unsigned TXB1D55             : 1;
        volatile unsigned TXB1D54             : 1;
        volatile unsigned TXB1D53             : 1;
        volatile unsigned TXB1D52             : 1;
        volatile unsigned TXB1D51             : 1;
        volatile unsigned TXB1D50             : 1;
        volatile unsigned TXB1D47             : 1;
        volatile unsigned TXB1D46             : 1;
        volatile unsigned TXB1D45             : 1;
        volatile unsigned TXB1D44             : 1;
        volatile unsigned TXB1D43             : 1;
        volatile unsigned TXB1D42             : 1;
        volatile unsigned TXB1D41             : 1;
        volatile unsigned TXB1D40             : 1;
    };
} C1RX1B3bits @ 0x37A;
// bit variable definitions
// duplicate bit in register C1TX1B3, definition disabled
// static volatile bit TXB1D40              @ ((unsigned)&C1RX1B3)*8+0;
// duplicate bit in register C1TX1B3, definition disabled
// static volatile bit TXB1D41              @ ((unsigned)&C1RX1B3)*8+1;
// duplicate bit in register C1TX1B3, definition disabled
// static volatile bit TXB1D42              @ ((unsigned)&C1RX1B3)*8+2;
// duplicate bit in register C1TX1B3, definition disabled
// static volatile bit TXB1D43              @ ((unsigned)&C1RX1B3)*8+3;
// duplicate bit in register C1TX1B3, definition disabled
// static volatile bit TXB1D44              @ ((unsigned)&C1RX1B3)*8+4;
// duplicate bit in register C1TX1B3, definition disabled
// static volatile bit TXB1D45              @ ((unsigned)&C1RX1B3)*8+5;
// duplicate bit in register C1TX1B3, definition disabled
// static volatile bit TXB1D46              @ ((unsigned)&C1RX1B3)*8+6;
// duplicate bit in register C1TX1B3, definition disabled
// static volatile bit TXB1D47              @ ((unsigned)&C1RX1B3)*8+7;
// duplicate bit in register C1TX1B3, definition disabled
// static volatile bit TXB1D50              @ ((unsigned)&C1RX1B3)*8+8;
// duplicate bit in register C1TX1B3, definition disabled
// static volatile bit TXB1D51              @ ((unsigned)&C1RX1B3)*8+9;
// duplicate bit in register C1TX1B3, definition disabled
// static volatile bit TXB1D52              @ ((unsigned)&C1RX1B3)*8+10;
// duplicate bit in register C1TX1B3, definition disabled
// static volatile bit TXB1D53              @ ((unsigned)&C1RX1B3)*8+11;
// duplicate bit in register C1TX1B3, definition disabled
// static volatile bit TXB1D54              @ ((unsigned)&C1RX1B3)*8+12;
// duplicate bit in register C1TX1B3, definition disabled
// static volatile bit TXB1D55              @ ((unsigned)&C1RX1B3)*8+13;
// duplicate bit in register C1TX1B3, definition disabled
// static volatile bit TXB1D56              @ ((unsigned)&C1RX1B3)*8+14;
// duplicate bit in register C1TX1B3, definition disabled
// static volatile bit TXB1D57              @ ((unsigned)&C1RX1B3)*8+15;

// Register: C1RX1B4
static volatile unsigned int            C1RX1B4             @ 0x37C;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB1D7              : 8;
        volatile unsigned TXB1D6              : 8;
    };
    struct {
        volatile unsigned TXB1D77             : 1;
        volatile unsigned TXB1D76             : 1;
        volatile unsigned TXB1D75             : 1;
        volatile unsigned TXB1D74             : 1;
        volatile unsigned TXB1D73             : 1;
        volatile unsigned TXB1D72             : 1;
        volatile unsigned TXB1D71             : 1;
        volatile unsigned TXB1D70             : 1;
        volatile unsigned TXB1D67             : 1;
        volatile unsigned TXB1D66             : 1;
        volatile unsigned TXB1D65             : 1;
        volatile unsigned TXB1D64             : 1;
        volatile unsigned TXB1D63             : 1;
        volatile unsigned TXB1D62             : 1;
        volatile unsigned TXB1D61             : 1;
        volatile unsigned TXB1D60             : 1;
    };
} C1RX1B4bits @ 0x37C;
// bit variable definitions
// duplicate bit in register C1TX1B4, definition disabled
// static volatile bit TXB1D60              @ ((unsigned)&C1RX1B4)*8+0;
// duplicate bit in register C1TX1B4, definition disabled
// static volatile bit TXB1D61              @ ((unsigned)&C1RX1B4)*8+1;
// duplicate bit in register C1TX1B4, definition disabled
// static volatile bit TXB1D62              @ ((unsigned)&C1RX1B4)*8+2;
// duplicate bit in register C1TX1B4, definition disabled
// static volatile bit TXB1D63              @ ((unsigned)&C1RX1B4)*8+3;
// duplicate bit in register C1TX1B4, definition disabled
// static volatile bit TXB1D64              @ ((unsigned)&C1RX1B4)*8+4;
// duplicate bit in register C1TX1B4, definition disabled
// static volatile bit TXB1D65              @ ((unsigned)&C1RX1B4)*8+5;
// duplicate bit in register C1TX1B4, definition disabled
// static volatile bit TXB1D66              @ ((unsigned)&C1RX1B4)*8+6;
// duplicate bit in register C1TX1B4, definition disabled
// static volatile bit TXB1D67              @ ((unsigned)&C1RX1B4)*8+7;
// duplicate bit in register C1TX1B4, definition disabled
// static volatile bit TXB1D70              @ ((unsigned)&C1RX1B4)*8+8;
// duplicate bit in register C1TX1B4, definition disabled
// static volatile bit TXB1D71              @ ((unsigned)&C1RX1B4)*8+9;
// duplicate bit in register C1TX1B4, definition disabled
// static volatile bit TXB1D72              @ ((unsigned)&C1RX1B4)*8+10;
// duplicate bit in register C1TX1B4, definition disabled
// static volatile bit TXB1D73              @ ((unsigned)&C1RX1B4)*8+11;
// duplicate bit in register C1TX1B4, definition disabled
// static volatile bit TXB1D74              @ ((unsigned)&C1RX1B4)*8+12;
// duplicate bit in register C1TX1B4, definition disabled
// static volatile bit TXB1D75              @ ((unsigned)&C1RX1B4)*8+13;
// duplicate bit in register C1TX1B4, definition disabled
// static volatile bit TXB1D76              @ ((unsigned)&C1RX1B4)*8+14;
// duplicate bit in register C1TX1B4, definition disabled
// static volatile bit TXB1D77              @ ((unsigned)&C1RX1B4)*8+15;

// Register: C1RX1CON
static volatile unsigned int            C1RX1CON            @ 0x37E;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 8;
        volatile unsigned RXFUL               : 1;
        volatile unsigned                     : 3;
        volatile unsigned RXRTRRO             : 1;
        volatile unsigned FILHIT              : 3;
    };
    struct {
        volatile unsigned                     : 13;
        volatile unsigned FILHIT2             : 1;
        volatile unsigned FILHIT1             : 1;
        volatile unsigned FILHIT0             : 1;
    };
} C1RX1CONbits @ 0x37E;
// bit variable definitions
static volatile bit RXRTRRO              @ ((unsigned)&C1RX1CON)*8+3;
static volatile bit RXFUL                @ ((unsigned)&C1RX1CON)*8+7;
static volatile bit FILHIT0              @ ((unsigned)&C1RX1CON)*8+0;
static volatile bit FILHIT1              @ ((unsigned)&C1RX1CON)*8+1;
static volatile bit FILHIT2              @ ((unsigned)&C1RX1CON)*8+2;

// Register: C1RX0SID
static volatile unsigned int            C1RX0SID            @ 0x380;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 3;
        volatile unsigned SID10               : 1;
        volatile unsigned SID9                : 1;
        volatile unsigned SID8                : 1;
        volatile unsigned SID7                : 1;
        volatile unsigned SID6                : 1;
        volatile unsigned SID5                : 1;
        volatile unsigned SID4                : 1;
        volatile unsigned SID3                : 1;
        volatile unsigned SID2                : 1;
        volatile unsigned SID1                : 1;
        volatile unsigned SID0                : 1;
        volatile unsigned SRR                 : 1;
        volatile unsigned TXIDE               : 1;
    };
} C1RX0SIDbits @ 0x380;
// bit variable definitions
// duplicate bit in register C1TX2SID, definition disabled
// static volatile bit TXIDE                @ ((unsigned)&C1RX0SID)*8+0;
// duplicate bit in register C1TX2SID, definition disabled
// static volatile bit SRR                  @ ((unsigned)&C1RX0SID)*8+1;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID0                 @ ((unsigned)&C1RX0SID)*8+2;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID1                 @ ((unsigned)&C1RX0SID)*8+3;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID2                 @ ((unsigned)&C1RX0SID)*8+4;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID3                 @ ((unsigned)&C1RX0SID)*8+5;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID4                 @ ((unsigned)&C1RX0SID)*8+6;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID5                 @ ((unsigned)&C1RX0SID)*8+7;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID6                 @ ((unsigned)&C1RX0SID)*8+8;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID7                 @ ((unsigned)&C1RX0SID)*8+9;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID8                 @ ((unsigned)&C1RX0SID)*8+10;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID9                 @ ((unsigned)&C1RX0SID)*8+11;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID10                @ ((unsigned)&C1RX0SID)*8+12;

// Register: C1RX0EID
static volatile unsigned int            C1RX0EID            @ 0x382;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 4;
        volatile unsigned EID17               : 1;
        volatile unsigned EID16               : 1;
        volatile unsigned EID15               : 1;
        volatile unsigned EID14               : 1;
        volatile unsigned EID13               : 1;
        volatile unsigned EID12               : 1;
        volatile unsigned EID11               : 1;
        volatile unsigned EID10               : 1;
        volatile unsigned EID9                : 1;
        volatile unsigned EID8                : 1;
        volatile unsigned EID7                : 1;
        volatile unsigned EID6                : 1;
    };
} C1RX0EIDbits @ 0x382;
// bit variable definitions
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID6                 @ ((unsigned)&C1RX0EID)*8+0;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID7                 @ ((unsigned)&C1RX0EID)*8+1;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID8                 @ ((unsigned)&C1RX0EID)*8+2;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID9                 @ ((unsigned)&C1RX0EID)*8+3;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID10                @ ((unsigned)&C1RX0EID)*8+4;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID11                @ ((unsigned)&C1RX0EID)*8+5;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID12                @ ((unsigned)&C1RX0EID)*8+6;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID13                @ ((unsigned)&C1RX0EID)*8+7;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID14                @ ((unsigned)&C1RX0EID)*8+8;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID15                @ ((unsigned)&C1RX0EID)*8+9;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID16                @ ((unsigned)&C1RX0EID)*8+10;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID17                @ ((unsigned)&C1RX0EID)*8+11;

