Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: C1RX0DLC
static volatile unsigned int            C1RX0DLC            @ 0x384;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned EID5                : 1;
        volatile unsigned EID4                : 1;
        volatile unsigned EID3                : 1;
        volatile unsigned EID2                : 1;
        volatile unsigned EID1                : 1;
        volatile unsigned EID0                : 1;
        volatile unsigned RXRTR               : 1;
        volatile unsigned RXRB1               : 1;
        volatile unsigned                     : 3;
        volatile unsigned RXRB0               : 1;
        volatile unsigned DLC                 : 4;
    };
    struct {
        volatile unsigned                     : 12;
        volatile unsigned DLC3                : 1;
        volatile unsigned DLC2                : 1;
        volatile unsigned DLC1                : 1;
        volatile unsigned DLC0                : 1;
    };
} C1RX0DLCbits @ 0x384;
// bit variable definitions
// duplicate bit in register C1RX1DLC, definition disabled
// static volatile bit RXRB0                @ ((unsigned)&C1RX0DLC)*8+4;
// duplicate bit in register C1RX1DLC, definition disabled
// static volatile bit RXRB1                @ ((unsigned)&C1RX0DLC)*8+8;
// duplicate bit in register C1RX1DLC, definition disabled
// static volatile bit RXRTR                @ ((unsigned)&C1RX0DLC)*8+9;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID0                 @ ((unsigned)&C1RX0DLC)*8+10;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID1                 @ ((unsigned)&C1RX0DLC)*8+11;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID2                 @ ((unsigned)&C1RX0DLC)*8+12;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID3                 @ ((unsigned)&C1RX0DLC)*8+13;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID4                 @ ((unsigned)&C1RX0DLC)*8+14;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID5                 @ ((unsigned)&C1RX0DLC)*8+15;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC0                 @ ((unsigned)&C1RX0DLC)*8+0;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC1                 @ ((unsigned)&C1RX0DLC)*8+1;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC2                 @ ((unsigned)&C1RX0DLC)*8+2;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC3                 @ ((unsigned)&C1RX0DLC)*8+3;

// Register: C1RX0B1
static volatile unsigned int            C1RX0B1             @ 0x386;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB0D1              : 8;
        volatile unsigned TXB0D0              : 8;
    };
    struct {
        volatile unsigned TXB0D17             : 1;
        volatile unsigned TXB0D16             : 1;
        volatile unsigned TXB0D15             : 1;
        volatile unsigned TXB0D14             : 1;
        volatile unsigned TXB0D13             : 1;
        volatile unsigned TXB0D12             : 1;
        volatile unsigned TXB0D11             : 1;
        volatile unsigned TXB0D10             : 1;
        volatile unsigned TXB0D07             : 1;
        volatile unsigned TXB0D06             : 1;
        volatile unsigned TXB0D05             : 1;
        volatile unsigned TXB0D04             : 1;
        volatile unsigned TXB0D03             : 1;
        volatile unsigned TXB0D02             : 1;
        volatile unsigned TXB0D01             : 1;
        volatile unsigned TXB0D00             : 1;
    };
} C1RX0B1bits @ 0x386;
// bit variable definitions
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D00              @ ((unsigned)&C1RX0B1)*8+0;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D01              @ ((unsigned)&C1RX0B1)*8+1;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D02              @ ((unsigned)&C1RX0B1)*8+2;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D03              @ ((unsigned)&C1RX0B1)*8+3;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D04              @ ((unsigned)&C1RX0B1)*8+4;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D05              @ ((unsigned)&C1RX0B1)*8+5;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D06              @ ((unsigned)&C1RX0B1)*8+6;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D07              @ ((unsigned)&C1RX0B1)*8+7;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D10              @ ((unsigned)&C1RX0B1)*8+8;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D11              @ ((unsigned)&C1RX0B1)*8+9;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D12              @ ((unsigned)&C1RX0B1)*8+10;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D13              @ ((unsigned)&C1RX0B1)*8+11;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D14              @ ((unsigned)&C1RX0B1)*8+12;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D15              @ ((unsigned)&C1RX0B1)*8+13;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D16              @ ((unsigned)&C1RX0B1)*8+14;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D17              @ ((unsigned)&C1RX0B1)*8+15;

// Register: C1RX0B2
static volatile unsigned int            C1RX0B2             @ 0x388;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB0D3              : 8;
        volatile unsigned TXB0D2              : 8;
    };
    struct {
        volatile unsigned TXB0D37             : 1;
        volatile unsigned TXB0D36             : 1;
        volatile unsigned TXB0D35             : 1;
        volatile unsigned TXB0D34             : 1;
        volatile unsigned TXB0D33             : 1;
        volatile unsigned TXB0D32             : 1;
        volatile unsigned TXB0D31             : 1;
        volatile unsigned TXB0D30             : 1;
        volatile unsigned TXB0D27             : 1;
        volatile unsigned TXB0D26             : 1;
        volatile unsigned TXB0D25             : 1;
        volatile unsigned TXB0D24             : 1;
        volatile unsigned TXB0D23             : 1;
        volatile unsigned TXB0D22             : 1;
        volatile unsigned TXB0D21             : 1;
        volatile unsigned TXB0D20             : 1;
    };
} C1RX0B2bits @ 0x388;
// bit variable definitions
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D20              @ ((unsigned)&C1RX0B2)*8+0;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D21              @ ((unsigned)&C1RX0B2)*8+1;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D22              @ ((unsigned)&C1RX0B2)*8+2;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D23              @ ((unsigned)&C1RX0B2)*8+3;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D24              @ ((unsigned)&C1RX0B2)*8+4;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D25              @ ((unsigned)&C1RX0B2)*8+5;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D26              @ ((unsigned)&C1RX0B2)*8+6;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D27              @ ((unsigned)&C1RX0B2)*8+7;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D30              @ ((unsigned)&C1RX0B2)*8+8;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D31              @ ((unsigned)&C1RX0B2)*8+9;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D32              @ ((unsigned)&C1RX0B2)*8+10;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D33              @ ((unsigned)&C1RX0B2)*8+11;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D34              @ ((unsigned)&C1RX0B2)*8+12;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D35              @ ((unsigned)&C1RX0B2)*8+13;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D36              @ ((unsigned)&C1RX0B2)*8+14;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D37              @ ((unsigned)&C1RX0B2)*8+15;

// Register: C1RX0B3
static volatile unsigned int            C1RX0B3             @ 0x38A;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB0D5              : 8;
        volatile unsigned TXB0D4              : 8;
    };
    struct {
        volatile unsigned TXB0D57             : 1;
        volatile unsigned TXB0D56             : 1;
        volatile unsigned TXB0D55             : 1;
        volatile unsigned TXB0D54             : 1;
        volatile unsigned TXB0D53             : 1;
        volatile unsigned TXB0D52             : 1;
        volatile unsigned TXB0D51             : 1;
        volatile unsigned TXB0D50             : 1;
        volatile unsigned TXB0D47             : 1;
        volatile unsigned TXB0D46             : 1;
        volatile unsigned TXB0D45             : 1;
        volatile unsigned TXB0D44             : 1;
        volatile unsigned TXB0D43             : 1;
        volatile unsigned TXB0D42             : 1;
        volatile unsigned TXB0D41             : 1;
        volatile unsigned TXB0D40             : 1;
    };
} C1RX0B3bits @ 0x38A;
// bit variable definitions
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D40              @ ((unsigned)&C1RX0B3)*8+0;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D41              @ ((unsigned)&C1RX0B3)*8+1;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D42              @ ((unsigned)&C1RX0B3)*8+2;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D43              @ ((unsigned)&C1RX0B3)*8+3;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D44              @ ((unsigned)&C1RX0B3)*8+4;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D45              @ ((unsigned)&C1RX0B3)*8+5;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D46              @ ((unsigned)&C1RX0B3)*8+6;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D47              @ ((unsigned)&C1RX0B3)*8+7;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D50              @ ((unsigned)&C1RX0B3)*8+8;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D51              @ ((unsigned)&C1RX0B3)*8+9;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D52              @ ((unsigned)&C1RX0B3)*8+10;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D53              @ ((unsigned)&C1RX0B3)*8+11;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D54              @ ((unsigned)&C1RX0B3)*8+12;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D55              @ ((unsigned)&C1RX0B3)*8+13;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D56              @ ((unsigned)&C1RX0B3)*8+14;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D57              @ ((unsigned)&C1RX0B3)*8+15;

// Register: C1RX0B4
static volatile unsigned int            C1RX0B4             @ 0x38C;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB0D7              : 8;
        volatile unsigned TXB0D6              : 8;
    };
    struct {
        volatile unsigned TXB0D77             : 1;
        volatile unsigned TXB0D76             : 1;
        volatile unsigned TXB0D75             : 1;
        volatile unsigned TXB0D74             : 1;
        volatile unsigned TXB0D73             : 1;
        volatile unsigned TXB0D72             : 1;
        volatile unsigned TXB0D71             : 1;
        volatile unsigned TXB0D70             : 1;
        volatile unsigned TXB0D67             : 1;
        volatile unsigned TXB0D66             : 1;
        volatile unsigned TXB0D65             : 1;
        volatile unsigned TXB0D64             : 1;
        volatile unsigned TXB0D63             : 1;
        volatile unsigned TXB0D62             : 1;
        volatile unsigned TXB0D61             : 1;
        volatile unsigned TXB0D60             : 1;
    };
} C1RX0B4bits @ 0x38C;
// bit variable definitions
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D60              @ ((unsigned)&C1RX0B4)*8+0;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D61              @ ((unsigned)&C1RX0B4)*8+1;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D62              @ ((unsigned)&C1RX0B4)*8+2;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D63              @ ((unsigned)&C1RX0B4)*8+3;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D64              @ ((unsigned)&C1RX0B4)*8+4;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D65              @ ((unsigned)&C1RX0B4)*8+5;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D66              @ ((unsigned)&C1RX0B4)*8+6;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D67              @ ((unsigned)&C1RX0B4)*8+7;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D70              @ ((unsigned)&C1RX0B4)*8+8;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D71              @ ((unsigned)&C1RX0B4)*8+9;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D72              @ ((unsigned)&C1RX0B4)*8+10;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D73              @ ((unsigned)&C1RX0B4)*8+11;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D74              @ ((unsigned)&C1RX0B4)*8+12;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D75              @ ((unsigned)&C1RX0B4)*8+13;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D76              @ ((unsigned)&C1RX0B4)*8+14;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D77              @ ((unsigned)&C1RX0B4)*8+15;

// Register: C1RX0CON
static volatile unsigned int            C1RX0CON            @ 0x38E;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 8;
        volatile unsigned RXFUL               : 1;
        volatile unsigned                     : 3;
        volatile unsigned RXRTRRO             : 1;
        volatile unsigned RXB0DBEN            : 1;
        volatile unsigned JTOFF               : 1;
        volatile unsigned FILHIT              : 1;
    };
} C1RX0CONbits @ 0x38E;
// bit variable definitions
static volatile bit FILHIT               @ ((unsigned)&C1RX0CON)*8+0;
static volatile bit JTOFF                @ ((unsigned)&C1RX0CON)*8+1;
static volatile bit RXB0DBEN             @ ((unsigned)&C1RX0CON)*8+2;
// duplicate bit in register C1RX1CON, definition disabled
// static volatile bit RXRTRRO              @ ((unsigned)&C1RX0CON)*8+3;
// duplicate bit in register C1RX1CON, definition disabled
// static volatile bit RXFUL                @ ((unsigned)&C1RX0CON)*8+7;

// Register: C1CTRL
static volatile unsigned int            C1CTRL              @ 0x390;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned CANCAP              : 1;
        volatile unsigned CANFRZ              : 1;
        volatile unsigned CANSIDL             : 1;
        volatile unsigned ABAT                : 1;
        volatile unsigned CANCKS              : 1;
        volatile unsigned REQOP               : 3;
        volatile unsigned OPMODE              : 3;
        volatile unsigned                     : 1;
        volatile unsigned ICOD                : 3;
        volatile unsigned                     : 1;
    };
    struct {
        volatile unsigned                     : 4;
        volatile unsigned                     : 1;
        volatile unsigned REQOP2              : 1;
        volatile unsigned REQOP1              : 1;
        volatile unsigned REQOP0              : 1;
        volatile unsigned OPMODE2             : 1;
        volatile unsigned OPMODE1             : 1;
        volatile unsigned OPMODE0             : 1;
        volatile unsigned                     : 1;
        volatile unsigned ICOD2               : 1;
        volatile unsigned ICOD1               : 1;
        volatile unsigned ICOD0               : 1;
        volatile unsigned                     : 1;
    };
} C1CTRLbits @ 0x390;
// bit variable definitions
static volatile bit CANCKS               @ ((unsigned)&C1CTRL)*8+11;
static volatile bit ABAT                 @ ((unsigned)&C1CTRL)*8+12;
static volatile bit CANSIDL              @ ((unsigned)&C1CTRL)*8+13;
static volatile bit CANFRZ               @ ((unsigned)&C1CTRL)*8+14;
static volatile bit CANCAP               @ ((unsigned)&C1CTRL)*8+15;
static volatile bit ICOD0                @ ((unsigned)&C1CTRL)*8+1;
static volatile bit ICOD1                @ ((unsigned)&C1CTRL)*8+2;
static volatile bit ICOD2                @ ((unsigned)&C1CTRL)*8+3;
static volatile bit OPMODE0              @ ((unsigned)&C1CTRL)*8+5;
static volatile bit OPMODE1              @ ((unsigned)&C1CTRL)*8+6;
static volatile bit OPMODE2              @ ((unsigned)&C1CTRL)*8+7;
static volatile bit REQOP0               @ ((unsigned)&C1CTRL)*8+8;
static volatile bit REQOP1               @ ((unsigned)&C1CTRL)*8+9;
static volatile bit REQOP2               @ ((unsigned)&C1CTRL)*8+10;

// Register: C1CFG1
static volatile unsigned int            C1CFG1              @ 0x392;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 8;
        volatile unsigned SJW                 : 2;
        volatile unsigned BRP                 : 6;
    };
    struct {
        volatile unsigned                     : 8;
        volatile unsigned SJW1                : 1;
        volatile unsigned SJW0                : 1;
        volatile unsigned BRP5                : 1;
        volatile unsigned BRP4                : 1;
        volatile unsigned BRP3                : 1;
        volatile unsigned BRP2                : 1;
        volatile unsigned BRP1                : 1;
        volatile unsigned BRP0                : 1;
    };
} C1CFG1bits @ 0x392;
// bit variable definitions
static volatile bit BRP0                 @ ((unsigned)&C1CFG1)*8+0;
static volatile bit BRP1                 @ ((unsigned)&C1CFG1)*8+1;
static volatile bit BRP2                 @ ((unsigned)&C1CFG1)*8+2;
static volatile bit BRP3                 @ ((unsigned)&C1CFG1)*8+3;
static volatile bit BRP4                 @ ((unsigned)&C1CFG1)*8+4;
static volatile bit BRP5                 @ ((unsigned)&C1CFG1)*8+5;
static volatile bit SJW0                 @ ((unsigned)&C1CFG1)*8+6;
static volatile bit SJW1                 @ ((unsigned)&C1CFG1)*8+7;

// Register: C1CFG2
static volatile unsigned int            C1CFG2              @ 0x394;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 1;
        volatile unsigned WAKFIL              : 1;
        volatile unsigned                     : 3;
        volatile unsigned SEG2PH              : 3;
        volatile unsigned SEG2PHTS            : 1;
        volatile unsigned SAM                 : 1;
        volatile unsigned SEG1PH              : 3;
        volatile unsigned PRSEG               : 3;
    };
    struct {
        volatile unsigned                     : 5;
        volatile unsigned SEG2PH2             : 1;
        volatile unsigned SEG2PH1             : 1;
        volatile unsigned SEG2PH0             : 1;
        volatile unsigned                     : 2;
        volatile unsigned SEG1PH2             : 1;
        volatile unsigned SEG1PH1             : 1;
        volatile unsigned SEG1PH0             : 1;
        volatile unsigned PRSEG2              : 1;
        volatile unsigned PRSEG1              : 1;
        volatile unsigned PRSEG0              : 1;
    };
} C1CFG2bits @ 0x394;
// bit variable definitions
static volatile bit SAM                  @ ((unsigned)&C1CFG2)*8+6;
static volatile bit SEG2PHTS             @ ((unsigned)&C1CFG2)*8+7;
static volatile bit WAKFIL               @ ((unsigned)&C1CFG2)*8+14;
static volatile bit PRSEG0               @ ((unsigned)&C1CFG2)*8+0;
static volatile bit PRSEG1               @ ((unsigned)&C1CFG2)*8+1;
static volatile bit PRSEG2               @ ((unsigned)&C1CFG2)*8+2;
static volatile bit SEG1PH0              @ ((unsigned)&C1CFG2)*8+3;
static volatile bit SEG1PH1              @ ((unsigned)&C1CFG2)*8+4;
static volatile bit SEG1PH2              @ ((unsigned)&C1CFG2)*8+5;
static volatile bit SEG2PH0              @ ((unsigned)&C1CFG2)*8+8;
static volatile bit SEG2PH1              @ ((unsigned)&C1CFG2)*8+9;
static volatile bit SEG2PH2              @ ((unsigned)&C1CFG2)*8+10;

