Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: C1INTF
static volatile unsigned int            C1INTF              @ 0x396;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned RXB0OVFL            : 1;
        volatile unsigned RXB1OVFL            : 1;
        volatile unsigned TXBO                : 1;
        volatile unsigned TXBP                : 1;
        volatile unsigned RXBP                : 1;
        volatile unsigned TXWARN              : 1;
        volatile unsigned RXWARN              : 1;
        volatile unsigned EWARN               : 1;
        volatile unsigned IRXIF               : 1;
        volatile unsigned WAKIF               : 1;
        volatile unsigned ERRIF               : 1;
        volatile unsigned TXB2IF              : 1;
        volatile unsigned TXB1IF              : 1;
        volatile unsigned TXB0IF              : 1;
        volatile unsigned RXB1IF              : 1;
        volatile unsigned RXB0IF              : 1;
    };
} C1INTFbits @ 0x396;
// bit variable definitions
static volatile bit RXB0IF               @ ((unsigned)&C1INTF)*8+0;
static volatile bit RXB1IF               @ ((unsigned)&C1INTF)*8+1;
static volatile bit TXB0IF               @ ((unsigned)&C1INTF)*8+2;
static volatile bit TXB1IF               @ ((unsigned)&C1INTF)*8+3;
static volatile bit TXB2IF               @ ((unsigned)&C1INTF)*8+4;
static volatile bit ERRIF                @ ((unsigned)&C1INTF)*8+5;
static volatile bit WAKIF                @ ((unsigned)&C1INTF)*8+6;
static volatile bit IRXIF                @ ((unsigned)&C1INTF)*8+7;
static volatile bit EWARN                @ ((unsigned)&C1INTF)*8+8;
static volatile bit RXWARN               @ ((unsigned)&C1INTF)*8+9;
static volatile bit TXWARN               @ ((unsigned)&C1INTF)*8+10;
static volatile bit RXBP                 @ ((unsigned)&C1INTF)*8+11;
static volatile bit TXBP                 @ ((unsigned)&C1INTF)*8+12;
static volatile bit TXBO                 @ ((unsigned)&C1INTF)*8+13;
static volatile bit RXB1OVFL             @ ((unsigned)&C1INTF)*8+14;
static volatile bit RXB0OVFL             @ ((unsigned)&C1INTF)*8+15;

// Register: C1INTE
static volatile unsigned int            C1INTE              @ 0x398;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 8;
        volatile unsigned IRXIE               : 1;
        volatile unsigned WAKIE               : 1;
        volatile unsigned ERRIE               : 1;
        volatile unsigned TXB2IE              : 1;
        volatile unsigned TXB1IE              : 1;
        volatile unsigned TXB0IE              : 1;
        volatile unsigned RXB1IE              : 1;
        volatile unsigned RXB0IE              : 1;
    };
} C1INTEbits @ 0x398;
// bit variable definitions
static volatile bit RXB0IE               @ ((unsigned)&C1INTE)*8+0;
static volatile bit RXB1IE               @ ((unsigned)&C1INTE)*8+1;
static volatile bit TXB0IE               @ ((unsigned)&C1INTE)*8+2;
static volatile bit TXB1IE               @ ((unsigned)&C1INTE)*8+3;
static volatile bit TXB2IE               @ ((unsigned)&C1INTE)*8+4;
static volatile bit ERRIE                @ ((unsigned)&C1INTE)*8+5;
static volatile bit WAKIE                @ ((unsigned)&C1INTE)*8+6;
static volatile bit IRXIE                @ ((unsigned)&C1INTE)*8+7;

// Register: C1EC
static volatile unsigned int            C1EC                @ 0x39A;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TEC                 : 8;
        volatile unsigned REC                 : 8;
    };
    struct {
        volatile unsigned TEC7                : 1;
        volatile unsigned TEC6                : 1;
        volatile unsigned TEC5                : 1;
        volatile unsigned TEC4                : 1;
        volatile unsigned TEC3                : 1;
        volatile unsigned TEC2                : 1;
        volatile unsigned TEC1                : 1;
        volatile unsigned TEC0                : 1;
        volatile unsigned REC7                : 1;
        volatile unsigned REC6                : 1;
        volatile unsigned REC5                : 1;
        volatile unsigned REC4                : 1;
        volatile unsigned REC3                : 1;
        volatile unsigned REC2                : 1;
        volatile unsigned REC1                : 1;
        volatile unsigned REC0                : 1;
    };
} C1ECbits @ 0x39A;
// bit variable definitions
static volatile bit REC0                 @ ((unsigned)&C1EC)*8+0;
static volatile bit REC1                 @ ((unsigned)&C1EC)*8+1;
static volatile bit REC2                 @ ((unsigned)&C1EC)*8+2;
static volatile bit REC3                 @ ((unsigned)&C1EC)*8+3;
static volatile bit REC4                 @ ((unsigned)&C1EC)*8+4;
static volatile bit REC5                 @ ((unsigned)&C1EC)*8+5;
static volatile bit REC6                 @ ((unsigned)&C1EC)*8+6;
static volatile bit REC7                 @ ((unsigned)&C1EC)*8+7;
static volatile bit TEC0                 @ ((unsigned)&C1EC)*8+8;
static volatile bit TEC1                 @ ((unsigned)&C1EC)*8+9;
static volatile bit TEC2                 @ ((unsigned)&C1EC)*8+10;
static volatile bit TEC3                 @ ((unsigned)&C1EC)*8+11;
static volatile bit TEC4                 @ ((unsigned)&C1EC)*8+12;
static volatile bit TEC5                 @ ((unsigned)&C1EC)*8+13;
static volatile bit TEC6                 @ ((unsigned)&C1EC)*8+14;
static volatile bit TEC7                 @ ((unsigned)&C1EC)*8+15;

// Register: C2RXF0SID
static volatile unsigned int            C2RXF0SID           @ 0x3C0;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 3;
        volatile unsigned SID10               : 1;
        volatile unsigned SID9                : 1;
        volatile unsigned SID8                : 1;
        volatile unsigned SID7                : 1;
        volatile unsigned SID6                : 1;
        volatile unsigned SID5                : 1;
        volatile unsigned SID4                : 1;
        volatile unsigned SID3                : 1;
        volatile unsigned SID2                : 1;
        volatile unsigned SID1                : 1;
        volatile unsigned SID0                : 1;
        volatile unsigned                     : 1;
        volatile unsigned EXIDE               : 1;
    };
} C2RXF0SIDbits @ 0x3C0;
// bit variable definitions
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit EXIDE                @ ((unsigned)&C2RXF0SID)*8+0;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID0                 @ ((unsigned)&C2RXF0SID)*8+2;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID1                 @ ((unsigned)&C2RXF0SID)*8+3;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID2                 @ ((unsigned)&C2RXF0SID)*8+4;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID3                 @ ((unsigned)&C2RXF0SID)*8+5;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID4                 @ ((unsigned)&C2RXF0SID)*8+6;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID5                 @ ((unsigned)&C2RXF0SID)*8+7;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID6                 @ ((unsigned)&C2RXF0SID)*8+8;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID7                 @ ((unsigned)&C2RXF0SID)*8+9;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID8                 @ ((unsigned)&C2RXF0SID)*8+10;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID9                 @ ((unsigned)&C2RXF0SID)*8+11;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID10                @ ((unsigned)&C2RXF0SID)*8+12;

