Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: C2TX2SID
static volatile unsigned int            C2TX2SID            @ 0x400;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned SID10               : 1;
        volatile unsigned SID9                : 1;
        volatile unsigned SID8                : 1;
        volatile unsigned SID7                : 1;
        volatile unsigned SID6                : 1;
        volatile unsigned                     : 3;
        volatile unsigned SID5                : 1;
        volatile unsigned SID4                : 1;
        volatile unsigned SID3                : 1;
        volatile unsigned SID2                : 1;
        volatile unsigned SID1                : 1;
        volatile unsigned SID0                : 1;
        volatile unsigned SRR                 : 1;
        volatile unsigned TXIDE               : 1;
    };
} C2TX2SIDbits @ 0x400;
// bit variable definitions
// duplicate bit in register C1TX2SID, definition disabled
// static volatile bit TXIDE                @ ((unsigned)&C2TX2SID)*8+0;
// duplicate bit in register C1TX2SID, definition disabled
// static volatile bit SRR                  @ ((unsigned)&C2TX2SID)*8+1;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID0                 @ ((unsigned)&C2TX2SID)*8+2;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID1                 @ ((unsigned)&C2TX2SID)*8+3;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID2                 @ ((unsigned)&C2TX2SID)*8+4;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID3                 @ ((unsigned)&C2TX2SID)*8+5;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID4                 @ ((unsigned)&C2TX2SID)*8+6;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID5                 @ ((unsigned)&C2TX2SID)*8+7;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID6                 @ ((unsigned)&C2TX2SID)*8+11;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID7                 @ ((unsigned)&C2TX2SID)*8+12;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID8                 @ ((unsigned)&C2TX2SID)*8+13;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID9                 @ ((unsigned)&C2TX2SID)*8+14;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID10                @ ((unsigned)&C2TX2SID)*8+15;

// Register: C2TX2EID
static volatile unsigned int            C2TX2EID            @ 0x402;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned EID17               : 1;
        volatile unsigned EID16               : 1;
        volatile unsigned EID15               : 1;
        volatile unsigned EID14               : 1;
        volatile unsigned                     : 4;
        volatile unsigned EID13               : 1;
        volatile unsigned EID12               : 1;
        volatile unsigned EID11               : 1;
        volatile unsigned EID10               : 1;
        volatile unsigned EID9                : 1;
        volatile unsigned EID8                : 1;
        volatile unsigned EID7                : 1;
        volatile unsigned EID6                : 1;
    };
} C2TX2EIDbits @ 0x402;
// bit variable definitions
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID6                 @ ((unsigned)&C2TX2EID)*8+0;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID7                 @ ((unsigned)&C2TX2EID)*8+1;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID8                 @ ((unsigned)&C2TX2EID)*8+2;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID9                 @ ((unsigned)&C2TX2EID)*8+3;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID10                @ ((unsigned)&C2TX2EID)*8+4;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID11                @ ((unsigned)&C2TX2EID)*8+5;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID12                @ ((unsigned)&C2TX2EID)*8+6;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID13                @ ((unsigned)&C2TX2EID)*8+7;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID14                @ ((unsigned)&C2TX2EID)*8+12;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID15                @ ((unsigned)&C2TX2EID)*8+13;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID16                @ ((unsigned)&C2TX2EID)*8+14;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID17                @ ((unsigned)&C2TX2EID)*8+15;

// Register: C2TX2DLC
static volatile unsigned int            C2TX2DLC            @ 0x404;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned EID5                : 1;
        volatile unsigned EID4                : 1;
        volatile unsigned EID3                : 1;
        volatile unsigned EID2                : 1;
        volatile unsigned EID1                : 1;
        volatile unsigned EID0                : 1;
        volatile unsigned TXRTR               : 1;
        volatile unsigned TXRB1               : 1;
        volatile unsigned TXRB0               : 1;
        volatile unsigned DLC                 : 4;
        volatile unsigned                     : 3;
    };
    struct {
        volatile unsigned                     : 9;
        volatile unsigned DLC3                : 1;
        volatile unsigned DLC2                : 1;
        volatile unsigned DLC1                : 1;
        volatile unsigned DLC0                : 1;
        volatile unsigned                     : 3;
    };
} C2TX2DLCbits @ 0x404;
// bit variable definitions
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit TXRB0                @ ((unsigned)&C2TX2DLC)*8+7;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit TXRB1                @ ((unsigned)&C2TX2DLC)*8+8;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit TXRTR                @ ((unsigned)&C2TX2DLC)*8+9;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID0                 @ ((unsigned)&C2TX2DLC)*8+10;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID1                 @ ((unsigned)&C2TX2DLC)*8+11;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID2                 @ ((unsigned)&C2TX2DLC)*8+12;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID3                 @ ((unsigned)&C2TX2DLC)*8+13;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID4                 @ ((unsigned)&C2TX2DLC)*8+14;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID5                 @ ((unsigned)&C2TX2DLC)*8+15;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC0                 @ ((unsigned)&C2TX2DLC)*8+3;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC1                 @ ((unsigned)&C2TX2DLC)*8+4;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC2                 @ ((unsigned)&C2TX2DLC)*8+5;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC3                 @ ((unsigned)&C2TX2DLC)*8+6;

// Register: C2TX2B1
static volatile unsigned int            C2TX2B1             @ 0x406;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB2D1              : 8;
        volatile unsigned TXB2D0              : 8;
    };
    struct {
        volatile unsigned TXB2D17             : 1;
        volatile unsigned TXB2D16             : 1;
        volatile unsigned TXB2D15             : 1;
        volatile unsigned TXB2D14             : 1;
        volatile unsigned TXB2D13             : 1;
        volatile unsigned TXB2D12             : 1;
        volatile unsigned TXB2D11             : 1;
        volatile unsigned TXB2D10             : 1;
        volatile unsigned TXB2D07             : 1;
        volatile unsigned TXB2D06             : 1;
        volatile unsigned TXB2D05             : 1;
        volatile unsigned TXB2D04             : 1;
        volatile unsigned TXB2D03             : 1;
        volatile unsigned TXB2D02             : 1;
        volatile unsigned TXB2D01             : 1;
        volatile unsigned TXB2D00             : 1;
    };
} C2TX2B1bits @ 0x406;
// bit variable definitions
// duplicate bit in register C1TX2B1, definition disabled
// static volatile bit TXB2D00              @ ((unsigned)&C2TX2B1)*8+0;
// duplicate bit in register C1TX2B1, definition disabled
// static volatile bit TXB2D01              @ ((unsigned)&C2TX2B1)*8+1;
// duplicate bit in register C1TX2B1, definition disabled
// static volatile bit TXB2D02              @ ((unsigned)&C2TX2B1)*8+2;
// duplicate bit in register C1TX2B1, definition disabled
// static volatile bit TXB2D03              @ ((unsigned)&C2TX2B1)*8+3;
// duplicate bit in register C1TX2B1, definition disabled
// static volatile bit TXB2D04              @ ((unsigned)&C2TX2B1)*8+4;
// duplicate bit in register C1TX2B1, definition disabled
// static volatile bit TXB2D05              @ ((unsigned)&C2TX2B1)*8+5;
// duplicate bit in register C1TX2B1, definition disabled
// static volatile bit TXB2D06              @ ((unsigned)&C2TX2B1)*8+6;
// duplicate bit in register C1TX2B1, definition disabled
// static volatile bit TXB2D07              @ ((unsigned)&C2TX2B1)*8+7;
// duplicate bit in register C1TX2B1, definition disabled
// static volatile bit TXB2D10              @ ((unsigned)&C2TX2B1)*8+8;
// duplicate bit in register C1TX2B1, definition disabled
// static volatile bit TXB2D11              @ ((unsigned)&C2TX2B1)*8+9;
// duplicate bit in register C1TX2B1, definition disabled
// static volatile bit TXB2D12              @ ((unsigned)&C2TX2B1)*8+10;
// duplicate bit in register C1TX2B1, definition disabled
// static volatile bit TXB2D13              @ ((unsigned)&C2TX2B1)*8+11;
// duplicate bit in register C1TX2B1, definition disabled
// static volatile bit TXB2D14              @ ((unsigned)&C2TX2B1)*8+12;
// duplicate bit in register C1TX2B1, definition disabled
// static volatile bit TXB2D15              @ ((unsigned)&C2TX2B1)*8+13;
// duplicate bit in register C1TX2B1, definition disabled
// static volatile bit TXB2D16              @ ((unsigned)&C2TX2B1)*8+14;
// duplicate bit in register C1TX2B1, definition disabled
// static volatile bit TXB2D17              @ ((unsigned)&C2TX2B1)*8+15;

// Register: C2TX2B2
static volatile unsigned int            C2TX2B2             @ 0x408;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB2D3              : 8;
        volatile unsigned TXB2D2              : 8;
    };
    struct {
        volatile unsigned TXB2D37             : 1;
        volatile unsigned TXB2D36             : 1;
        volatile unsigned TXB2D35             : 1;
        volatile unsigned TXB2D34             : 1;
        volatile unsigned TXB2D33             : 1;
        volatile unsigned TXB2D32             : 1;
        volatile unsigned TXB2D31             : 1;
        volatile unsigned TXB2D30             : 1;
        volatile unsigned TXB2D27             : 1;
        volatile unsigned TXB2D26             : 1;
        volatile unsigned TXB2D25             : 1;
        volatile unsigned TXB2D24             : 1;
        volatile unsigned TXB2D23             : 1;
        volatile unsigned TXB2D22             : 1;
        volatile unsigned TXB2D21             : 1;
        volatile unsigned TXB2D20             : 1;
    };
} C2TX2B2bits @ 0x408;
// bit variable definitions
// duplicate bit in register C1TX2B2, definition disabled
// static volatile bit TXB2D20              @ ((unsigned)&C2TX2B2)*8+0;
// duplicate bit in register C1TX2B2, definition disabled
// static volatile bit TXB2D21              @ ((unsigned)&C2TX2B2)*8+1;
// duplicate bit in register C1TX2B2, definition disabled
// static volatile bit TXB2D22              @ ((unsigned)&C2TX2B2)*8+2;
// duplicate bit in register C1TX2B2, definition disabled
// static volatile bit TXB2D23              @ ((unsigned)&C2TX2B2)*8+3;
// duplicate bit in register C1TX2B2, definition disabled
// static volatile bit TXB2D24              @ ((unsigned)&C2TX2B2)*8+4;
// duplicate bit in register C1TX2B2, definition disabled
// static volatile bit TXB2D25              @ ((unsigned)&C2TX2B2)*8+5;
// duplicate bit in register C1TX2B2, definition disabled
// static volatile bit TXB2D26              @ ((unsigned)&C2TX2B2)*8+6;
// duplicate bit in register C1TX2B2, definition disabled
// static volatile bit TXB2D27              @ ((unsigned)&C2TX2B2)*8+7;
// duplicate bit in register C1TX2B2, definition disabled
// static volatile bit TXB2D30              @ ((unsigned)&C2TX2B2)*8+8;
// duplicate bit in register C1TX2B2, definition disabled
// static volatile bit TXB2D31              @ ((unsigned)&C2TX2B2)*8+9;
// duplicate bit in register C1TX2B2, definition disabled
// static volatile bit TXB2D32              @ ((unsigned)&C2TX2B2)*8+10;
// duplicate bit in register C1TX2B2, definition disabled
// static volatile bit TXB2D33              @ ((unsigned)&C2TX2B2)*8+11;
// duplicate bit in register C1TX2B2, definition disabled
// static volatile bit TXB2D34              @ ((unsigned)&C2TX2B2)*8+12;
// duplicate bit in register C1TX2B2, definition disabled
// static volatile bit TXB2D35              @ ((unsigned)&C2TX2B2)*8+13;
// duplicate bit in register C1TX2B2, definition disabled
// static volatile bit TXB2D36              @ ((unsigned)&C2TX2B2)*8+14;
// duplicate bit in register C1TX2B2, definition disabled
// static volatile bit TXB2D37              @ ((unsigned)&C2TX2B2)*8+15;

// Register: C2TX2B3
static volatile unsigned int            C2TX2B3             @ 0x40A;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB2D5              : 8;
        volatile unsigned TXB2D4              : 8;
    };
    struct {
        volatile unsigned TXB2D57             : 1;
        volatile unsigned TXB2D56             : 1;
        volatile unsigned TXB2D55             : 1;
        volatile unsigned TXB2D54             : 1;
        volatile unsigned TXB2D53             : 1;
        volatile unsigned TXB2D52             : 1;
        volatile unsigned TXB2D51             : 1;
        volatile unsigned TXB2D50             : 1;
        volatile unsigned TXB2D47             : 1;
        volatile unsigned TXB2D46             : 1;
        volatile unsigned TXB2D45             : 1;
        volatile unsigned TXB2D44             : 1;
        volatile unsigned TXB2D43             : 1;
        volatile unsigned TXB2D42             : 1;
        volatile unsigned TXB2D41             : 1;
        volatile unsigned TXB2D40             : 1;
    };
} C2TX2B3bits @ 0x40A;
// bit variable definitions
static volatile bit TXB2D40              @ ((unsigned)&C2TX2B3)*8+0;
static volatile bit TXB2D41              @ ((unsigned)&C2TX2B3)*8+1;
static volatile bit TXB2D42              @ ((unsigned)&C2TX2B3)*8+2;
static volatile bit TXB2D43              @ ((unsigned)&C2TX2B3)*8+3;
static volatile bit TXB2D44              @ ((unsigned)&C2TX2B3)*8+4;
static volatile bit TXB2D45              @ ((unsigned)&C2TX2B3)*8+5;
static volatile bit TXB2D46              @ ((unsigned)&C2TX2B3)*8+6;
static volatile bit TXB2D47              @ ((unsigned)&C2TX2B3)*8+7;
// duplicate bit in register C1TX2B3, definition disabled
// static volatile bit TXB2D50              @ ((unsigned)&C2TX2B3)*8+8;
// duplicate bit in register C1TX2B3, definition disabled
// static volatile bit TXB2D51              @ ((unsigned)&C2TX2B3)*8+9;
// duplicate bit in register C1TX2B3, definition disabled
// static volatile bit TXB2D52              @ ((unsigned)&C2TX2B3)*8+10;
// duplicate bit in register C1TX2B3, definition disabled
// static volatile bit TXB2D53              @ ((unsigned)&C2TX2B3)*8+11;
// duplicate bit in register C1TX2B3, definition disabled
// static volatile bit TXB2D54              @ ((unsigned)&C2TX2B3)*8+12;
// duplicate bit in register C1TX2B3, definition disabled
// static volatile bit TXB2D55              @ ((unsigned)&C2TX2B3)*8+13;
// duplicate bit in register C1TX2B3, definition disabled
// static volatile bit TXB2D56              @ ((unsigned)&C2TX2B3)*8+14;
// duplicate bit in register C1TX2B3, definition disabled
// static volatile bit TXB2D57              @ ((unsigned)&C2TX2B3)*8+15;

// Register: C2TX2B4
static volatile unsigned int            C2TX2B4             @ 0x40C;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB2D7              : 8;
        volatile unsigned TXB2D6              : 8;
    };
    struct {
        volatile unsigned TXB2D77             : 1;
        volatile unsigned TXB2D76             : 1;
        volatile unsigned TXB2D75             : 1;
        volatile unsigned TXB2D74             : 1;
        volatile unsigned TXB2D73             : 1;
        volatile unsigned TXB2D72             : 1;
        volatile unsigned TXB2D71             : 1;
        volatile unsigned TXB2D70             : 1;
        volatile unsigned TXB2D67             : 1;
        volatile unsigned TXB2D66             : 1;
        volatile unsigned TXB2D65             : 1;
        volatile unsigned TXB2D64             : 1;
        volatile unsigned TXB2D63             : 1;
        volatile unsigned TXB2D62             : 1;
        volatile unsigned TXB2D61             : 1;
        volatile unsigned TXB2D60             : 1;
    };
} C2TX2B4bits @ 0x40C;
// bit variable definitions
static volatile bit TXB2D60              @ ((unsigned)&C2TX2B4)*8+0;
static volatile bit TXB2D61              @ ((unsigned)&C2TX2B4)*8+1;
static volatile bit TXB2D62              @ ((unsigned)&C2TX2B4)*8+2;
static volatile bit TXB2D63              @ ((unsigned)&C2TX2B4)*8+3;
static volatile bit TXB2D64              @ ((unsigned)&C2TX2B4)*8+4;
static volatile bit TXB2D65              @ ((unsigned)&C2TX2B4)*8+5;
static volatile bit TXB2D66              @ ((unsigned)&C2TX2B4)*8+6;
static volatile bit TXB2D67              @ ((unsigned)&C2TX2B4)*8+7;
static volatile bit TXB2D70              @ ((unsigned)&C2TX2B4)*8+8;
static volatile bit TXB2D71              @ ((unsigned)&C2TX2B4)*8+9;
static volatile bit TXB2D72              @ ((unsigned)&C2TX2B4)*8+10;
static volatile bit TXB2D73              @ ((unsigned)&C2TX2B4)*8+11;
static volatile bit TXB2D74              @ ((unsigned)&C2TX2B4)*8+12;
static volatile bit TXB2D75              @ ((unsigned)&C2TX2B4)*8+13;
static volatile bit TXB2D76              @ ((unsigned)&C2TX2B4)*8+14;
static volatile bit TXB2D77              @ ((unsigned)&C2TX2B4)*8+15;

