Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: C2TX2CON
static volatile unsigned int            C2TX2CON            @ 0x40E;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 9;
        volatile unsigned TXABT               : 1;
        volatile unsigned TXLARB              : 1;
        volatile unsigned TXERR               : 1;
        volatile unsigned TXREQ               : 1;
        volatile unsigned                     : 1;
        volatile unsigned TXPRI               : 2;
    };
    struct {
        volatile unsigned                     : 14;
        volatile unsigned TXPRI1              : 1;
        volatile unsigned TXPRI0              : 1;
    };
} C2TX2CONbits @ 0x40E;
// bit variable definitions
// duplicate bit in register C1TX2CON, definition disabled
// static volatile bit TXREQ                @ ((unsigned)&C2TX2CON)*8+3;
// duplicate bit in register C1TX2CON, definition disabled
// static volatile bit TXERR                @ ((unsigned)&C2TX2CON)*8+4;
// duplicate bit in register C1TX2CON, definition disabled
// static volatile bit TXLARB               @ ((unsigned)&C2TX2CON)*8+5;
// duplicate bit in register C1TX2CON, definition disabled
// static volatile bit TXABT                @ ((unsigned)&C2TX2CON)*8+6;
// duplicate bit in register C1TX2CON, definition disabled
// static volatile bit TXPRI0               @ ((unsigned)&C2TX2CON)*8+0;
// duplicate bit in register C1TX2CON, definition disabled
// static volatile bit TXPRI1               @ ((unsigned)&C2TX2CON)*8+1;

// Register: C2TX1SID
static volatile unsigned int            C2TX1SID            @ 0x410;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned SID10               : 1;
        volatile unsigned SID9                : 1;
        volatile unsigned SID8                : 1;
        volatile unsigned SID7                : 1;
        volatile unsigned SID6                : 1;
        volatile unsigned                     : 3;
        volatile unsigned SID5                : 1;
        volatile unsigned SID4                : 1;
        volatile unsigned SID3                : 1;
        volatile unsigned SID2                : 1;
        volatile unsigned SID1                : 1;
        volatile unsigned SID0                : 1;
        volatile unsigned SRR                 : 1;
        volatile unsigned TXIDE               : 1;
    };
} C2TX1SIDbits @ 0x410;
// bit variable definitions
// duplicate bit in register C1TX2SID, definition disabled
// static volatile bit TXIDE                @ ((unsigned)&C2TX1SID)*8+0;
// duplicate bit in register C1TX2SID, definition disabled
// static volatile bit SRR                  @ ((unsigned)&C2TX1SID)*8+1;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID0                 @ ((unsigned)&C2TX1SID)*8+2;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID1                 @ ((unsigned)&C2TX1SID)*8+3;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID2                 @ ((unsigned)&C2TX1SID)*8+4;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID3                 @ ((unsigned)&C2TX1SID)*8+5;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID4                 @ ((unsigned)&C2TX1SID)*8+6;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID5                 @ ((unsigned)&C2TX1SID)*8+7;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID6                 @ ((unsigned)&C2TX1SID)*8+11;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID7                 @ ((unsigned)&C2TX1SID)*8+12;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID8                 @ ((unsigned)&C2TX1SID)*8+13;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID9                 @ ((unsigned)&C2TX1SID)*8+14;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID10                @ ((unsigned)&C2TX1SID)*8+15;

// Register: C2TX1EID
static volatile unsigned int            C2TX1EID            @ 0x412;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned EID17               : 1;
        volatile unsigned EID16               : 1;
        volatile unsigned EID15               : 1;
        volatile unsigned EID14               : 1;
        volatile unsigned                     : 4;
        volatile unsigned EID13               : 1;
        volatile unsigned EID12               : 1;
        volatile unsigned EID11               : 1;
        volatile unsigned EID10               : 1;
        volatile unsigned EID9                : 1;
        volatile unsigned EID8                : 1;
        volatile unsigned EID7                : 1;
        volatile unsigned EID6                : 1;
    };
} C2TX1EIDbits @ 0x412;
// bit variable definitions
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID6                 @ ((unsigned)&C2TX1EID)*8+0;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID7                 @ ((unsigned)&C2TX1EID)*8+1;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID8                 @ ((unsigned)&C2TX1EID)*8+2;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID9                 @ ((unsigned)&C2TX1EID)*8+3;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID10                @ ((unsigned)&C2TX1EID)*8+4;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID11                @ ((unsigned)&C2TX1EID)*8+5;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID12                @ ((unsigned)&C2TX1EID)*8+6;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID13                @ ((unsigned)&C2TX1EID)*8+7;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID14                @ ((unsigned)&C2TX1EID)*8+12;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID15                @ ((unsigned)&C2TX1EID)*8+13;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID16                @ ((unsigned)&C2TX1EID)*8+14;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID17                @ ((unsigned)&C2TX1EID)*8+15;

// Register: C2TX1DLC
static volatile unsigned int            C2TX1DLC            @ 0x414;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned EID5                : 1;
        volatile unsigned EID4                : 1;
        volatile unsigned EID3                : 1;
        volatile unsigned EID2                : 1;
        volatile unsigned EID1                : 1;
        volatile unsigned EID0                : 1;
        volatile unsigned TXRTR               : 1;
        volatile unsigned TXRB1               : 1;
        volatile unsigned TXRB0               : 1;
        volatile unsigned DLC                 : 4;
        volatile unsigned                     : 3;
    };
    struct {
        volatile unsigned                     : 9;
        volatile unsigned DLC3                : 1;
        volatile unsigned DLC2                : 1;
        volatile unsigned DLC1                : 1;
        volatile unsigned DLC0                : 1;
        volatile unsigned                     : 3;
    };
} C2TX1DLCbits @ 0x414;
// bit variable definitions
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit TXRB0                @ ((unsigned)&C2TX1DLC)*8+7;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit TXRB1                @ ((unsigned)&C2TX1DLC)*8+8;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit TXRTR                @ ((unsigned)&C2TX1DLC)*8+9;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID0                 @ ((unsigned)&C2TX1DLC)*8+10;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID1                 @ ((unsigned)&C2TX1DLC)*8+11;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID2                 @ ((unsigned)&C2TX1DLC)*8+12;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID3                 @ ((unsigned)&C2TX1DLC)*8+13;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID4                 @ ((unsigned)&C2TX1DLC)*8+14;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID5                 @ ((unsigned)&C2TX1DLC)*8+15;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC0                 @ ((unsigned)&C2TX1DLC)*8+3;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC1                 @ ((unsigned)&C2TX1DLC)*8+4;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC2                 @ ((unsigned)&C2TX1DLC)*8+5;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC3                 @ ((unsigned)&C2TX1DLC)*8+6;

