Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: C2TX0DLC
static volatile unsigned int            C2TX0DLC            @ 0x424;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned EID5                : 1;
        volatile unsigned EID4                : 1;
        volatile unsigned EID3                : 1;
        volatile unsigned EID2                : 1;
        volatile unsigned EID1                : 1;
        volatile unsigned EID0                : 1;
        volatile unsigned TXRTR               : 1;
        volatile unsigned TXRB1               : 1;
        volatile unsigned TXRB0               : 1;
        volatile unsigned DLC                 : 4;
        volatile unsigned                     : 3;
    };
} C2TX0DLCbits @ 0x424;
// bit variable definitions
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit TXRB0                @ ((unsigned)&C2TX0DLC)*8+7;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit TXRB1                @ ((unsigned)&C2TX0DLC)*8+8;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit TXRTR                @ ((unsigned)&C2TX0DLC)*8+9;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID0                 @ ((unsigned)&C2TX0DLC)*8+10;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID1                 @ ((unsigned)&C2TX0DLC)*8+11;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID2                 @ ((unsigned)&C2TX0DLC)*8+12;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID3                 @ ((unsigned)&C2TX0DLC)*8+13;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID4                 @ ((unsigned)&C2TX0DLC)*8+14;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID5                 @ ((unsigned)&C2TX0DLC)*8+15;

// Register: C2TX0B1
static volatile unsigned int            C2TX0B1             @ 0x426;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB0D1              : 8;
        volatile unsigned TXB0D0              : 8;
    };
    struct {
        volatile unsigned TXB0D17             : 1;
        volatile unsigned TXB0D16             : 1;
        volatile unsigned TXB0D15             : 1;
        volatile unsigned TXB0D14             : 1;
        volatile unsigned TXB0D13             : 1;
        volatile unsigned TXB0D12             : 1;
        volatile unsigned TXB0D11             : 1;
        volatile unsigned TXB0D10             : 1;
        volatile unsigned TXB0D07             : 1;
        volatile unsigned TXB0D06             : 1;
        volatile unsigned TXB0D05             : 1;
        volatile unsigned TXB0D04             : 1;
        volatile unsigned TXB0D03             : 1;
        volatile unsigned TXB0D02             : 1;
        volatile unsigned TXB0D01             : 1;
        volatile unsigned TXB0D00             : 1;
    };
} C2TX0B1bits @ 0x426;
// bit variable definitions
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D00              @ ((unsigned)&C2TX0B1)*8+0;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D01              @ ((unsigned)&C2TX0B1)*8+1;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D02              @ ((unsigned)&C2TX0B1)*8+2;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D03              @ ((unsigned)&C2TX0B1)*8+3;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D04              @ ((unsigned)&C2TX0B1)*8+4;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D05              @ ((unsigned)&C2TX0B1)*8+5;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D06              @ ((unsigned)&C2TX0B1)*8+6;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D07              @ ((unsigned)&C2TX0B1)*8+7;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D10              @ ((unsigned)&C2TX0B1)*8+8;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D11              @ ((unsigned)&C2TX0B1)*8+9;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D12              @ ((unsigned)&C2TX0B1)*8+10;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D13              @ ((unsigned)&C2TX0B1)*8+11;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D14              @ ((unsigned)&C2TX0B1)*8+12;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D15              @ ((unsigned)&C2TX0B1)*8+13;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D16              @ ((unsigned)&C2TX0B1)*8+14;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D17              @ ((unsigned)&C2TX0B1)*8+15;

// Register: C2TX0B2
static volatile unsigned int            C2TX0B2             @ 0x428;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB0D3              : 8;
        volatile unsigned TXB0D2              : 8;
    };
    struct {
        volatile unsigned TXB0D37             : 1;
        volatile unsigned TXB0D36             : 1;
        volatile unsigned TXB0D35             : 1;
        volatile unsigned TXB0D34             : 1;
        volatile unsigned TXB0D33             : 1;
        volatile unsigned TXB0D32             : 1;
        volatile unsigned TXB0D31             : 1;
        volatile unsigned TXB0D30             : 1;
        volatile unsigned TXB0D27             : 1;
        volatile unsigned TXB0D26             : 1;
        volatile unsigned TXB0D25             : 1;
        volatile unsigned TXB0D24             : 1;
        volatile unsigned TXB0D23             : 1;
        volatile unsigned TXB0D22             : 1;
        volatile unsigned TXB0D21             : 1;
        volatile unsigned TXB0D20             : 1;
    };
} C2TX0B2bits @ 0x428;
// bit variable definitions
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D20              @ ((unsigned)&C2TX0B2)*8+0;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D21              @ ((unsigned)&C2TX0B2)*8+1;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D22              @ ((unsigned)&C2TX0B2)*8+2;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D23              @ ((unsigned)&C2TX0B2)*8+3;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D24              @ ((unsigned)&C2TX0B2)*8+4;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D25              @ ((unsigned)&C2TX0B2)*8+5;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D26              @ ((unsigned)&C2TX0B2)*8+6;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D27              @ ((unsigned)&C2TX0B2)*8+7;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D30              @ ((unsigned)&C2TX0B2)*8+8;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D31              @ ((unsigned)&C2TX0B2)*8+9;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D32              @ ((unsigned)&C2TX0B2)*8+10;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D33              @ ((unsigned)&C2TX0B2)*8+11;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D34              @ ((unsigned)&C2TX0B2)*8+12;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D35              @ ((unsigned)&C2TX0B2)*8+13;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D36              @ ((unsigned)&C2TX0B2)*8+14;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D37              @ ((unsigned)&C2TX0B2)*8+15;

// Register: C2TX0B3
static volatile unsigned int            C2TX0B3             @ 0x42A;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB0D5              : 8;
        volatile unsigned TXB0D4              : 8;
    };
    struct {
        volatile unsigned TXB0D57             : 1;
        volatile unsigned TXB0D56             : 1;
        volatile unsigned TXB0D55             : 1;
        volatile unsigned TXB0D54             : 1;
        volatile unsigned TXB0D53             : 1;
        volatile unsigned TXB0D52             : 1;
        volatile unsigned TXB0D51             : 1;
        volatile unsigned TXB0D50             : 1;
        volatile unsigned TXB0D47             : 1;
        volatile unsigned TXB0D46             : 1;
        volatile unsigned TXB0D45             : 1;
        volatile unsigned TXB0D44             : 1;
        volatile unsigned TXB0D43             : 1;
        volatile unsigned TXB0D42             : 1;
        volatile unsigned TXB0D41             : 1;
        volatile unsigned TXB0D40             : 1;
    };
} C2TX0B3bits @ 0x42A;
// bit variable definitions
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D40              @ ((unsigned)&C2TX0B3)*8+0;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D41              @ ((unsigned)&C2TX0B3)*8+1;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D42              @ ((unsigned)&C2TX0B3)*8+2;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D43              @ ((unsigned)&C2TX0B3)*8+3;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D44              @ ((unsigned)&C2TX0B3)*8+4;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D45              @ ((unsigned)&C2TX0B3)*8+5;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D46              @ ((unsigned)&C2TX0B3)*8+6;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D47              @ ((unsigned)&C2TX0B3)*8+7;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D50              @ ((unsigned)&C2TX0B3)*8+8;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D51              @ ((unsigned)&C2TX0B3)*8+9;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D52              @ ((unsigned)&C2TX0B3)*8+10;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D53              @ ((unsigned)&C2TX0B3)*8+11;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D54              @ ((unsigned)&C2TX0B3)*8+12;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D55              @ ((unsigned)&C2TX0B3)*8+13;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D56              @ ((unsigned)&C2TX0B3)*8+14;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D57              @ ((unsigned)&C2TX0B3)*8+15;

