Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: C2TX0B4
static volatile unsigned int            C2TX0B4             @ 0x42C;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB0D7              : 8;
        volatile unsigned TXB0D6              : 8;
    };
    struct {
        volatile unsigned TXB0D77             : 1;
        volatile unsigned TXB0D76             : 1;
        volatile unsigned TXB0D75             : 1;
        volatile unsigned TXB0D74             : 1;
        volatile unsigned TXB0D73             : 1;
        volatile unsigned TXB0D72             : 1;
        volatile unsigned TXB0D71             : 1;
        volatile unsigned TXB0D70             : 1;
        volatile unsigned TXB0D67             : 1;
        volatile unsigned TXB0D66             : 1;
        volatile unsigned TXB0D65             : 1;
        volatile unsigned TXB0D64             : 1;
        volatile unsigned TXB0D63             : 1;
        volatile unsigned TXB0D62             : 1;
        volatile unsigned TXB0D61             : 1;
        volatile unsigned TXB0D60             : 1;
    };
} C2TX0B4bits @ 0x42C;
// bit variable definitions
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D60              @ ((unsigned)&C2TX0B4)*8+0;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D61              @ ((unsigned)&C2TX0B4)*8+1;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D62              @ ((unsigned)&C2TX0B4)*8+2;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D63              @ ((unsigned)&C2TX0B4)*8+3;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D64              @ ((unsigned)&C2TX0B4)*8+4;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D65              @ ((unsigned)&C2TX0B4)*8+5;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D66              @ ((unsigned)&C2TX0B4)*8+6;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D67              @ ((unsigned)&C2TX0B4)*8+7;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D70              @ ((unsigned)&C2TX0B4)*8+8;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D71              @ ((unsigned)&C2TX0B4)*8+9;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D72              @ ((unsigned)&C2TX0B4)*8+10;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D73              @ ((unsigned)&C2TX0B4)*8+11;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D74              @ ((unsigned)&C2TX0B4)*8+12;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D75              @ ((unsigned)&C2TX0B4)*8+13;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D76              @ ((unsigned)&C2TX0B4)*8+14;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D77              @ ((unsigned)&C2TX0B4)*8+15;

// Register: C2TX0CON
static volatile unsigned int            C2TX0CON            @ 0x42E;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 9;
        volatile unsigned TXABT               : 1;
        volatile unsigned TXLARB              : 1;
        volatile unsigned TXERR               : 1;
        volatile unsigned TXREQ               : 1;
        volatile unsigned                     : 1;
        volatile unsigned TXPRI               : 2;
    };
    struct {
        volatile unsigned                     : 14;
        volatile unsigned TXPRI1              : 1;
        volatile unsigned TXPRI0              : 1;
    };
} C2TX0CONbits @ 0x42E;
// bit variable definitions
// duplicate bit in register C1TX2CON, definition disabled
// static volatile bit TXREQ                @ ((unsigned)&C2TX0CON)*8+3;
// duplicate bit in register C1TX2CON, definition disabled
// static volatile bit TXERR                @ ((unsigned)&C2TX0CON)*8+4;
// duplicate bit in register C1TX2CON, definition disabled
// static volatile bit TXLARB               @ ((unsigned)&C2TX0CON)*8+5;
// duplicate bit in register C1TX2CON, definition disabled
// static volatile bit TXABT                @ ((unsigned)&C2TX0CON)*8+6;
// duplicate bit in register C1TX2CON, definition disabled
// static volatile bit TXPRI0               @ ((unsigned)&C2TX0CON)*8+0;
// duplicate bit in register C1TX2CON, definition disabled
// static volatile bit TXPRI1               @ ((unsigned)&C2TX0CON)*8+1;

// Register: C2RX1SID
static volatile unsigned int            C2RX1SID            @ 0x430;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 3;
        volatile unsigned SID10               : 1;
        volatile unsigned SID9                : 1;
        volatile unsigned SID8                : 1;
        volatile unsigned SID7                : 1;
        volatile unsigned SID6                : 1;
        volatile unsigned SID5                : 1;
        volatile unsigned SID4                : 1;
        volatile unsigned SID3                : 1;
        volatile unsigned SID2                : 1;
        volatile unsigned SID1                : 1;
        volatile unsigned SID0                : 1;
        volatile unsigned SRR                 : 1;
        volatile unsigned TXIDE               : 1;
    };
} C2RX1SIDbits @ 0x430;
// bit variable definitions
// duplicate bit in register C1TX2SID, definition disabled
// static volatile bit TXIDE                @ ((unsigned)&C2RX1SID)*8+0;
// duplicate bit in register C1TX2SID, definition disabled
// static volatile bit SRR                  @ ((unsigned)&C2RX1SID)*8+1;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID0                 @ ((unsigned)&C2RX1SID)*8+2;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID1                 @ ((unsigned)&C2RX1SID)*8+3;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID2                 @ ((unsigned)&C2RX1SID)*8+4;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID3                 @ ((unsigned)&C2RX1SID)*8+5;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID4                 @ ((unsigned)&C2RX1SID)*8+6;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID5                 @ ((unsigned)&C2RX1SID)*8+7;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID6                 @ ((unsigned)&C2RX1SID)*8+8;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID7                 @ ((unsigned)&C2RX1SID)*8+9;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID8                 @ ((unsigned)&C2RX1SID)*8+10;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID9                 @ ((unsigned)&C2RX1SID)*8+11;
// duplicate bit in register C1RXF0SID, definition disabled
// static volatile bit SID10                @ ((unsigned)&C2RX1SID)*8+12;

// Register: C2RX1EID
static volatile unsigned int            C2RX1EID            @ 0x432;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 4;
        volatile unsigned EID17               : 1;
        volatile unsigned EID16               : 1;
        volatile unsigned EID15               : 1;
        volatile unsigned EID14               : 1;
        volatile unsigned EID13               : 1;
        volatile unsigned EID12               : 1;
        volatile unsigned EID11               : 1;
        volatile unsigned EID10               : 1;
        volatile unsigned EID9                : 1;
        volatile unsigned EID8                : 1;
        volatile unsigned EID7                : 1;
        volatile unsigned EID6                : 1;
    };
} C2RX1EIDbits @ 0x432;
// bit variable definitions
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID6                 @ ((unsigned)&C2RX1EID)*8+0;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID7                 @ ((unsigned)&C2RX1EID)*8+1;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID8                 @ ((unsigned)&C2RX1EID)*8+2;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID9                 @ ((unsigned)&C2RX1EID)*8+3;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID10                @ ((unsigned)&C2RX1EID)*8+4;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID11                @ ((unsigned)&C2RX1EID)*8+5;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID12                @ ((unsigned)&C2RX1EID)*8+6;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID13                @ ((unsigned)&C2RX1EID)*8+7;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID14                @ ((unsigned)&C2RX1EID)*8+8;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID15                @ ((unsigned)&C2RX1EID)*8+9;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID16                @ ((unsigned)&C2RX1EID)*8+10;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID17                @ ((unsigned)&C2RX1EID)*8+11;

