Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: C2RX1DLC
static volatile unsigned int            C2RX1DLC            @ 0x434;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned EID5                : 1;
        volatile unsigned EID4                : 1;
        volatile unsigned EID3                : 1;
        volatile unsigned EID2                : 1;
        volatile unsigned EID1                : 1;
        volatile unsigned EID0                : 1;
        volatile unsigned RXRTR               : 1;
        volatile unsigned RXRB1               : 1;
        volatile unsigned                     : 3;
        volatile unsigned RXRB0               : 1;
        volatile unsigned DLC                 : 4;
    };
    struct {
        volatile unsigned                     : 12;
        volatile unsigned DLC3                : 1;
        volatile unsigned DLC2                : 1;
        volatile unsigned DLC1                : 1;
        volatile unsigned DLC0                : 1;
    };
} C2RX1DLCbits @ 0x434;
// bit variable definitions
// duplicate bit in register C1RX1DLC, definition disabled
// static volatile bit RXRB0                @ ((unsigned)&C2RX1DLC)*8+4;
// duplicate bit in register C1RX1DLC, definition disabled
// static volatile bit RXRB1                @ ((unsigned)&C2RX1DLC)*8+8;
// duplicate bit in register C1RX1DLC, definition disabled
// static volatile bit RXRTR                @ ((unsigned)&C2RX1DLC)*8+9;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID0                 @ ((unsigned)&C2RX1DLC)*8+10;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID1                 @ ((unsigned)&C2RX1DLC)*8+11;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID2                 @ ((unsigned)&C2RX1DLC)*8+12;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID3                 @ ((unsigned)&C2RX1DLC)*8+13;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID4                 @ ((unsigned)&C2RX1DLC)*8+14;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID5                 @ ((unsigned)&C2RX1DLC)*8+15;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC0                 @ ((unsigned)&C2RX1DLC)*8+0;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC1                 @ ((unsigned)&C2RX1DLC)*8+1;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC2                 @ ((unsigned)&C2RX1DLC)*8+2;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC3                 @ ((unsigned)&C2RX1DLC)*8+3;

// Register: C2RX1B1
static volatile unsigned int            C2RX1B1             @ 0x436;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB1D1              : 8;
        volatile unsigned TXB1D0              : 8;
    };
    struct {
        volatile unsigned TXB1D17             : 1;
        volatile unsigned TXB1D16             : 1;
        volatile unsigned TXB1D15             : 1;
        volatile unsigned TXB1D14             : 1;
        volatile unsigned TXB1D13             : 1;
        volatile unsigned TXB1D12             : 1;
        volatile unsigned TXB1D11             : 1;
        volatile unsigned TXB1D10             : 1;
        volatile unsigned TXB1D07             : 1;
        volatile unsigned TXB1D06             : 1;
        volatile unsigned TXB1D05             : 1;
        volatile unsigned TXB1D04             : 1;
        volatile unsigned TXB1D03             : 1;
        volatile unsigned TXB1D02             : 1;
        volatile unsigned TXB1D01             : 1;
        volatile unsigned TXB1D00             : 1;
    };
} C2RX1B1bits @ 0x436;
// bit variable definitions
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D00              @ ((unsigned)&C2RX1B1)*8+0;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D01              @ ((unsigned)&C2RX1B1)*8+1;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D02              @ ((unsigned)&C2RX1B1)*8+2;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D03              @ ((unsigned)&C2RX1B1)*8+3;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D04              @ ((unsigned)&C2RX1B1)*8+4;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D05              @ ((unsigned)&C2RX1B1)*8+5;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D06              @ ((unsigned)&C2RX1B1)*8+6;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D07              @ ((unsigned)&C2RX1B1)*8+7;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D10              @ ((unsigned)&C2RX1B1)*8+8;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D11              @ ((unsigned)&C2RX1B1)*8+9;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D12              @ ((unsigned)&C2RX1B1)*8+10;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D13              @ ((unsigned)&C2RX1B1)*8+11;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D14              @ ((unsigned)&C2RX1B1)*8+12;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D15              @ ((unsigned)&C2RX1B1)*8+13;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D16              @ ((unsigned)&C2RX1B1)*8+14;
// duplicate bit in register C1TX1B1, definition disabled
// static volatile bit TXB1D17              @ ((unsigned)&C2RX1B1)*8+15;

// Register: C2RX1B2
static volatile unsigned int            C2RX1B2             @ 0x438;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB1D3              : 8;
        volatile unsigned TXB1D2              : 8;
    };
    struct {
        volatile unsigned TXB1D37             : 1;
        volatile unsigned TXB1D36             : 1;
        volatile unsigned TXB1D35             : 1;
        volatile unsigned TXB1D34             : 1;
        volatile unsigned TXB1D33             : 1;
        volatile unsigned TXB1D32             : 1;
        volatile unsigned TXB1D31             : 1;
        volatile unsigned TXB1D30             : 1;
        volatile unsigned TXB1D27             : 1;
        volatile unsigned TXB1D26             : 1;
        volatile unsigned TXB1D25             : 1;
        volatile unsigned TXB1D24             : 1;
        volatile unsigned TXB1D23             : 1;
        volatile unsigned TXB1D22             : 1;
        volatile unsigned TXB1D21             : 1;
        volatile unsigned TXB1D20             : 1;
    };
} C2RX1B2bits @ 0x438;
// bit variable definitions
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D20              @ ((unsigned)&C2RX1B2)*8+0;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D21              @ ((unsigned)&C2RX1B2)*8+1;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D22              @ ((unsigned)&C2RX1B2)*8+2;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D23              @ ((unsigned)&C2RX1B2)*8+3;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D24              @ ((unsigned)&C2RX1B2)*8+4;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D25              @ ((unsigned)&C2RX1B2)*8+5;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D26              @ ((unsigned)&C2RX1B2)*8+6;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D27              @ ((unsigned)&C2RX1B2)*8+7;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D30              @ ((unsigned)&C2RX1B2)*8+8;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D31              @ ((unsigned)&C2RX1B2)*8+9;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D32              @ ((unsigned)&C2RX1B2)*8+10;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D33              @ ((unsigned)&C2RX1B2)*8+11;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D34              @ ((unsigned)&C2RX1B2)*8+12;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D35              @ ((unsigned)&C2RX1B2)*8+13;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D36              @ ((unsigned)&C2RX1B2)*8+14;
// duplicate bit in register C1TX1B2, definition disabled
// static volatile bit TXB1D37              @ ((unsigned)&C2RX1B2)*8+15;

