Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: C2RX0EID
static volatile unsigned int            C2RX0EID            @ 0x442;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 4;
        volatile unsigned EID17               : 1;
        volatile unsigned EID16               : 1;
        volatile unsigned EID15               : 1;
        volatile unsigned EID14               : 1;
        volatile unsigned EID13               : 1;
        volatile unsigned EID12               : 1;
        volatile unsigned EID11               : 1;
        volatile unsigned EID10               : 1;
        volatile unsigned EID9                : 1;
        volatile unsigned EID8                : 1;
        volatile unsigned EID7                : 1;
        volatile unsigned EID6                : 1;
    };
} C2RX0EIDbits @ 0x442;
// bit variable definitions
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID6                 @ ((unsigned)&C2RX0EID)*8+0;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID7                 @ ((unsigned)&C2RX0EID)*8+1;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID8                 @ ((unsigned)&C2RX0EID)*8+2;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID9                 @ ((unsigned)&C2RX0EID)*8+3;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID10                @ ((unsigned)&C2RX0EID)*8+4;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID11                @ ((unsigned)&C2RX0EID)*8+5;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID12                @ ((unsigned)&C2RX0EID)*8+6;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID13                @ ((unsigned)&C2RX0EID)*8+7;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID14                @ ((unsigned)&C2RX0EID)*8+8;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID15                @ ((unsigned)&C2RX0EID)*8+9;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID16                @ ((unsigned)&C2RX0EID)*8+10;
// duplicate bit in register C1RXF0EIDH, definition disabled
// static volatile bit EID17                @ ((unsigned)&C2RX0EID)*8+11;

// Register: C2RX0DLC
static volatile unsigned int            C2RX0DLC            @ 0x444;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned EID5                : 1;
        volatile unsigned EID4                : 1;
        volatile unsigned EID3                : 1;
        volatile unsigned EID2                : 1;
        volatile unsigned EID1                : 1;
        volatile unsigned EID0                : 1;
        volatile unsigned RXRTR               : 1;
        volatile unsigned RXRB1               : 1;
        volatile unsigned                     : 3;
        volatile unsigned RXRB0               : 1;
        volatile unsigned DLC                 : 4;
    };
    struct {
        volatile unsigned                     : 12;
        volatile unsigned DLC3                : 1;
        volatile unsigned DLC2                : 1;
        volatile unsigned DLC1                : 1;
        volatile unsigned DLC0                : 1;
    };
} C2RX0DLCbits @ 0x444;
// bit variable definitions
// duplicate bit in register C1RX1DLC, definition disabled
// static volatile bit RXRB0                @ ((unsigned)&C2RX0DLC)*8+4;
// duplicate bit in register C1RX1DLC, definition disabled
// static volatile bit RXRB1                @ ((unsigned)&C2RX0DLC)*8+8;
// duplicate bit in register C1RX1DLC, definition disabled
// static volatile bit RXRTR                @ ((unsigned)&C2RX0DLC)*8+9;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID0                 @ ((unsigned)&C2RX0DLC)*8+10;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID1                 @ ((unsigned)&C2RX0DLC)*8+11;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID2                 @ ((unsigned)&C2RX0DLC)*8+12;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID3                 @ ((unsigned)&C2RX0DLC)*8+13;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID4                 @ ((unsigned)&C2RX0DLC)*8+14;
// duplicate bit in register C1RXF0EIDL, definition disabled
// static volatile bit EID5                 @ ((unsigned)&C2RX0DLC)*8+15;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC0                 @ ((unsigned)&C2RX0DLC)*8+0;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC1                 @ ((unsigned)&C2RX0DLC)*8+1;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC2                 @ ((unsigned)&C2RX0DLC)*8+2;
// duplicate bit in register C1TX2DLC, definition disabled
// static volatile bit DLC3                 @ ((unsigned)&C2RX0DLC)*8+3;

// Register: C2RX0B1
static volatile unsigned int            C2RX0B1             @ 0x446;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB0D1              : 8;
        volatile unsigned TXB0D0              : 8;
    };
    struct {
        volatile unsigned TXB0D17             : 1;
        volatile unsigned TXB0D16             : 1;
        volatile unsigned TXB0D15             : 1;
        volatile unsigned TXB0D14             : 1;
        volatile unsigned TXB0D13             : 1;
        volatile unsigned TXB0D12             : 1;
        volatile unsigned TXB0D11             : 1;
        volatile unsigned TXB0D10             : 1;
        volatile unsigned TXB0D07             : 1;
        volatile unsigned TXB0D06             : 1;
        volatile unsigned TXB0D05             : 1;
        volatile unsigned TXB0D04             : 1;
        volatile unsigned TXB0D03             : 1;
        volatile unsigned TXB0D02             : 1;
        volatile unsigned TXB0D01             : 1;
        volatile unsigned TXB0D00             : 1;
    };
} C2RX0B1bits @ 0x446;
// bit variable definitions
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D00              @ ((unsigned)&C2RX0B1)*8+0;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D01              @ ((unsigned)&C2RX0B1)*8+1;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D02              @ ((unsigned)&C2RX0B1)*8+2;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D03              @ ((unsigned)&C2RX0B1)*8+3;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D04              @ ((unsigned)&C2RX0B1)*8+4;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D05              @ ((unsigned)&C2RX0B1)*8+5;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D06              @ ((unsigned)&C2RX0B1)*8+6;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D07              @ ((unsigned)&C2RX0B1)*8+7;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D10              @ ((unsigned)&C2RX0B1)*8+8;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D11              @ ((unsigned)&C2RX0B1)*8+9;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D12              @ ((unsigned)&C2RX0B1)*8+10;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D13              @ ((unsigned)&C2RX0B1)*8+11;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D14              @ ((unsigned)&C2RX0B1)*8+12;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D15              @ ((unsigned)&C2RX0B1)*8+13;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D16              @ ((unsigned)&C2RX0B1)*8+14;
// duplicate bit in register C1TX0B1, definition disabled
// static volatile bit TXB0D17              @ ((unsigned)&C2RX0B1)*8+15;

// Register: C2RX0B2
static volatile unsigned int            C2RX0B2             @ 0x448;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB0D3              : 8;
        volatile unsigned TXB0D2              : 8;
    };
    struct {
        volatile unsigned TXB0D37             : 1;
        volatile unsigned TXB0D36             : 1;
        volatile unsigned TXB0D35             : 1;
        volatile unsigned TXB0D34             : 1;
        volatile unsigned TXB0D33             : 1;
        volatile unsigned TXB0D32             : 1;
        volatile unsigned TXB0D31             : 1;
        volatile unsigned TXB0D30             : 1;
        volatile unsigned TXB0D27             : 1;
        volatile unsigned TXB0D26             : 1;
        volatile unsigned TXB0D25             : 1;
        volatile unsigned TXB0D24             : 1;
        volatile unsigned TXB0D23             : 1;
        volatile unsigned TXB0D22             : 1;
        volatile unsigned TXB0D21             : 1;
        volatile unsigned TXB0D20             : 1;
    };
} C2RX0B2bits @ 0x448;
// bit variable definitions
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D20              @ ((unsigned)&C2RX0B2)*8+0;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D21              @ ((unsigned)&C2RX0B2)*8+1;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D22              @ ((unsigned)&C2RX0B2)*8+2;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D23              @ ((unsigned)&C2RX0B2)*8+3;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D24              @ ((unsigned)&C2RX0B2)*8+4;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D25              @ ((unsigned)&C2RX0B2)*8+5;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D26              @ ((unsigned)&C2RX0B2)*8+6;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D27              @ ((unsigned)&C2RX0B2)*8+7;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D30              @ ((unsigned)&C2RX0B2)*8+8;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D31              @ ((unsigned)&C2RX0B2)*8+9;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D32              @ ((unsigned)&C2RX0B2)*8+10;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D33              @ ((unsigned)&C2RX0B2)*8+11;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D34              @ ((unsigned)&C2RX0B2)*8+12;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D35              @ ((unsigned)&C2RX0B2)*8+13;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D36              @ ((unsigned)&C2RX0B2)*8+14;
// duplicate bit in register C1TX0B2, definition disabled
// static volatile bit TXB0D37              @ ((unsigned)&C2RX0B2)*8+15;

// Register: C2RX0B3
static volatile unsigned int            C2RX0B3             @ 0x44A;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB0D5              : 8;
        volatile unsigned TXB0D4              : 8;
    };
    struct {
        volatile unsigned TXB0D57             : 1;
        volatile unsigned TXB0D56             : 1;
        volatile unsigned TXB0D55             : 1;
        volatile unsigned TXB0D54             : 1;
        volatile unsigned TXB0D53             : 1;
        volatile unsigned TXB0D52             : 1;
        volatile unsigned TXB0D51             : 1;
        volatile unsigned TXB0D50             : 1;
        volatile unsigned TXB0D47             : 1;
        volatile unsigned TXB0D46             : 1;
        volatile unsigned TXB0D45             : 1;
        volatile unsigned TXB0D44             : 1;
        volatile unsigned TXB0D43             : 1;
        volatile unsigned TXB0D42             : 1;
        volatile unsigned TXB0D41             : 1;
        volatile unsigned TXB0D40             : 1;
    };
} C2RX0B3bits @ 0x44A;
// bit variable definitions
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D40              @ ((unsigned)&C2RX0B3)*8+0;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D41              @ ((unsigned)&C2RX0B3)*8+1;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D42              @ ((unsigned)&C2RX0B3)*8+2;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D43              @ ((unsigned)&C2RX0B3)*8+3;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D44              @ ((unsigned)&C2RX0B3)*8+4;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D45              @ ((unsigned)&C2RX0B3)*8+5;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D46              @ ((unsigned)&C2RX0B3)*8+6;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D47              @ ((unsigned)&C2RX0B3)*8+7;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D50              @ ((unsigned)&C2RX0B3)*8+8;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D51              @ ((unsigned)&C2RX0B3)*8+9;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D52              @ ((unsigned)&C2RX0B3)*8+10;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D53              @ ((unsigned)&C2RX0B3)*8+11;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D54              @ ((unsigned)&C2RX0B3)*8+12;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D55              @ ((unsigned)&C2RX0B3)*8+13;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D56              @ ((unsigned)&C2RX0B3)*8+14;
// duplicate bit in register C1TX0B3, definition disabled
// static volatile bit TXB0D57              @ ((unsigned)&C2RX0B3)*8+15;

