Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: C2RX0B4
static volatile unsigned int            C2RX0B4             @ 0x44C;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TXB0D7              : 8;
        volatile unsigned TXB0D6              : 8;
    };
    struct {
        volatile unsigned TXB0D77             : 1;
        volatile unsigned TXB0D76             : 1;
        volatile unsigned TXB0D75             : 1;
        volatile unsigned TXB0D74             : 1;
        volatile unsigned TXB0D73             : 1;
        volatile unsigned TXB0D72             : 1;
        volatile unsigned TXB0D71             : 1;
        volatile unsigned TXB0D70             : 1;
        volatile unsigned TXB0D67             : 1;
        volatile unsigned TXB0D66             : 1;
        volatile unsigned TXB0D65             : 1;
        volatile unsigned TXB0D64             : 1;
        volatile unsigned TXB0D63             : 1;
        volatile unsigned TXB0D62             : 1;
        volatile unsigned TXB0D61             : 1;
        volatile unsigned TXB0D60             : 1;
    };
} C2RX0B4bits @ 0x44C;
// bit variable definitions
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D60              @ ((unsigned)&C2RX0B4)*8+0;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D61              @ ((unsigned)&C2RX0B4)*8+1;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D62              @ ((unsigned)&C2RX0B4)*8+2;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D63              @ ((unsigned)&C2RX0B4)*8+3;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D64              @ ((unsigned)&C2RX0B4)*8+4;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D65              @ ((unsigned)&C2RX0B4)*8+5;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D66              @ ((unsigned)&C2RX0B4)*8+6;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D67              @ ((unsigned)&C2RX0B4)*8+7;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D70              @ ((unsigned)&C2RX0B4)*8+8;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D71              @ ((unsigned)&C2RX0B4)*8+9;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D72              @ ((unsigned)&C2RX0B4)*8+10;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D73              @ ((unsigned)&C2RX0B4)*8+11;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D74              @ ((unsigned)&C2RX0B4)*8+12;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D75              @ ((unsigned)&C2RX0B4)*8+13;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D76              @ ((unsigned)&C2RX0B4)*8+14;
// duplicate bit in register C1TX0B4, definition disabled
// static volatile bit TXB0D77              @ ((unsigned)&C2RX0B4)*8+15;

// Register: C2RX0CON
static volatile unsigned int            C2RX0CON            @ 0x44E;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 8;
        volatile unsigned RXFUL               : 1;
        volatile unsigned                     : 3;
        volatile unsigned RXRTRRO             : 1;
        volatile unsigned RXB0DBEN            : 1;
        volatile unsigned JTOFF               : 1;
        volatile unsigned FILHIT              : 1;
    };
} C2RX0CONbits @ 0x44E;
// bit variable definitions
// duplicate bit in register C1RX0CON, definition disabled
// static volatile bit FILHIT               @ ((unsigned)&C2RX0CON)*8+0;
// duplicate bit in register C1RX0CON, definition disabled
// static volatile bit JTOFF                @ ((unsigned)&C2RX0CON)*8+1;
// duplicate bit in register C1RX0CON, definition disabled
// static volatile bit RXB0DBEN             @ ((unsigned)&C2RX0CON)*8+2;
// duplicate bit in register C1RX1CON, definition disabled
// static volatile bit RXRTRRO              @ ((unsigned)&C2RX0CON)*8+3;
// duplicate bit in register C1RX1CON, definition disabled
// static volatile bit RXFUL                @ ((unsigned)&C2RX0CON)*8+7;

// Register: C2CTRL
static volatile unsigned int            C2CTRL              @ 0x450;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned CANCAP              : 1;
        volatile unsigned CANFRZ              : 1;
        volatile unsigned CANSIDL             : 1;
        volatile unsigned ABAT                : 1;
        volatile unsigned CANCKS              : 1;
        volatile unsigned REQOP               : 3;
        volatile unsigned OPMODE              : 3;
        volatile unsigned                     : 1;
        volatile unsigned ICOD                : 3;
        volatile unsigned                     : 1;
    };
    struct {
        volatile unsigned                     : 5;
        volatile unsigned REQOP2              : 1;
        volatile unsigned REQOP1              : 1;
        volatile unsigned REQOP0              : 1;
        volatile unsigned OPMODE2             : 1;
        volatile unsigned OPMODE1             : 1;
        volatile unsigned OPMODE0             : 1;
        volatile unsigned                     : 1;
        volatile unsigned ICOD2               : 1;
        volatile unsigned ICOD1               : 1;
        volatile unsigned ICOD0               : 1;
        volatile unsigned                     : 1;
    };
} C2CTRLbits @ 0x450;
// bit variable definitions
// duplicate bit in register C1CTRL, definition disabled
// static volatile bit CANCKS               @ ((unsigned)&C2CTRL)*8+11;
// duplicate bit in register C1CTRL, definition disabled
// static volatile bit ABAT                 @ ((unsigned)&C2CTRL)*8+12;
// duplicate bit in register C1CTRL, definition disabled
// static volatile bit CANSIDL              @ ((unsigned)&C2CTRL)*8+13;
// duplicate bit in register C1CTRL, definition disabled
// static volatile bit CANFRZ               @ ((unsigned)&C2CTRL)*8+14;
// duplicate bit in register C1CTRL, definition disabled
// static volatile bit CANCAP               @ ((unsigned)&C2CTRL)*8+15;
// duplicate bit in register C1CTRL, definition disabled
// static volatile bit ICOD0                @ ((unsigned)&C2CTRL)*8+1;
// duplicate bit in register C1CTRL, definition disabled
// static volatile bit ICOD1                @ ((unsigned)&C2CTRL)*8+2;
// duplicate bit in register C1CTRL, definition disabled
// static volatile bit ICOD2                @ ((unsigned)&C2CTRL)*8+3;
// duplicate bit in register C1CTRL, definition disabled
// static volatile bit OPMODE0              @ ((unsigned)&C2CTRL)*8+5;
// duplicate bit in register C1CTRL, definition disabled
// static volatile bit OPMODE1              @ ((unsigned)&C2CTRL)*8+6;
// duplicate bit in register C1CTRL, definition disabled
// static volatile bit OPMODE2              @ ((unsigned)&C2CTRL)*8+7;
// duplicate bit in register C1CTRL, definition disabled
// static volatile bit REQOP0               @ ((unsigned)&C2CTRL)*8+8;
// duplicate bit in register C1CTRL, definition disabled
// static volatile bit REQOP1               @ ((unsigned)&C2CTRL)*8+9;
// duplicate bit in register C1CTRL, definition disabled
// static volatile bit REQOP2               @ ((unsigned)&C2CTRL)*8+10;

// Register: C2CFG1
static volatile unsigned int            C2CFG1              @ 0x452;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 8;
        volatile unsigned SJW                 : 2;
        volatile unsigned BRP                 : 6;
    };
    struct {
        volatile unsigned                     : 8;
        volatile unsigned SJW1                : 1;
        volatile unsigned SJW0                : 1;
        volatile unsigned BRP5                : 1;
        volatile unsigned BRP4                : 1;
        volatile unsigned BRP3                : 1;
        volatile unsigned BRP2                : 1;
        volatile unsigned BRP1                : 1;
        volatile unsigned BRP0                : 1;
    };
} C2CFG1bits @ 0x452;
// bit variable definitions
// duplicate bit in register C1CFG1, definition disabled
// static volatile bit BRP0                 @ ((unsigned)&C2CFG1)*8+0;
// duplicate bit in register C1CFG1, definition disabled
// static volatile bit BRP1                 @ ((unsigned)&C2CFG1)*8+1;
// duplicate bit in register C1CFG1, definition disabled
// static volatile bit BRP2                 @ ((unsigned)&C2CFG1)*8+2;
// duplicate bit in register C1CFG1, definition disabled
// static volatile bit BRP3                 @ ((unsigned)&C2CFG1)*8+3;
// duplicate bit in register C1CFG1, definition disabled
// static volatile bit BRP4                 @ ((unsigned)&C2CFG1)*8+4;
// duplicate bit in register C1CFG1, definition disabled
// static volatile bit BRP5                 @ ((unsigned)&C2CFG1)*8+5;
// duplicate bit in register C1CFG1, definition disabled
// static volatile bit SJW0                 @ ((unsigned)&C2CFG1)*8+6;
// duplicate bit in register C1CFG1, definition disabled
// static volatile bit SJW1                 @ ((unsigned)&C2CFG1)*8+7;

// Register: C2CFG2
static volatile unsigned int            C2CFG2              @ 0x454;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 1;
        volatile unsigned WAKFIL              : 1;
        volatile unsigned                     : 3;
        volatile unsigned SEG2PH              : 3;
        volatile unsigned SEG2PHTS            : 1;
        volatile unsigned SAM                 : 1;
        volatile unsigned SEG1PH              : 3;
        volatile unsigned PRSEG               : 3;
    };
    struct {
        volatile unsigned                     : 5;
        volatile unsigned SEG2PH2             : 1;
        volatile unsigned SEG2PH1             : 1;
        volatile unsigned SEG2PH0             : 1;
        volatile unsigned                     : 2;
        volatile unsigned SEG1PH2             : 1;
        volatile unsigned SEG1PH1             : 1;
        volatile unsigned SEG1PH0             : 1;
        volatile unsigned PRSEG2              : 1;
        volatile unsigned PRSEG1              : 1;
        volatile unsigned PRSEG0              : 1;
    };
} C2CFG2bits @ 0x454;
// bit variable definitions
// duplicate bit in register C1CFG2, definition disabled
// static volatile bit SAM                  @ ((unsigned)&C2CFG2)*8+6;
// duplicate bit in register C1CFG2, definition disabled
// static volatile bit SEG2PHTS             @ ((unsigned)&C2CFG2)*8+7;
// duplicate bit in register C1CFG2, definition disabled
// static volatile bit WAKFIL               @ ((unsigned)&C2CFG2)*8+14;
// duplicate bit in register C1CFG2, definition disabled
// static volatile bit PRSEG0               @ ((unsigned)&C2CFG2)*8+0;
// duplicate bit in register C1CFG2, definition disabled
// static volatile bit PRSEG1               @ ((unsigned)&C2CFG2)*8+1;
// duplicate bit in register C1CFG2, definition disabled
// static volatile bit PRSEG2               @ ((unsigned)&C2CFG2)*8+2;
// duplicate bit in register C1CFG2, definition disabled
// static volatile bit SEG1PH0              @ ((unsigned)&C2CFG2)*8+3;
// duplicate bit in register C1CFG2, definition disabled
// static volatile bit SEG1PH1              @ ((unsigned)&C2CFG2)*8+4;
// duplicate bit in register C1CFG2, definition disabled
// static volatile bit SEG1PH2              @ ((unsigned)&C2CFG2)*8+5;
// duplicate bit in register C1CFG2, definition disabled
// static volatile bit SEG2PH0              @ ((unsigned)&C2CFG2)*8+8;
// duplicate bit in register C1CFG2, definition disabled
// static volatile bit SEG2PH1              @ ((unsigned)&C2CFG2)*8+9;
// duplicate bit in register C1CFG2, definition disabled
// static volatile bit SEG2PH2              @ ((unsigned)&C2CFG2)*8+10;

