Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: C2INTF
static volatile unsigned int            C2INTF              @ 0x456;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned RXB0OVFL            : 1;
        volatile unsigned RXB1OVFL            : 1;
        volatile unsigned TXBO                : 1;
        volatile unsigned TXBP                : 1;
        volatile unsigned RXBP                : 1;
        volatile unsigned TXWARN              : 1;
        volatile unsigned RXWARN              : 1;
        volatile unsigned EWARN               : 1;
        volatile unsigned IRXIF               : 1;
        volatile unsigned WAKIF               : 1;
        volatile unsigned ERRIF               : 1;
        volatile unsigned TXB2IF              : 1;
        volatile unsigned TXB1IF              : 1;
        volatile unsigned TXB0IF              : 1;
        volatile unsigned RXB1IF              : 1;
        volatile unsigned RXB0IF              : 1;
    };
} C2INTFbits @ 0x456;
// bit variable definitions
// duplicate bit in register C1INTF, definition disabled
// static volatile bit RXB0IF               @ ((unsigned)&C2INTF)*8+0;
// duplicate bit in register C1INTF, definition disabled
// static volatile bit RXB1IF               @ ((unsigned)&C2INTF)*8+1;
// duplicate bit in register C1INTF, definition disabled
// static volatile bit TXB0IF               @ ((unsigned)&C2INTF)*8+2;
// duplicate bit in register C1INTF, definition disabled
// static volatile bit TXB1IF               @ ((unsigned)&C2INTF)*8+3;
// duplicate bit in register C1INTF, definition disabled
// static volatile bit TXB2IF               @ ((unsigned)&C2INTF)*8+4;
// duplicate bit in register C1INTF, definition disabled
// static volatile bit ERRIF                @ ((unsigned)&C2INTF)*8+5;
// duplicate bit in register C1INTF, definition disabled
// static volatile bit WAKIF                @ ((unsigned)&C2INTF)*8+6;
// duplicate bit in register C1INTF, definition disabled
// static volatile bit IRXIF                @ ((unsigned)&C2INTF)*8+7;
// duplicate bit in register C1INTF, definition disabled
// static volatile bit EWARN                @ ((unsigned)&C2INTF)*8+8;
// duplicate bit in register C1INTF, definition disabled
// static volatile bit RXWARN               @ ((unsigned)&C2INTF)*8+9;
// duplicate bit in register C1INTF, definition disabled
// static volatile bit TXWARN               @ ((unsigned)&C2INTF)*8+10;
// duplicate bit in register C1INTF, definition disabled
// static volatile bit RXBP                 @ ((unsigned)&C2INTF)*8+11;
// duplicate bit in register C1INTF, definition disabled
// static volatile bit TXBP                 @ ((unsigned)&C2INTF)*8+12;
// duplicate bit in register C1INTF, definition disabled
// static volatile bit TXBO                 @ ((unsigned)&C2INTF)*8+13;
// duplicate bit in register C1INTF, definition disabled
// static volatile bit RXB1OVFL             @ ((unsigned)&C2INTF)*8+14;
// duplicate bit in register C1INTF, definition disabled
// static volatile bit RXB0OVFL             @ ((unsigned)&C2INTF)*8+15;

// Register: C2INTE
static volatile unsigned int            C2INTE              @ 0x458;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 8;
        volatile unsigned IRXIE               : 1;
        volatile unsigned WAKIE               : 1;
        volatile unsigned ERRIE               : 1;
        volatile unsigned TXB2IE              : 1;
        volatile unsigned TXB1IE              : 1;
        volatile unsigned TXB0IE              : 1;
        volatile unsigned RXB1IE              : 1;
        volatile unsigned RXB0IE              : 1;
    };
} C2INTEbits @ 0x458;
// bit variable definitions
// duplicate bit in register C1INTE, definition disabled
// static volatile bit RXB0IE               @ ((unsigned)&C2INTE)*8+0;
// duplicate bit in register C1INTE, definition disabled
// static volatile bit RXB1IE               @ ((unsigned)&C2INTE)*8+1;
// duplicate bit in register C1INTE, definition disabled
// static volatile bit TXB0IE               @ ((unsigned)&C2INTE)*8+2;
// duplicate bit in register C1INTE, definition disabled
// static volatile bit TXB1IE               @ ((unsigned)&C2INTE)*8+3;
// duplicate bit in register C1INTE, definition disabled
// static volatile bit TXB2IE               @ ((unsigned)&C2INTE)*8+4;
// duplicate bit in register C1INTE, definition disabled
// static volatile bit ERRIE                @ ((unsigned)&C2INTE)*8+5;
// duplicate bit in register C1INTE, definition disabled
// static volatile bit WAKIE                @ ((unsigned)&C2INTE)*8+6;
// duplicate bit in register C1INTE, definition disabled
// static volatile bit IRXIE                @ ((unsigned)&C2INTE)*8+7;

// Register: C2EC
static volatile unsigned int            C2EC                @ 0x45A;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TEC                 : 8;
        volatile unsigned REC                 : 8;
    };
    struct {
        volatile unsigned TEC7                : 1;
        volatile unsigned TEC6                : 1;
        volatile unsigned TEC5                : 1;
        volatile unsigned TEC4                : 1;
        volatile unsigned TEC3                : 1;
        volatile unsigned TEC2                : 1;
        volatile unsigned TEC1                : 1;
        volatile unsigned TEC0                : 1;
        volatile unsigned REC7                : 1;
        volatile unsigned REC6                : 1;
        volatile unsigned REC5                : 1;
        volatile unsigned REC4                : 1;
        volatile unsigned REC3                : 1;
        volatile unsigned REC2                : 1;
        volatile unsigned REC1                : 1;
        volatile unsigned REC0                : 1;
    };
} C2ECbits @ 0x45A;
// bit variable definitions
// duplicate bit in register C1EC, definition disabled
// static volatile bit REC0                 @ ((unsigned)&C2EC)*8+0;
// duplicate bit in register C1EC, definition disabled
// static volatile bit REC1                 @ ((unsigned)&C2EC)*8+1;
// duplicate bit in register C1EC, definition disabled
// static volatile bit REC2                 @ ((unsigned)&C2EC)*8+2;
// duplicate bit in register C1EC, definition disabled
// static volatile bit REC3                 @ ((unsigned)&C2EC)*8+3;
// duplicate bit in register C1EC, definition disabled
// static volatile bit REC4                 @ ((unsigned)&C2EC)*8+4;
// duplicate bit in register C1EC, definition disabled
// static volatile bit REC5                 @ ((unsigned)&C2EC)*8+5;
// duplicate bit in register C1EC, definition disabled
// static volatile bit REC6                 @ ((unsigned)&C2EC)*8+6;
// duplicate bit in register C1EC, definition disabled
// static volatile bit REC7                 @ ((unsigned)&C2EC)*8+7;
// duplicate bit in register C1EC, definition disabled
// static volatile bit TEC0                 @ ((unsigned)&C2EC)*8+8;
// duplicate bit in register C1EC, definition disabled
// static volatile bit TEC1                 @ ((unsigned)&C2EC)*8+9;
// duplicate bit in register C1EC, definition disabled
// static volatile bit TEC2                 @ ((unsigned)&C2EC)*8+10;
// duplicate bit in register C1EC, definition disabled
// static volatile bit TEC3                 @ ((unsigned)&C2EC)*8+11;
// duplicate bit in register C1EC, definition disabled
// static volatile bit TEC4                 @ ((unsigned)&C2EC)*8+12;
// duplicate bit in register C1EC, definition disabled
// static volatile bit TEC5                 @ ((unsigned)&C2EC)*8+13;
// duplicate bit in register C1EC, definition disabled
// static volatile bit TEC6                 @ ((unsigned)&C2EC)*8+14;
// duplicate bit in register C1EC, definition disabled
// static volatile bit TEC7                 @ ((unsigned)&C2EC)*8+15;

// Register: RCON
static volatile unsigned int            RCON                @ 0x740;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned TRAPR               : 1;
        volatile unsigned IOPUWR              : 1;
        volatile unsigned BGST                : 1;
        volatile unsigned                     : 5;
        volatile unsigned EXTR                : 1;
        volatile unsigned SWR                 : 1;
        volatile unsigned SWDTEN              : 1;
        volatile unsigned WDTO                : 1;
        volatile unsigned SLEEP               : 1;
        volatile unsigned IDLE                : 1;
        volatile unsigned BOR                 : 1;
        volatile unsigned POR                 : 1;
    };
} RCONbits @ 0x740;
// bit variable definitions
static volatile bit POR                  @ ((unsigned)&RCON)*8+0;
static volatile bit BOR                  @ ((unsigned)&RCON)*8+1;
static volatile bit IDLE                 @ ((unsigned)&RCON)*8+2;
static volatile bit SLEEP                @ ((unsigned)&RCON)*8+3;
static volatile bit WDTO                 @ ((unsigned)&RCON)*8+4;
static volatile bit SWDTEN               @ ((unsigned)&RCON)*8+5;
static volatile bit SWR                  @ ((unsigned)&RCON)*8+6;
static volatile bit EXTR                 @ ((unsigned)&RCON)*8+7;
static volatile bit BGST                 @ ((unsigned)&RCON)*8+13;
static volatile bit IOPUWR               @ ((unsigned)&RCON)*8+14;
static volatile bit TRAPR                @ ((unsigned)&RCON)*8+15;

// Register: OSCCON
static volatile unsigned int            OSCCON              @ 0x742;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 1;
        volatile unsigned COSC                : 3;
        volatile unsigned                     : 1;
        volatile unsigned NOSC                : 3;
        volatile unsigned POST                : 2;
        volatile unsigned LOCK                : 1;
        volatile unsigned                     : 1;
        volatile unsigned CF                  : 1;
        volatile unsigned                     : 1;
        volatile unsigned LPOSCEN             : 1;
        volatile unsigned OSWEN               : 1;
    };
    struct {
        volatile unsigned                     : 1;
        volatile unsigned COSC2               : 1;
        volatile unsigned COSC1               : 1;
        volatile unsigned COSC0               : 1;
        volatile unsigned                     : 1;
        volatile unsigned NOSC2               : 1;
        volatile unsigned NOSC1               : 1;
        volatile unsigned NOSC0               : 1;
        volatile unsigned POST1               : 1;
        volatile unsigned POST0               : 1;
        volatile unsigned                     : 6;
    };
} OSCCONbits @ 0x742;
// bit variable definitions
static volatile bit OSWEN                @ ((unsigned)&OSCCON)*8+0;
static volatile bit LPOSCEN              @ ((unsigned)&OSCCON)*8+1;
static volatile bit CF                   @ ((unsigned)&OSCCON)*8+3;
static volatile bit LOCK                 @ ((unsigned)&OSCCON)*8+5;
static volatile bit POST0                @ ((unsigned)&OSCCON)*8+6;
static volatile bit POST1                @ ((unsigned)&OSCCON)*8+7;
static volatile bit NOSC0                @ ((unsigned)&OSCCON)*8+8;
static volatile bit NOSC1                @ ((unsigned)&OSCCON)*8+9;
static volatile bit NOSC2                @ ((unsigned)&OSCCON)*8+10;
static volatile bit COSC0                @ ((unsigned)&OSCCON)*8+12;
static volatile bit COSC1                @ ((unsigned)&OSCCON)*8+13;
static volatile bit COSC2                @ ((unsigned)&OSCCON)*8+14;

// Register: OSCTUN
static volatile unsigned int            OSCTUN              @ 0x744;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 10;
        volatile unsigned TUN                 : 6;
    };
    struct {
        volatile unsigned                     : 10;
        volatile unsigned TUN5                : 1;
        volatile unsigned TUN4                : 1;
        volatile unsigned TUN3                : 1;
        volatile unsigned TUN2                : 1;
        volatile unsigned TUN1                : 1;
        volatile unsigned TUN0                : 1;
    };
} OSCTUNbits @ 0x744;
// bit variable definitions
static volatile bit TUN0                 @ ((unsigned)&OSCTUN)*8+0;
static volatile bit TUN1                 @ ((unsigned)&OSCTUN)*8+1;
static volatile bit TUN2                 @ ((unsigned)&OSCTUN)*8+2;
static volatile bit TUN3                 @ ((unsigned)&OSCTUN)*8+3;
static volatile bit TUN4                 @ ((unsigned)&OSCTUN)*8+4;
static volatile bit TUN5                 @ ((unsigned)&OSCTUN)*8+5;

// Register: BSRAM
static volatile unsigned int            BSRAM               @ 0x750;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 13;
        volatile unsigned IW_BSR              : 1;
        volatile unsigned IR_BSR              : 1;
        volatile unsigned RL_BSR              : 1;
    };
} BSRAMbits @ 0x750;
// bit variable definitions
static volatile bit RL_BSR               @ ((unsigned)&BSRAM)*8+0;
static volatile bit IR_BSR               @ ((unsigned)&BSRAM)*8+1;
static volatile bit IW_BSR               @ ((unsigned)&BSRAM)*8+2;

// Register: SSRAM
static volatile unsigned int            SSRAM               @ 0x752;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 13;
        volatile unsigned IW_SSR              : 1;
        volatile unsigned IR_SSR              : 1;
        volatile unsigned RL_SSR              : 1;
    };
} SSRAMbits @ 0x752;
// bit variable definitions
static volatile bit RL_SSR               @ ((unsigned)&SSRAM)*8+0;
static volatile bit IR_SSR               @ ((unsigned)&SSRAM)*8+1;
static volatile bit IW_SSR               @ ((unsigned)&SSRAM)*8+2;

// Register: NVMCON
static volatile unsigned int            NVMCON              @ 0x760;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned WR                  : 1;
        volatile unsigned WREN                : 1;
        volatile unsigned WRERR               : 1;
        volatile unsigned                     : 4;
        volatile unsigned TWRI                : 1;
        volatile unsigned                     : 1;
        volatile unsigned PROGOP              : 7;
    };
    struct {
        volatile unsigned                     : 9;
        volatile unsigned PROGOP6             : 1;
        volatile unsigned PROGOP5             : 1;
        volatile unsigned PROGOP4             : 1;
        volatile unsigned PROGOP3             : 1;
        volatile unsigned PROGOP2             : 1;
        volatile unsigned PROGOP1             : 1;
        volatile unsigned PROGOP0             : 1;
    };
} NVMCONbits @ 0x760;
// bit variable definitions
static volatile bit TWRI                 @ ((unsigned)&NVMCON)*8+8;
static volatile bit WRERR                @ ((unsigned)&NVMCON)*8+13;
static volatile bit WREN                 @ ((unsigned)&NVMCON)*8+14;
static volatile bit WR                   @ ((unsigned)&NVMCON)*8+15;
static volatile bit PROGOP0              @ ((unsigned)&NVMCON)*8+0;
static volatile bit PROGOP1              @ ((unsigned)&NVMCON)*8+1;
static volatile bit PROGOP2              @ ((unsigned)&NVMCON)*8+2;
static volatile bit PROGOP3              @ ((unsigned)&NVMCON)*8+3;
static volatile bit PROGOP4              @ ((unsigned)&NVMCON)*8+4;
static volatile bit PROGOP5              @ ((unsigned)&NVMCON)*8+5;
static volatile bit PROGOP6              @ ((unsigned)&NVMCON)*8+6;

// Register: NVMADR
static volatile unsigned int            NVMADR              @ 0x762;

// Register: NVMADRU
static volatile unsigned int            NVMADRU             @ 0x764;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 8;
        volatile unsigned NVMADR              : 8;
    };
} NVMADRUbits @ 0x764;

// Register: NVMKEY
static volatile unsigned int            NVMKEY              @ 0x766;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned                     : 8;
        volatile unsigned KEY                 : 8;
    };
} NVMKEYbits @ 0x766;

// Register: PMD1
static volatile unsigned int            PMD1                @ 0x770;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned T5MD                : 1;
        volatile unsigned T4MD                : 1;
        volatile unsigned T3MD                : 1;
        volatile unsigned T2MD                : 1;
        volatile unsigned T1MD                : 1;
        volatile unsigned QEIMD               : 1;
        volatile unsigned PWMMD               : 1;
        volatile unsigned                     : 1;
        volatile unsigned I2CMD               : 1;
        volatile unsigned U2MD                : 1;
        volatile unsigned U1MD                : 1;
        volatile unsigned SPI2MD              : 1;
        volatile unsigned SPI1MD              : 1;
        volatile unsigned C2MD                : 1;
        volatile unsigned C1MD                : 1;
        volatile unsigned ADCMD               : 1;
    };
} PMD1bits @ 0x770;
// bit variable definitions
static volatile bit ADCMD                @ ((unsigned)&PMD1)*8+0;
static volatile bit C1MD                 @ ((unsigned)&PMD1)*8+1;
static volatile bit C2MD                 @ ((unsigned)&PMD1)*8+2;
static volatile bit SPI1MD               @ ((unsigned)&PMD1)*8+3;
static volatile bit SPI2MD               @ ((unsigned)&PMD1)*8+4;
static volatile bit U1MD                 @ ((unsigned)&PMD1)*8+5;
static volatile bit U2MD                 @ ((unsigned)&PMD1)*8+6;
static volatile bit I2CMD                @ ((unsigned)&PMD1)*8+7;
static volatile bit PWMMD                @ ((unsigned)&PMD1)*8+9;
static volatile bit QEIMD                @ ((unsigned)&PMD1)*8+10;
static volatile bit T1MD                 @ ((unsigned)&PMD1)*8+11;
static volatile bit T2MD                 @ ((unsigned)&PMD1)*8+12;
static volatile bit T3MD                 @ ((unsigned)&PMD1)*8+13;
static volatile bit T4MD                 @ ((unsigned)&PMD1)*8+14;
static volatile bit T5MD                 @ ((unsigned)&PMD1)*8+15;

