Mrjpm/Tutorial/Aspirobot/FreeRTOS/include/dspic30f6010a.h
// Register: PMD2
static volatile unsigned int            PMD2                @ 0x772;
// bitfield definitions
static volatile union {
    struct {
        volatile unsigned IC8MD               : 1;
        volatile unsigned IC7MD               : 1;
        volatile unsigned IC6MD               : 1;
        volatile unsigned IC5MD               : 1;
        volatile unsigned IC4MD               : 1;
        volatile unsigned IC3MD               : 1;
        volatile unsigned IC2MD               : 1;
        volatile unsigned IC1MD               : 1;
        volatile unsigned OC8MD               : 1;
        volatile unsigned OC7MD               : 1;
        volatile unsigned OC6MD               : 1;
        volatile unsigned OC5MD               : 1;
        volatile unsigned OC4MD               : 1;
        volatile unsigned OC3MD               : 1;
        volatile unsigned OC2MD               : 1;
        volatile unsigned OC1MD               : 1;
    };
    struct {
        volatile unsigned                     : 14;
        volatile unsigned IDLE_MODE           : 1;
        volatile unsigned SLEEP_MODE          : 1;
    };
} PMD2bits @ 0x772;
// bit variable definitions
static volatile bit OC1MD                @ ((unsigned)&PMD2)*8+0;
static volatile bit OC2MD                @ ((unsigned)&PMD2)*8+1;
static volatile bit OC3MD                @ ((unsigned)&PMD2)*8+2;
static volatile bit OC4MD                @ ((unsigned)&PMD2)*8+3;
static volatile bit OC5MD                @ ((unsigned)&PMD2)*8+4;
static volatile bit OC6MD                @ ((unsigned)&PMD2)*8+5;
static volatile bit OC7MD                @ ((unsigned)&PMD2)*8+6;
static volatile bit OC8MD                @ ((unsigned)&PMD2)*8+7;
static volatile bit IC1MD                @ ((unsigned)&PMD2)*8+8;
static volatile bit IC2MD                @ ((unsigned)&PMD2)*8+9;
static volatile bit IC3MD                @ ((unsigned)&PMD2)*8+10;
static volatile bit IC4MD                @ ((unsigned)&PMD2)*8+11;
static volatile bit IC5MD                @ ((unsigned)&PMD2)*8+12;
static volatile bit IC6MD                @ ((unsigned)&PMD2)*8+13;
static volatile bit IC7MD                @ ((unsigned)&PMD2)*8+14;
static volatile bit IC8MD                @ ((unsigned)&PMD2)*8+15;
static volatile bit SLEEP_MODE           @ ((unsigned)&PMD2)*8+0;
static volatile bit IDLE_MODE            @ ((unsigned)&PMD2)*8+1;

#endif
